{
  "meta": {
    "qid": "archetypal-and-collective-realities",
    "title": "Archetypal and Collective Realities",
    "date": "2025-10-22",
    "version": "v1",
    "source_policy": "Book-first. Public transcripts as color with timestamped links."
  },
  "book": {
    "chunks": [
      {
        "text": "nd both are transcended by Platonic, archetypal levels radically beyond our human collective psyche.\nFrom archetypal reality and beyond, everything was about entering deeper levels of what is real. We’re not used to thinking of physical reality as surface real, with deeper structures being more real—but quantum theory is comfortable with that, string theorists are comfortable with that. We should be comfortable with that in psychology.\n\nLuc Briede-Cooper:\nThere’s something intuitive about that. People do have experiences of degrees of reality sometimes. Sticking with the reality point for a minute: there’s depersonalization/derealization disorder—rare as a disorder, but more than 50% of people experience at least a moment of derealization in their lifetime. There’s also schizophrenia, which has an interesting relationship to mystical visions that Jung noted, and psychedelics can induce or worsen schizophrenic symptoms. The visions in schizophrenia can overlap with psychedelic visions. I’m curious: did your sense of mental illness change after your journeys?",
        "citation": "Bache · 2023-01-05 · Luc Briede-Cooper · Exploring LSD and the Mind of the Universe",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Exploring LSD and the Mind of the Universe",
        "_score": 0.6446702480316162
      },
      {
        "text": "edelics is about.\n\nRyan Kemp\nWould you describe that as what Jung termed the collective unconscious?\nChris Bache\nThe collective unconscious is a stratum of consciousness below the personal unconscious. In Jung’s model, when we go below our conscious mind, we first encounter our personal unconscious. If you go deeper, you enter a stream of awareness shared by all human beings of your species—Jung’s collective psyche. Deeper still, you can enter broader streams—what some would call global consciousness—and then levels that go beyond space-time altogether: archetypal levels, complete states of dissolving into non-duality and what might be called causal oneness, and deeper states even than that. It’s a long journey with many levels of exploration along the way.\n\nRyan Kemp\nSo, as in Jung and in many spiritual and religious texts, we have our personal, individual mind, but the universe itself is a mind, a oneness of its own. Is that correct?",
        "citation": "Bache · 2020-05-13 · Ryan & Mo - Life In Rural Thailand · EP.6 - Chris Bache | LSD AND THE MIND OF THE UNIVERSE",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "EP.6 - Chris Bache | LSD AND THE MIND OF THE UNIVERSE",
        "_score": 0.6433024406433105
      },
      {
        "text": "ings seriously as saying something about the nature of reality, rather than just an inner adventure?\nChris Bache:\nGood question—and the critical one. Why isn’t this just echoes of my personal unconscious or of the collective unconscious, rather than something that goes beyond those canyon walls? A couple of things.\n\nFirst, are the experiences replicable? Do they show up in the sessions of other people? If it were just me describing these levels of reality, it might be as you say. But the cosmology that emerges in psychedelic states is echoed in the work of other psychedelicists—if they’re using a method and substance with sufficient power to break through the same number of layers. There is a convergence of experience at deep levels; when I describe my experiences, other journeyers recognize them as reflecting their own.",
        "citation": "Bache · 2022-08-30 · Tasshin Fogleman · Psychedelics and Cosmological Exploration with Chris Bache – Reach Truth Podcast",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Psychedelics and Cosmological Exploration with Chris Bache – Reach Truth Podcast",
        "_score": 0.6326843500137329
      },
      {
        "text": "collective psyche and was gradually being taught how to experience how reality works at that level.\nIn my experience, there were two archetypal levels: a high subtle level and a low subtle level. At the high subtle level—what I think of as Platonic—I encountered living forms responsible for creating spacetime and its core structures. They were vast, enormous, like galaxies billions of light years across. They were archetypes, not static ideas in the mind of an unchanging god, but living forms evolving over vast tracts of time. At the lower subtle, more Jungian level, I entered into the living tissue of the collective psyche. I had experiences of the wholeness that the human psyche and even the human body represents—how we’re all fractal manifestations of a larger pattern, and how each of us, by healing our personal diseases, contributes to the collective, archetypal human body becoming stronger through history.",
        "citation": "Bache · 2018-08-30 · TimeWaver TV · Diamonds from Heaven – Lecture at TimeWaver Summer World 2018",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Diamonds from Heaven – Lecture at TimeWaver Summer World 2018",
        "_score": 0.6297932267189026
      },
      {
        "text": "amed it. I couldn’t penetrate beyond that; they were too big and foreign to give them coherent form.\nAt a lower level of archetypal reality—call it a Jungian level—I repeatedly experienced the human psyche and the human species as a single integrated organism, with physical and mental networks connecting it like neurology. I was shown how the individual is hardwired and soft-wired into this matrix, how the species mind informs our individual consciousness, and how our individual work reaches out to inform and structure future species consciousness. I saw that each of us carries a holographic, fractal piece of the diseases of our time—mental and physical—and as we heal ourselves, we contribute to healing the collective psyche. In that sense, you could say the collective psyche is more real than the individual psyche, though I’d put it differently: the individual is real; the collective is real. They operate on different scales and are mutually implicated. And both are transcended by Platonic, archetypal levels radically beyond our human collective psyche.",
        "citation": "Bache · 2023-01-05 · Luc Briede-Cooper · Exploring LSD and the Mind of the Universe",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Exploring LSD and the Mind of the Universe",
        "_score": 0.6295589208602905
      },
      {
        "text": "eally look forward to sharing the experiences I report in my book, LSD and the Mind of the Universe.\nDavid has framed our conversation as the question of whether we can all access the cosmic mind using psychedelics. I believe that we all can, but whether we all should is another matter entirely. In contrast to the early idea that psychedelics represent a shortcut to mystical experience, my concern is that the psychedelic journey into the cosmic mind is extremely demanding and must be approached with great care and caution.\n\nIn LSD and the Mind of the Universe, I describe experiences that opened in 73 high-dose LSD sessions conducted over 20 years when I was a young man between 30 and 50 years old, from 1979 to 1999. I then spent another 20 years thinking about these experiences, digesting them, mapping them, and pondering their implications. I hope the visions I brought back will be useful not only to other psychonauts but also to those who would never take a psychedelic themselves. What’s important is the vision of the cosmos they contain, and a vision of where humanity is in its long evolutionary journey and the turning point we’re coming to.",
        "citation": "Bache · 2022-12-07 · Scientific & Medical Network · LSD & the Mind of the Universe (SMN webinar)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD & the Mind of the Universe (SMN webinar)",
        "_score": 0.628665030002594
      },
      {
        "text": "They’re complex, interwoven, involving many levels of reality orchestrated in tidal surges of state.\nThere was a systematic instruction: one session more or less started where the previous session stopped. When you work systematically, there’s a progressive deepening. It took years to understand what the universe was showing me—where it was taking me. I had a sense of a systematic encounter with an intelligence orchestrating my experience in dialogue with me—not taking any deity or archetypal form, always dissolving into deeper layers of infinity when pressed. That, cumulatively, is the story I’m telling in LSD in the Mind of the Universe.\n\nRachel Fleming: Would you say this is an objective reality—that if someone used a similar method, they would reach the unfolding you did? Or is that not possible to say?",
        "citation": "Bache · 2023-11-05 · Sacred Reconnections · Diamonds From Heaven – The Mind of the Universe (Chris Bache)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Diamonds From Heaven – The Mind of the Universe (Chris Bache)",
        "_score": 0.6226058006286621
      },
      {
        "text": "l intermediate structures—super-intelligent, super-powerful—focusing energy down into manifestation.\nWhen I experienced the collective psyche and a lower level of archetypes in Jung’s sense, I didn’t meet “wise old man” figures. It’s not that I don’t think those exist, but what I experienced was humanity as a single organism, over and over, with metameridians that wove our individual lives into the life of the species. Our minds are woven into the collective mind—there are seed crystals within it. Even our bodies and diseases are part of the body of humanity evolving over long periods. So “archetypal” here means trans-individual motifs within the human psyche. In the Platonic sense, there are metaphysical archetypes that inform the manifestation of time and space itself.\n\nEmmy Vadnais: At the causal level, you mentioned this is where you connect with divine intelligence, or what we perceive as God. People may wonder: did you discover that there is a God?",
        "citation": "Bache · 2025-03-18 · New Thinking Allowed · Psychedelics and the Cosmic Mind",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "_score": 0.6191936731338501
      },
      {
        "text": "folding into deeper levels of reality. This may not be true for everyone; it simply was true for me.\nLSD is often likened to the atomic bomb, invented in the same decade. I use the nuclear explosion as an image of the combustive fire generated in a long series of sessions—this cycle of death and rebirth. As it continues, it activates and brings into conscious awareness deeper levels of the universe, just as a nuclear explosion brings into visible form atmospheric layers that were always there but hidden. It is the power of the psychedelic dynamic that brings these dimensions into our conscious awareness. We’re not talking about literal explosions, but exploration into the mind of the universe—the cosmic mind.\n\nAt the end of my journey, looking back, I identified five strata I had entered systematically over 20 years: the personal mind; the collective mind (our species); archetypal mind; causal oneness; and diamond luminosity. I’ll take you into the book chapter by chapter with a few highlights, just to invite you into the dialogue.",
        "citation": "Bache · 2022-12-07 · Scientific & Medical Network · LSD & the Mind of the Universe (SMN webinar)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD & the Mind of the Universe (SMN webinar)",
        "_score": 0.6167129874229431
      },
      {
        "text": "ss LSD? Many will see this as a discussion on drugs, when actually it’s something far more profound.\nChris Bache\nWe all suffer from the carryover of our culture’s experience with psychedelics in the 1960s and the negative press generated around them, when the true story is very different. Psychedelics in general, and LSD in particular, function as non-specific amplifiers and catalysts of consciousness. They don’t give you a particular experience; they hyper-amplify your consciousness. If you use those hours of hyper-amplified consciousness carefully—shutting out all outside stimulus and focusing entirely within—you can use them to explore and, in a sense, excavate the deep architecture of the psyche and the nature of consciousness itself.",
        "citation": "Bache · 2020-05-13 · Ryan & Mo - Life In Rural Thailand · EP.6 - Chris Bache | LSD AND THE MIND OF THE UNIVERSE",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "EP.6 - Chris Bache | LSD AND THE MIND OF THE UNIVERSE",
        "_score": 0.6156998872756958
      },
      {
        "text": "the collective structure of consciousness and the collective import of our transformative practices.\nThen I wrote The Living Classroom in 2008. Even though my students never knew about my psychedelic experiences—I didn’t talk about them on campus for obvious legal reasons—I found that my students were being impacted by my work. There was a ripple effect: the deeper I went into the unified fabric of reality, the more ripples of transformation seemed to radiate around me. I had to study this, to understand what was happening. The Living Classroom is about collective consciousness; I don’t mention psychedelics because the issue is the nature of consciousness itself. It doesn’t matter which transformational method you use—if you go deeply enough, ramifications will spread out around you in 360 degrees.\n\nAll of this comes out of my psychedelic work. LSD and the Mind of the Universe: Diamonds from Heaven really tells the core story of this journey. Thank you for letting me describe it today.",
        "citation": "Bache · 2021-06-03 · Portland Psychedelic Society · LSD and the Mind of the Universe – Christopher Bache, Ph.D.",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD and the Mind of the Universe – Christopher Bache, Ph.D.",
        "_score": 0.6156277656555176
      },
      {
        "text": "on: from the personal to the collective, into subtler and causal levels of reality, and Non-duality.\nA reporter once asked me that question and I made a list of highlights; I included it in the last chapter of the book. I can’t remember them all now, so I’ll approximate. I discovered that underlying all existence is a singular intelligence of unbelievable magnitude—a creative genius—and that the physical universe is the manifest body of this intelligence. The world we’re living in is the physical body of the Divine. None of this is new. The cosmology that emerges in psychedelics essentially matches the cosmology of the great mystical traditions of classical contemplative cultures. It’s a different technique—a different trigger protocol—for accessing these dimensions, but the teachings are familiar.",
        "citation": "Bache · 2025-05-18 · New Thinking Allowed · Diamond Luminosity (live stream)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Diamond Luminosity (live stream)",
        "_score": 0.611239492893219
      },
      {
        "text": "LSD and the Mind of the Universe is the memoir of a psychedelic explorer. It is the story of one person’s journey into the mind of the cosmos. I’ve tried to tell this story as concisely as I can, focusing on the journey itself and keeping theoretical discussion to a minimum. I will rely on other authors to give the reader the history and science of psychedelics, their psychopharmacology, and their clinical applications. I share my psychedelic experiences here not because I think they are special or unique, for they are not, but because, all things considered, they are the most valuable gift I have to offer the psychedelic conversation.",
        "citation": "LSDMU",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "",
        "_score": 0.6433573961257935
      },
      {
        "text": "*LSD and the Mind of the Universe is primarily a* cosmological narrative, not a therapeutic narrative. In a therapeutic narrative, the personal details are important; in a cosmological narrative, they are less so. Of course, this entire journey was deeply personal and I own it as such, but my personal story is not the important story here, nor is it essential to the story I want to convey. It is when one moves beyond the shoals of the personal psyche and enters the ocean of the deep psyche that the larger and more philosophically interesting story begins to emerge.",
        "citation": "LSDMU ch.1 §8 ¶7",
        "chapter_code": "1",
        "section_code": "8",
        "archival_title": "",
        "_score": 0.6164701581001282
      },
      {
        "text": "This interpretation proposes that the working of the collective psyche parallels the working of the personal psyche in key respects. It proposes that just as painful experiences can accumulate and block the healthy functioning of the individual, similar blockages can occur at the collective level. It suggests that the unresolved anguish of human history might still be active in the collective memory of our species, burdening its life just as our personal unresolved anguish burdens ours. Continuing the parallel, if the conscious engagement of unresolved pain can bring therapeutic relief at the personal level, the same may also occur at the species level. Normally, we would expect such healing to take the form of reform movements or cultural shifts in which large numbers of people confront and heal some painful legacy from our past. Within the context of LSD therapy, however, a new possibility seems to be emerging. In this setting, an individual seems to be able to tap into and directly facilitate a healing of some portion of the collective psyche. The process of engaging and healing a collective META-COEX system in a psychedelic session is essentially the same as engaging and healing a personal COEX system, but enacted on a much larger scale and a different level of consciousness. Grof has embraced this expansion of his paradigm.",
        "citation": "LSDMU ch.6 §1 ¶5",
        "chapter_code": "6",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.6013902425765991
      },
      {
        "text": "And last, this book has two titles, what Tibetans would call an outer title and an inner title. LSD and the Mind of the Universe is its outer title, describing what the book is about—exploring the mind of the universe through carefully conducted LSD sessions. Diamonds from Heaven is its inner title, describing its innermost essence, for at the center of the mind of the universe, one enters the infinite clear light of Diamond Luminosity.",
        "citation": "LSDMU",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "",
        "_score": 0.5857125520706177
      },
      {
        "text": "The collective psyche appears to organize its memories in ways that parallel how the personal unconscious organizes its memories. Grof has demonstrated that our personal unconscious organizes its memories into *clusters of experience* that come from different periods of our life but share a common emotional theme. As we saw in chapter 2, he calls these clusters of condensed experience COEX systems. The psychedelic experiences presented in this chapter suggest that the collective unconscious organizes its vast store of memories in a similar fashion. It appears to gather the memories of humanity into *giant memory clusters* that come from different people and different historical periods but share a common emotional theme. I call these collective memory clusters META-COEX systems. The structure of a META-COEX system parallels the structure of a personal COEX system, but it operates on a much larger scale and a different level of consciousness—the subtle level.",
        "citation": "LSDMU ch.4 §2 ¶6",
        "chapter_code": "4",
        "section_code": "2",
        "archival_title": "",
        "_score": 0.5759237408638
      },
      {
        "text": "What I experienced in this reality over the next ten sessions can be divided into two broad categories. The first set of experiences was more Platonic in nature and took place at what I would judge to be a higher subtle level. The second set was more Jungian in nature and took place at a lower subtle level. Both of these domains were archetypal but at different orders of scale. (For a short description of the concept of archetype and how I use this term, see the addendum at the end of this chapter, page 169.)",
        "citation": "LSDMU ch.7 §1 ¶11",
        "chapter_code": "7",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.5745652318000793
      },
      {
        "text": "In these respects, my view of the collective unconscious has been influenced by Rupert Sheldrake and his work on morphic fields and formative causation, which I have found to be deeply congruent with my psychedelic experience. From Sheldrake’s perspective, the collective psyche, or species-mind, influences its individual members, as Jung suggests. But Sheldrake goes further than Jung in proposing that the collective psyche also receives and integrates the learning of its members. Sheldrake envisions a complex feedback loop operating between the species-mind and individuals that allows the species-mind to learn as its members learn. Collective learning progresses more slowly than individual learning, but when the species-mind eventually grasps a truth, the resulting shift ripples through the entire species resulting in faster learning curves.",
        "citation": "LSDMU ch.7 §10 ¶5",
        "chapter_code": "7",
        "section_code": "10",
        "archival_title": "",
        "_score": 0.5640953183174133
      },
      {
        "text": "My encounter with the Living Forces of archetypal reality at the high subtle level seemed to awaken in me a capacity to experience the sinews of humanity’s collective being at a lower subtle level. Or perhaps this is simply where I was directed next. I think that the most important insights I received in these eleven sessions came from this more Jungian level. More significant than my brief contact with the largely inscrutable powers of high archetypal reality, being immersed in the tissue of humanity’s collective being showed me organic processes operating beneath the surface of our individual lives and weaving humanity into a larger whole. It was as though I was being taught to recognize the living tissue of our species. My experiences affirmed Jung’s core insight of the existence of a collective unconscious, but I did not experience the archetypes that he discusses, such as the mother, father, child, wise old man, trickster, or hero. I’m not suggesting these are not part of the collective psyche, just that they were not part of my experience of it.",
        "citation": "LSDMU ch.7 §3 ¶1",
        "chapter_code": "7",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.561435341835022
      },
      {
        "text": "For psychedelics to have their deepest impact on our culture, it is not sufficient for us to simply record the powerful experiences they unleash. We must also ground these experiences in critical discourse and place them in dialogue with other fields of learning where possible. For this reason, when I presented this session in *Dark Night, Early Dawn*, I unpacked its assertions about the role the collective psyche will play in humanity’s awakening as carefully and systematically as I could. These assertions are:",
        "citation": "LSDMU ch.9 §3 ¶1",
        "chapter_code": "9",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.5574495196342468
      },
      {
        "text": "All psychedelic disclosure is interactive. Everything we see and learn in these visionary states is shaped in subtle ways by what we are at the moment of contact. This does not mean that the visions we experience are merely projections of our personal psyche, as though we were not experiencing something that truly exists in the cosmos. Rather, it means that all visionary encounter is participatory. Our being evokes the portion of the universe we experience in these states, and the more conditioning we have let go of when this communion takes place, the more open-ended and far-reaching are the experiences that present themselves.",
        "citation": "LSDMU ch.1 §9 ¶2",
        "chapter_code": "1",
        "section_code": "9",
        "archival_title": "",
        "_score": 0.5535151958465576
      },
      {
        "text": "I experienced archetypal reality to be a bridge between the physical universe and the source of existence. Being ontologically prior to space-time in the Great Chain of Being, it is the seed reality of space-time. Many spiritual traditions describe creation as a process that flows from a single Source until it becomes the entire universe. In Taoism creation is said to flow from the Eternal Tao to the Ten Thousand Things; in Buddhism from the pregnant emptiness of *dharmakaya* to the pulsing complexity of *nirmanakaya*. On its way to manifesting physical reality, this outpouring of creativity manifests many intermediate levels, and the archetypal domain is one of these levels. More precisely, the archetypal domain is actually a cluster of levels.",
        "citation": "LSDMU ch.7 §0 ¶8",
        "chapter_code": "7",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5532069802284241
      },
      {
        "text": "collective unconscious of the human species. Now I was above that field, at some higher archetypal level of reality. As many times before, I had the clear sensation that something was working with me to consolidate a clear position at this level so that I could receive instruction about how reality functions here. I felt myself to be “above the world,” in a region of intelligence that creates and sustains physical reality. I worked hard to establish greater clarity at this level by cooperating with the forces that surrounded and saturated me. Many insights came concerning the broad sweep of creation, how consciousness consolidates itself into matter deliberately and by stages.",
        "citation": "LSDMU ch.7 §5 ¶4",
        "chapter_code": "7",
        "section_code": "5",
        "archival_title": "",
        "_score": 0.5511649250984192
      },
      {
        "text": "LSD and the Mind of the Universe is the memoir of a psychedelic explorer. It is the story of one person’s journey into the mind of the cosmos. I’ve tried to tell this story as concisely as I can, focusing on the journey itself and keeping theoretical discussion to a minimum. I will rely on other authors to give the reader the history and science of psychedelics, their psychopharmacology, and their clinical applications. I share my psychedelic experiences here not because I think they are special or unique, for they are not, but because, all things considered, they are the most valuable gift I have to offer the psychedelic conversation.",
        "citation": "LSD and the Mind of the Universe",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "",
        "_score": 0.6435357928276062
      },
      {
        "text": "And last, this book has two titles, what Tibetans would call an outer title and an inner title. LSD and the Mind of the Universe is its outer title, describing what the book is about—exploring the mind of the universe through carefully conducted LSD sessions. Diamonds from Heaven is its inner title, describing its innermost essence, for at the center of the mind of the universe, one enters the infinite clear light of Diamond Luminosity.",
        "citation": "LSD and the Mind of the Universe",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "",
        "_score": 0.5857889652252197
      },
      {
        "text": "When I entered the higher level of archetypal reality, my experience affirmed Plato’s core insight that there is a reality behind the physical universe that structures and informs our existence here, but what I encountered there did not match his description of this reality. What I experienced were not Plato’s eternal Ideas in the mind of an unchanging transcendent intelligence, but vast *living* dynamic forces embodying higher orders of intentionality and power and operating on a different order of time. It was like stepping off our feverishly spinning planet into the majestic arc of the Milky Way—all moving, all alive, but on different magnitudes of scale. Though these forces informed human experience, they were so far beyond humanity that even in my expanded state I could not grasp the full scope of their being. I could catch only fragments of their massive presence and hints of their influence.",
        "citation": "LSDMU ch.7 §2 ¶1",
        "chapter_code": "7",
        "section_code": "2",
        "archival_title": "",
        "_score": 0.5427957773208618
      },
      {
        "text": "Second, I use the term in a quasi-Jungian sense to describe patterns in the collective unconscious of humanity—patterns of collective memory, collective thought, collective learning, and even collective physiology. Like Jung, I understand the collective psyche to be the matrix within which our individual psyches operate, underpinning and influencing all our psychological, emotional, and mental processes. However, I see the collective psyche as being more dynamic than Jung did. I see it as itself learning and evolving over time, and therefore I see archetypes at this level as evolving over time. I also see them as more numerous than the relatively small handful of archetypes Jung analyzed.",
        "citation": "LSDMU ch.7 §10 ¶4",
        "chapter_code": "7",
        "section_code": "10",
        "archival_title": "",
        "_score": 0.5406756401062012
      },
      {
        "text": "I know it sounds arrogant to speak on such a scale, but I must if lam to describe the visions that repeatedly came through my sessions. Ego-death destroys the existential isolation and constant self-referencing that organizes our ordinary experience of the world. When the partitions of personal consciousness are surrendered, our experience spontaneously opens to the larger rhythms of life that we are part of. One portion of these rhythms is the collective psyche of our species. At the subtle level of consciousness, we can dissolve into the human species-mind so deeply that the beginnings and endings of our personal life become insignificant. When the “small-self” opens to the “species-self” this completely, it is only natural that insights into humanity’s larger developmental trajectory sometimes emerge in our awareness. We would be surprised if this did not happen.",
        "citation": "LSDMU ch.9 §0 ¶9",
        "chapter_code": "9",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.533950686454773
      },
      {
        "text": "Assume for the moment that through the fiery exercises of psychedelic exploration we have managed to stabilize experience at the high subtle level of consciousness. In order to reach this level, what “we” are has changed. We are no longer our private selves but have temporarily become some aspect of subtle level reality. Inside our sessions, we live as a life-form that breathes this rarified air. When through further exercises a doorway opens to still deeper levels of consciousness at the causal level, my experience has been that it allows a *cosmic communion* to take place between the causal and subtle realms. Deep communes with deep. Bringing different levels of spiritual reality into conscious communion with each other, even if for only a few hours, seems to nourish and bring joy to the weave of existence as the “below” remembers the “above” and the blessings of “above” pour more freely into the “below.” What is taking place is a cosmic dance between deep levels of the divine fabric. It is God communing with God, nourishing Its self-manifesting, self-emergent being in ways we may glimpse but perhaps never fully comprehend.",
        "citation": "LSDMU Appendix I §1 ¶22",
        "chapter_code": "",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.5305823683738708
      },
      {
        "text": "Experiencing human existence as a completely unified field made everything much easier to understand. The latticework of Mind that saturates and coordinates our individual lives has a logic to it that subsumes our individual perspectives. Today, physical reality was dissolving into its underlying matrix, and with it the reality of individual psyches disappeared. What I had previously conceptualized in atomistic terms as individual people choosing to reincarnate in order to clear their personal karmic patterns, I was now experiencing as a centralized decision to incarnate entire generations to cleanse the human mind-field of its collective karmic legacy. I saw no sustainable distinctions between individuals, only the web of life operating in an integrated, unified manner.",
        "citation": "LSDMU ch.7 §7 ¶9",
        "chapter_code": "7",
        "section_code": "7",
        "archival_title": "",
        "_score": 0.5252835750579834
      },
      {
        "text": "While I experienced subtle level reality as being more real than space-time reality, I want to add that just because something manifests at the subtle level of consciousness does not mean that it is real in the deepest sense of the term. For example, when someone experiences a particular deity in their sessions exactly as it is described in a culture’s scriptural tradition—holding traditional ritual objects or wearing traditional regalia—I believe they are experiencing one of two things: either a collective thoughtform or a spiritual presence wearing the clothes of a collective thoughtform. Either way, both reflect the strong influence of the collective psyche, and this places the experience at the subtle level of consciousness.",
        "citation": "LSDMU ch.7 §4 ¶1",
        "chapter_code": "7",
        "section_code": "4",
        "archival_title": "",
        "_score": 0.5249997973442078
      },
      {
        "text": "I wrote *Dark Night, Early Dawn* in part to answer the question: Why did death become as large as it did in my psychedelic journey? What is driving the healing process when it opens to such collective tracts? In that book, I abandoned the person-centered narrative I had been assuming and adopted an expanded narrative. By integrating Rupert Sheldrake’s concept of morphic fields into Grof’s paradigm, the way opened to viewing these collective ordeals as part of a larger transformational process aimed at healing wounds still carried in the collective psyche. I argued that in highly energized psychedelic states, the collective unconscious is sometimes activated to such a degree or in such a manner that it triggers a *collective* healing process. Through some fractal flip or quantum entanglement I had not anticipated or even thought possible at the time, the “patient” in my sessions had shifted from being me to being some portion of humanity itself.",
        "citation": "LSDMU ch.6 §1 ¶4",
        "chapter_code": "6",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.524742841720581
      },
      {
        "text": "Let me draw upon Sri Aurobindo’s involutionary/evolutionary cosmology here because it resonates strongly with the cosmology that emerges in psychedelic work, as Stan Grof has demonstrated in his beautiful book *The Cosmic Game*. According to Sri Aurobindo, in the cascading involution of the Divine, many levels of existence are manifested. While these levels may be porous from “above,” they are less porous from “below.” Like looking through a series of one-way mirrors, the Divine looking “down” sees everything It has become, but looking “up” from lower levels, the Divine sees less. When we who are below manage either by hard labor or by grace to access some of these higher levels, a special magic sometimes takes place.",
        "citation": "LSDMU Appendix I §1 ¶21",
        "chapter_code": "",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.5243667364120483
      }
    ]
  },
  "talks": {
    "queries": [
      "archetypal",
      "collective psyche",
      "perinatal matrices",
      "transpersonal",
      "cosmos and psyche",
      "jung archetypes"
    ],
    "chunks": [
      {
        "text": "reckoning: archetypal reality. The collective suffering never reappeared in any subsequent session.\nChris Bache:\nWhere I went next was into the greater realm of archetypal reality. I entered a reality that was more real than physical reality—like Plato’s cave, where someone escapes the cave and enters a world more real than the physical, which is disorienting at first. When I entered archetypal reality, I stayed there in my sessions for the next year and a half. I went through a death deeper than ego death: I had to cease to be a human being in any way, shape, or form. My consciousness could no longer operate within the confines of even our collective psyche. I entered a state of awareness beyond the collective psyche, and at that level I was being worked with, taught how reality functions.",
        "ts_url": "https://youtu.be/70TRNG1-ZEg?t=2052",
        "archival_title": "Mapping of Transcendence",
        "recorded_date": "2019-09-26",
        "_score": 0.6594324707984924,
        "start_hhmmss": "00:34:12"
      },
      {
        "text": "al reality.\n\nEmmy Vadnais: Why is it termed archetypal reality for those unfamiliar with archetypes?\nJeffrey Mishlove: I use “archetype” in two senses. Jung talked about archetypes as primary themes of human experience that become concretized in forms—wise old man, wise old woman, trickster, shadow—the dominant themes of the collective psyche. The second sense is Platonic: Plato’s discovery of a level of reality beyond time and space altogether.\n\nI experienced both, though not as Plato described them. He thought of archetypes as unchanging prototypes within the mind of an unchanging, infinite being. I experienced them as living entities—but living on a vast scale of time and space far beyond anything we know within time and space. What is shared is that for something to manifest in time and space, it comes out of the oneness through these fundamental intermediate structures—super-intelligent, super-powerful—focusing energy down into manifestation.",
        "ts_url": "https://youtu.be/FMgixG6Z0sk?t=3035",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "recorded_date": "2025-03-18",
        "_score": 0.6408437490463257,
        "start_hhmmss": "00:50:35"
      },
      {
        "text": "collective psyche and was gradually being taught how to experience how reality works at that level.\nIn my experience, there were two archetypal levels: a high subtle level and a low subtle level. At the high subtle level—what I think of as Platonic—I encountered living forms responsible for creating spacetime and its core structures. They were vast, enormous, like galaxies billions of light years across. They were archetypes, not static ideas in the mind of an unchanging god, but living forms evolving over vast tracts of time. At the lower subtle, more Jungian level, I entered into the living tissue of the collective psyche. I had experiences of the wholeness that the human psyche and even the human body represents—how we’re all fractal manifestations of a larger pattern, and how each of us, by healing our personal diseases, contributes to the collective, archetypal human body becoming stronger through history.",
        "ts_url": "https://youtu.be/O4ui6I1Wo9c?t=1324",
        "archival_title": "Diamonds from Heaven – Lecture at TimeWaver Summer World 2018",
        "recorded_date": "2018-08-30",
        "_score": 0.6253198981285095,
        "start_hhmmss": "00:22:04"
      },
      {
        "text": "ings seriously as saying something about the nature of reality, rather than just an inner adventure?\nChris Bache:\nGood question—and the critical one. Why isn’t this just echoes of my personal unconscious or of the collective unconscious, rather than something that goes beyond those canyon walls? A couple of things.\n\nFirst, are the experiences replicable? Do they show up in the sessions of other people? If it were just me describing these levels of reality, it might be as you say. But the cosmology that emerges in psychedelic states is echoed in the work of other psychedelicists—if they’re using a method and substance with sufficient power to break through the same number of layers. There is a convergence of experience at deep levels; when I describe my experiences, other journeyers recognize them as reflecting their own.",
        "ts_url": "https://youtu.be/FEQ8ony19sk?t=1433",
        "archival_title": "Psychedelics and Cosmological Exploration with Chris Bache – Reach Truth Podcast",
        "recorded_date": "2022-08-30",
        "_score": 0.6223481297492981,
        "start_hhmmss": "00:23:53"
      },
      {
        "text": "amed it. I couldn’t penetrate beyond that; they were too big and foreign to give them coherent form.\nAt a lower level of archetypal reality—call it a Jungian level—I repeatedly experienced the human psyche and the human species as a single integrated organism, with physical and mental networks connecting it like neurology. I was shown how the individual is hardwired and soft-wired into this matrix, how the species mind informs our individual consciousness, and how our individual work reaches out to inform and structure future species consciousness. I saw that each of us carries a holographic, fractal piece of the diseases of our time—mental and physical—and as we heal ourselves, we contribute to healing the collective psyche. In that sense, you could say the collective psyche is more real than the individual psyche, though I’d put it differently: the individual is real; the collective is real. They operate on different scales and are mutually implicated. And both are transcended by Platonic, archetypal levels radically beyond our human collective psyche.",
        "ts_url": "https://youtu.be/cvhWP8xzwiY?t=2559",
        "archival_title": "Exploring LSD and the Mind of the Universe",
        "recorded_date": "2023-01-05",
        "_score": 0.6150799989700317,
        "start_hhmmss": "00:42:39"
      },
      {
        "text": "the collective psyche. He further proposes that deeper journeys often move beyond entity-populated,\ngranular realms into vaster, less individuated fields of consciousness. Alongside sacred forms, powerful secular\n\naggregates—like greed or anger—operate similarly as collective thought forms.\n\nHOST: At an integration circle, someone told me he encountered Ganesh, the elephant god of Hinduism. After your journeys, how do you understand the meaning of meeting a deity in a particular form?\n\nCHRIS BACHE: When we experience realities beyond our ordinary consciousness and tap qualities like infinite compassion, infinite intelligence, and infinite creativity—qualities long associated with deities—it is not surprising that our psyche matches the phenomenology of the experience with the qualities of deities we know. Sometimes, however, we meet deities that are not part of our lineage and perhaps not even in our awareness. They can appear completely out of left field, yet take the recognizable cultural form of a deity—Ganesh, Jesus, Mary, the Prophet Muhammad, and others.",
        "ts_url": "https://youtu.be/jUFO4p4kA-k?t=0",
        "archival_title": "Dr. Chris Bache on Understanding DMT Entity Encounters",
        "recorded_date": "2022-02-16",
        "_score": 0.614094614982605,
        "start_hhmmss": "00:00:00"
      },
      {
        "text": "edelics is about.\n\nRyan Kemp\nWould you describe that as what Jung termed the collective unconscious?\nChris Bache\nThe collective unconscious is a stratum of consciousness below the personal unconscious. In Jung’s model, when we go below our conscious mind, we first encounter our personal unconscious. If you go deeper, you enter a stream of awareness shared by all human beings of your species—Jung’s collective psyche. Deeper still, you can enter broader streams—what some would call global consciousness—and then levels that go beyond space-time altogether: archetypal levels, complete states of dissolving into non-duality and what might be called causal oneness, and deeper states even than that. It’s a long journey with many levels of exploration along the way.\n\nRyan Kemp\nSo, as in Jung and in many spiritual and religious texts, we have our personal, individual mind, but the universe itself is a mind, a oneness of its own. Is that correct?",
        "ts_url": "https://youtu.be/Dw7D7ih8vy0?t=498",
        "archival_title": "EP.6 - Chris Bache | LSD AND THE MIND OF THE UNIVERSE",
        "recorded_date": "2020-05-13",
        "_score": 0.6110543012619019,
        "start_hhmmss": "00:08:18"
      },
      {
        "text": "se of that is very different from the tumultuous confusion that can arise in a pathological context.\nLuc Briede-Cooper:\nYou mentioned the five levels—the personal, the collective, the archetypal, the causal oneness, and the Diamond Luminosity. Could you take us up through those? I know you’ve said elsewhere it’s a hard question to talk about, so I won’t press too hard.\n\nChris Bache:\nWe’ve gone into archetypal reality and the collective dimension. In my experience, after about a year and a half—11 or 12 sessions, not much time given how vast archetypal reality is—I moved through it fairly quickly, not its breadth but penetrating through, and then entered yet another death and rebirth. It was a dying out of the greater real into an even greater real—letting go of another layer of assumptions—and entering a year of tremendously powerful experiences that I grouped as causal oneness.",
        "ts_url": "https://youtu.be/cvhWP8xzwiY?t=3022",
        "archival_title": "Exploring LSD and the Mind of the Universe",
        "recorded_date": "2023-01-05",
        "_score": 0.6099452376365662,
        "start_hhmmss": "00:50:22"
      },
      {
        "text": "ad to fall away to enter levels that humanity as a whole has not experienced, or only very few have.\nEven in archetypal reality, you’re dealing with profound consciousness, but there’s still dualism—a sense of self and other. When I went beyond archetypal reality into causal reality, all dualisms dissolved. You experience the world—whatever aspect you’re encountering—as a unified, single entity, a single consciousness. Plotinus says, “The world breathes as one.” There’s a radical transparency where you encounter the wholeness of life that doesn’t negate differentiation; it affirms it, as different manifestations of a single, undivided whole we call God, the Divine, or the One. That’s a different category of experience altogether from archetypal reality.\n\nEmmy Vadnais: Why is it termed archetypal reality for those unfamiliar with archetypes?",
        "ts_url": "https://youtu.be/FMgixG6Z0sk?t=2928",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "recorded_date": "2025-03-18",
        "_score": 0.608338475227356,
        "start_hhmmss": "00:48:48"
      },
      {
        "text": "ou feel you were encountering something on a scale much larger than humanity, truly cosmic in scope?\nChris Bache\nYes, absolutely. When I entered into archetypal reality and died as a human being—died to my species identity—my sessions took me outside the operational range of our collective psyche, beyond human experience and history. Moving beyond the collective psyche, everything associated with it fell away: our understandings and projections of God, the flotsam and jetsam of history. I moved into increasingly clear, contentless states of consciousness that are hard to describe. We should be careful with language: “universal mind” or “cosmic mind” are huge concepts. The only part of that mind I know is what it taught me. There was a consciousness that took me in, taught me, ground me up into dust, and took me deeper into itself. Even so, I was experiencing aspects—fractal manifestations—of its totality. My language peters out at that depth. In Diamond Luminosity, I had a clear perception of moving outside Samsara, outside the Bardo, into a reality even beyond archetypal reality. There was a period of being born into archetypal reality, and then a process of being born out of it into a level that pre-exists archetypal reality—absolutely non-physical.",
        "ts_url": "https://youtu.be/hr0nxquWvgQ?t=4211",
        "archival_title": "LSD & the Mind of the Universe (SMN webinar)",
        "recorded_date": "2022-12-07",
        "_score": 0.602308988571167,
        "start_hhmmss": "01:10:11"
      },
      {
        "text": "ment itself. Either way, the collective psyche is implicated, and that is perfectly normal and good.\nCHRIS BACHE: At the same time, it is possible to go beyond all collective thought forms and beyond human history. As one does, those forms tend to fade. There is much discussion of entities—especially because DMT and related substances often expose people to them—and I am not suggesting such entities are unreal. For me, entities reflect levels of reality. As one goes deeper, the granular quality of many individual beings yields to levels that are less granular, with fewer distinct beings, and then opens into vast tracts of consciousness that are less individual and less entity-like. At least, that has been my experience.",
        "ts_url": "https://youtu.be/jUFO4p4kA-k?t=194",
        "archival_title": "Dr. Chris Bache on Understanding DMT Entity Encounters",
        "recorded_date": "2022-02-16",
        "_score": 0.5961352586746216,
        "start_hhmmss": "00:03:14"
      },
      {
        "text": "any insights on how psychedelics or raising consciousness might help us find a better path forward?\nChris Bache:\nLet’s hold the second part and address the first, because this was one of the biggest surprises of my work. First, I had to let go of framing my work as personal journey—personal transformation, personal healing, personal awakening—and get involved in a much larger dance with the species mind and the collective unconscious, then be catapulted into archetypal reality and deeper, causal levels.\n\nWhat I'm about to say about where we are historically will sound outrageous and highly speculative, but when you work very deeply—far underneath the personal psyche, dropping into the collective psyche and into the creative intent underlying the evolution of our species—these things come into focus in ways that make sense from a quantum or post-Newtonian paradigm.",
        "ts_url": "https://youtu.be/AyMBQMGaIeA?t=2972",
        "archival_title": "What 73 High-Dose LSD Sessions Taught Christopher Bache",
        "recorded_date": "2023-12-05",
        "_score": 0.5921714305877686,
        "start_hhmmss": "00:49:32"
      },
      {
        "text": "t worldview and set of assumptions about the nature of self and reality. Would you like to say more?\nChris Bache:\nMy first concern was that it sounded like ego gone amok—ego inflation. I had to sit with that a long time, because my experiences told me that’s not what was happening. As you said, it’s a very different worldview. In the classic individual patient model, the individual is having experiences. The individual has transpersonal experiences, and the individual is always at the center. In this model, my individual existence was completely secondary. It becomes not a matter of my being central. I got the system started, but I dissolved completely into preexisting fields of consciousness. Those fields are the dynamic force having the experiences.\n\nThat manifested not only in the ocean of suffering, but later in archetypal reality and causal oneness. In many experiences, Chris Bache was a bit player. In the book I have an appendix: what dies and is reborn? After so many deaths and rebirths, it becomes a cognitive question. What is actually dying? It feels personal. Is it just ego dying over and over?",
        "ts_url": "https://youtu.be/-2NMOMvRkYE?t=1848",
        "archival_title": "Evolution of Collective Consciousness (Deep Transformation Podcast – Part 1)",
        "recorded_date": "2022-01-20",
        "_score": 0.5881694555282593,
        "start_hhmmss": "00:30:48"
      },
      {
        "text": "man:\nWhat words would you use to describe the levels you went to beyond the personal and collective?\nChris Bache:\nLooking back, I divided the journey into five broad, overlapping categories: working at the level of personal mind; working at the level of the collective mind; moving into archetypal reality beyond the collective psyche; then the level of causal reality, or the One Mind, where the entire universe moves as one; and beyond that, entering—during the last five years—what I came to call the Diamond Luminosity: an exceptionally clear, hyper-hyper-clear expression of pure light. When I looked for correlations in spiritual traditions, in Buddhism I think this is what they call Dharmakaya—the clear light of absolute reality out of which existence springs. So: personal mind, collective mind, archetypal mind, the One Mind, and Diamond Luminosity.",
        "ts_url": "https://youtu.be/FEQ8ony19sk?t=2029",
        "archival_title": "Psychedelics and Cosmological Exploration with Chris Bache – Reach Truth Podcast",
        "recorded_date": "2022-08-30",
        "_score": 0.5878788232803345,
        "start_hhmmss": "00:33:49"
      },
      {
        "text": "re pouring grace and joy and insight into the collective psyche from higher levels of consciousness.\nEntering archetypal reality, my identity as a human being began to fall away. We have a deep, visceral identity that’s deeper than our individual egoic identity, and to die as a human being is deeper than to die as an individual human being. To go into archetypal reality, I had to cease functioning cognitively in human terms and acclimate to flows of reality profoundly beyond not only my individual existence but beyond human existence. I moved outside the human field to levels of archetypal reality: a high, Platonic level—something like what Plato points to, except Plato’s archetypes are eternal forms in the mind of an unchanging God, and I experienced them as vast, living beings, overwhelmingly beyond my capacity to comprehend; I could touch pieces, but they were far too large. At a lower subtle level, I entered deep into the collective unconscious of humanity—the species mind—experiencing the human species as a single being, with networks of intelligence weaving our individual efforts, minds, and karma into larger patterns by which the species as a whole lives and breathes. I think I was being given a crash course in how our species works as a single organism to prepare for what came next.",
        "ts_url": "https://youtu.be/DBddIrMryJc?t=2716",
        "archival_title": "Chris Bache – LSD and the Mind of the Universe – SPMC 2019",
        "recorded_date": "2021-03-29",
        "_score": 0.5813931226730347,
        "start_hhmmss": "00:45:16"
      },
      {
        "text": "aker:\nYou used the term “breadth” as well as depth—like bandwidth—which I hadn’t heard put that way.\nChris Bache:\nIn certain experiences, breadth is a useful metaphor for the ways we connect with humanity, other persons, nature—states of consciousness that are extremely wide, so to speak. Depth is different: entering contact with deeper levels of reality—other systems, other beings, archetypal realities, the void, the pure cosmic void. Different categories of experience.\n\nJef Baker:\nThat might be a good point to talk about archetypes.\n\nChris Bache:\nWhen I got to the end of the journey, I looked back and asked how many fundamental platforms of consciousness I had entered. I boiled them down to five: work at the personal level; work at the collective mind—where the ocean of suffering arose and purification aimed at the collective more than the personal; then the archetypal dimension; then oneness or causal consciousness; and finally what I call the diamond luminosity—what Buddhism calls Dharmakaya, the clear light of absolute reality.",
        "ts_url": "https://youtu.be/B0BhUOEP1Mg?t=1609",
        "archival_title": "Bicycle Day Conversation with Jef Baker",
        "recorded_date": "2020-04-19",
        "_score": 0.5785509347915649,
        "start_hhmmss": "00:26:49"
      },
      {
        "text": "gs. You said these beings live through humanity, experience through humanity, love through humanity.\nChris Bache:\nI’ve had reservations about that particular line, but I kept it in because it’s in my original notes. When the ocean of suffering culminated, it exploded me into a deeper level of consciousness. The distinctive qualities were twofold: it was incredibly ancient—beyond anything I’d imagined—and more real than time and space. I eventually came to understand it as archetypal reality: a level that exists before time and space and contributes fundamental structures to them. The vision is that all reality emerges out of a primal One which starts as a void and manifests as the Big Bang. Between the One and even the Big Bang, there are many gradations—unfoldings of the Divine, though I hesitate to use that word because of its connotations. There are many layers, and lower levels are sourced in the actions of higher levels. I was encountering these—whether to call them beings or principles—vast entities others have experienced too. The best my mind could do to give them form was to see them as galaxies—images borrowed from Hubble and James Webb—though they weren’t galaxies, just that massive in scale. These beings were part of creation, creating time and space and some of the structures within it. Far down the line we have human beings. The insight was that all human existence—and, in fact, all existence—was an expression of the intentions of these deeper cosmological principles and beings. I’m not sure I got all the pieces lined up, but I do think all human experience, male and female, is an aspect of a species intelligence; that species intelligence is an aspect of a planetary intelligence, which is an aspect of a solar-system and galactic intelligence. These deeper intelligences manifest as our lives; they experience the world as we do, experiencing the adventures we are having.",
        "ts_url": "https://youtu.be/S4XSaHn54P4?t=1578",
        "archival_title": "73 Trips: Inside the Psychedelic Universe",
        "recorded_date": "2023-11-06",
        "_score": 0.5779274702072144,
        "start_hhmmss": "00:26:18"
      },
      {
        "text": "responsible for the way we contract, largely for protection and fear. Is that a fair representation?\nChris Bache\nIt is, and that description fits better in the early stages, when you’re working at insights that help you understand your individual way of being in the world. I describe my work fundamentally as cosmological exploration—where not only do you leave your individual ego behind (at least temporarily), but you leave deeper and deeper levels behind and are given the opportunity to explore how the universe constructs its reality: how archetypal reality structures time-and-space reality, how oneness manifests in the diversity of all physical life forms—down to atomic, nuclear, quantum levels—how the pure void of emptiness is that mysterious, fertile essence giving birth to time and space, moment by moment. It is useful to understand your personal ways of contracting and sustaining your smallness, but for me—trained as a philosopher—I wanted to understand the larger spectrum of reality. The invitation I was given was to explore how time and space are made. I often wished I had a PhD in physics or astrophysics—I could have understood so much more of what I was being shown. The universe can only communicate to you what you have the capacity to understand.",
        "ts_url": "https://youtu.be/-vebDk9FRYU?t=1165",
        "archival_title": "Part II of his Remarkable Twenty-Year Journey into the World of Psychedelics (Edge of Mind Podcast – Part 2)",
        "recorded_date": "2022-06-03",
        "_score": 0.5721297264099121,
        "start_hhmmss": "00:19:25"
      },
      {
        "text": "n individually while others aren’t. How can that be, that an individual awakes yet another does not?\nChris Bache:\nThe metaphor I like to use when teaching my students is that of leaves and the tree. Imagine leaves being individually conscious, yet they are manifestations of the consciousness of the tree. So we are individually conscious, and there is a narrative of individual evolution, but if you really dig deep and ask “what is an individual?” then you encounter the collective psyche—the consciousness of the planet, the galaxy, and then deeper, as you say, the absolute, what I call my belovedness. Individual awakening is a mistaken inference. It’s true that if you don’t work individually, you make no progress, but when you do, you're actually drawing many people's consciousness into your work. So it’s impossible to put a boundary on awakening; the universe doesn't even think in terms of individuals—it's interested in awakening the entire species. Not this religion, that continent, but the whole human family into evolutionary progression. I began to realize I wasn’t doing these sessions for personal work or healing, or even personal transformation.",
        "ts_url": "https://youtu.be/yewNM9smrqo?t=1425",
        "archival_title": "Diamonds from Heaven – Interview with Iain McNay",
        "recorded_date": "2018-07-05",
        "_score": 0.5713587999343872,
        "start_hhmmss": "00:23:45"
      },
      {
        "text": "er is happening has always been happening this way—it’s just that we’re beginning to be aware of it.\nRegina Meredith:\nThank you—that’s something each of us could revisit over and over to get our minds around the vastness, and I appreciate that you felt it was filled with grace. Another theme is purification through reincarnation. We’re looking at groups, epochs, periods of history involved in reincarnation—purification through reincarnation as groups of people throughout history. What does that look like?\n\nChris Bache:\nMy focus wasn’t on groups but on all of humanity. When I moved into the archetypal domain, I first encountered cosmic archetypes, then was dropped into a more Jungian level. There I experienced all of humanity repeatedly as a single organism and was given many lessons over the next year: each of our minds is like a fractal spark within a species mind; each of our bodies a cell within an integrated body of humanity. There is a continuous feedback system—flow from the whole of humanity into each of us, and the choices we make flowing back into the collective—very similar to Rupert Sheldrake’s morphic fields theory.",
        "ts_url": "https://youtu.be/S4XSaHn54P4?t=1885",
        "archival_title": "73 Trips: Inside the Psychedelic Universe",
        "recorded_date": "2023-11-06",
        "_score": 0.5669982433319092,
        "start_hhmmss": "00:31:25"
      }
    ]
  }
}