{
  "book": {
    "chunks": [
      {
        "text": "The Diamond Light that exploded from my chest in session 38 was the forerunner of what emerged in full splendor now. After going through yet one more intense cycle of death and rebirth, I was taken into a brilliantly clear, supremely luminous radiance. Buddhism calls this radiance *dharmakaya*—the Clear Light of Absolute Reality. I call it the domain of Diamond Luminosity. This Luminosity captivated me so completely that it extinguished any interest in continuing to explore the other levels of existence that had previously fascinated me. This was a different order of reality altogether. Its clarity was so overwhelming, its energy so pure that returning to it became my sole focus in future sessions.",
        "citation": "LSDMU ch.10 §0 ¶11",
        "chapter_code": "10",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5752480626106262
      },
      {
        "text": "In my experience, there are many gradations of light. As one moves deeper into transcendence, the quality of light changes. It becomes clearer, more intense, and more luminous, calling for a new vocabulary of light. Light becomes LIGHT. Clarity becomes Hyper-Clarity. When I speak in this chapter of the Diamond Luminosity or the Diamond Light, I am not using a colorful metaphor to describe the light. I am attempting to describe a particular quality of light, a singularly intense dimension of light.",
        "citation": "LSDMU ch.10 §0 ¶7",
        "chapter_code": "10",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5735665559768677
      },
      {
        "text": "I now understand why it is called Diamond Consciousness. Truly, our experience of physical light is but a metaphor for the intensity and brilliance of this energy. It had the characteristics of brilliant light, of sparkling luminosity, but also perfectly aligned density. It was extremely concentrated, like a laser, yet at the same time completely transparent. It was perfectly focused power. I suddenly knew that all my experiences in space-time over all these centuries served the cultivation of this Diamond Energy. This is what I am here for, what we are all here for, to learn how to consciously control this extraordinary power.",
        "citation": "LSDMU ch.8 §0 ¶38",
        "chapter_code": "8",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5691115856170654
      },
      {
        "text": "When the Diamond Luminosity first opened, it had carried such a powerful sense of completion and homecoming that I thought I had finally found what I was looking for. I could not imagine anything more fulfilling or complete than the Pure Light of Diamond Luminosity. And indeed, I did find my personal stopping point here. But at the very moment of reaching this pinnacle, this session showed me that there are dimensions of existence beyond even this. I saw that there are more dimensions of Light than I will ever be able to explore in this lifetime, even using this powerful method. There is simply not enough time, and I do not have enough strength to touch them all. We are truly children waking in the arms of an infinite cosmos.",
        "citation": "LSDMU ch.10 §2 ¶32",
        "chapter_code": "10",
        "section_code": "2",
        "archival_title": "",
        "_score": 0.5636196136474609
      },
      {
        "text": "At one point, I saw all humanity constantly dissolving into what looked like a tangled swamp representing the constant digesting and redigesting of human experience that is the topsoil of the reincarnation process. I then saw brilliant sparks of Diamond Light shooting from the planet into deep space. I was witnessing the birth of a brilliant Individuality from this swamp. Not an egoic individuality but something larger and brighter. In the constant churning of space-time experience, life was growing an exquisite Soul-Individuality that continues beyond any frame of reference we can presently imagine, capable of integrating larger and larger fields of experience. I was witnessing the birth of Diamond Souls. The universe is a Diamond Maker.",
        "citation": "LSDMU ch.11 §0 ¶33",
        "chapter_code": "11",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5284279584884644
      },
      {
        "text": "First, I had been drawn into deeper orders of reality, first the universe, then archetypal reality and causal Oneness, and eventually the Diamond Luminosity. These initiations were the direct consequence of the collective healing work, the karmic reward if you will. The magnitude of the energy involved in this exchange is still difficult for me to fathom. The Diamond Luminosity was initially far removed from my historical existence. There was some sort of “distance” between my embodied consciousness and this brilliant clarity. The second thing that had been happening was that this distance was being dissolved as the Light entered and transformed my incarnate being—“dissolving the shell.” Today was simply a continuation of this process, and it carried a momentum that had been building for years.",
        "citation": "LSDMU ch.11 §1 ¶7",
        "chapter_code": "11",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.5248464941978455
      },
      {
        "text": "Once one has entered the Diamond Luminosity, the hunger to return to it is overwhelming. Nothing else feels worth pursuing. The joys that previous sessions had opened to me paled by comparison. How does one describe the freedom of becoming Light, of eclipsing so radically the limitations of space and time? The poetry of Rumi and Hafiz took on new significance for me, for I had become a hopeless lover of the divine condition.",
        "citation": "LSDMU ch.10 §1 ¶1",
        "chapter_code": "10",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.5028276443481445
      },
      {
        "text": "I have used the language of Buddhism to frame the experience of Diamond Luminosity, and I will continue to do so for this last session as well. The term Buddhists use for the Pure Awareness that is one’s Essential Nature is “Nature of Mind,” what some religious traditions would call one’s Divine Nature.",
        "citation": "LSDMU ch.10 §5 ¶9",
        "chapter_code": "10",
        "section_code": "5",
        "archival_title": "",
        "_score": 0.4961327910423279
      },
      {
        "text": "In this context, I will mention that this may be one advantage of the long LSD time window compared with short-acting psychedelics like 5-MeO-DMT. LSD does not blast you through the many layers of the cosmos as quickly as 5-MeO-DMT does, but the eight-hour LSD interface invites/propels/forces a polishing of the consciousness doing the exploring as it is impacted/ instructed/healed by the consciousness being explored. An LSD session grinds slow but it grinds fine. It gives us time to be engaged and changed by the realities we are encountering. I think this polishing influences both the eventual clarity of our perception in these states and what we are able to bring back from them, both in terms of healing and understanding.",
        "citation": "LSDMU ch.1 §9 ¶4",
        "chapter_code": "1",
        "section_code": "9",
        "archival_title": "",
        "_score": 0.4895148277282715
      },
      {
        "text": "*LSD and the Mind of the Universe is primarily a* cosmological narrative, not a therapeutic narrative. In a therapeutic narrative, the personal details are important; in a cosmological narrative, they are less so. Of course, this entire journey was deeply personal and I own it as such, but my personal story is not the important story here, nor is it essential to the story I want to convey. It is when one moves beyond the shoals of the personal psyche and enters the ocean of the deep psyche that the larger and more philosophically interesting story begins to emerge.",
        "citation": "LSDMU ch.1 §8 ¶7",
        "chapter_code": "1",
        "section_code": "8",
        "archival_title": "",
        "_score": 0.4885125756263733
      },
      {
        "text": "I was different from my surrounding environment, and the difference was the Light that was shining from me. It was what I now was—a defined speck of infinitely dense, infinitely transparent Diamond Light. This is what I had entered space-time to actualize. I could feel many universes around me to explore and grow in. I felt the truth of the ancient mandalas that depict multiple universes all overseen by a cadre of divinities, each focused in a different project. These too were about expanding and refining one’s potential, about becoming more through the disciplined exercise of awareness.",
        "citation": "LSDMU ch.8 §0 ¶44",
        "chapter_code": "8",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.48345863819122314
      },
      {
        "text": "As we have seen, each breakthrough to a deeper level of reality shakes loose impurities from one’s system that must be removed if progress is to continue, and this is especially true for the Diamond Luminosity. After the 45th session, it had taken four sessions of intense purification before the doors to the Diamond Light opened again. Now the same pattern repeated itself. After the glorious 50th session, the opening line of the 51st session was, “*Today was spent entirely in the mud*.”",
        "citation": "LSDMU ch.10 §4 ¶5",
        "chapter_code": "10",
        "section_code": "4",
        "archival_title": "",
        "_score": 0.4784114956855774
      },
      {
        "text": "I recognized what was happening. The Diamond Clarity that I had previously experienced in the subtle domains of transpersonal reality had now penetrated even my physical senses. Everywhere I get hints of the larger progression. The Light has been working its way deeper into my embodied being, deconstructing my psychological conditioning, my subtle energy system, and now even my physical perception. This was Diamond Vision. It was as if I was truly seeing for the first time in my life, as if what had passed as seeing before was simply a crude approximation of the real thing. How could I have ever accepted that gauzy curtain as real seeing?",
        "citation": "LSDMU ch.11 §1 ¶36",
        "chapter_code": "11",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.4752473831176758
      },
      {
        "text": "LSD generates a powerful but temporary increase in the mind’s sensitivity. Our habitual conditioning is interrupted and our field of awareness is dramatically expanded, but after a number of hours our consciousness returns to its familiar patterns. If we don’t take steps to accurately record our experiences as soon as we return, our memory of them tends to fade. What was overwhelmingly powerful one day becomes slightly dimmer the next and dimmer still a month later. Preserving the memory of our experiences as carefully as possible completes the circle of learning and lays a stronger foundation for our next session.",
        "citation": "LSDMU ch.1 §7 ¶2",
        "chapter_code": "1",
        "section_code": "7",
        "archival_title": "",
        "_score": 0.46699151396751404
      },
      {
        "text": "After my first entry into the Diamond Luminosity, I repeatedly had the sense of “starting over again” in my sessions. The death state was not an end but a new beginning, and it would take time to adjust to this new reality. Not surprisingly, the next sessions were filled with episodes of intense purification and clearing old karmic patterns. As the work continued, a series of new insights into the psychedelic process emerged.",
        "citation": "LSDMU ch.10 §2 ¶1",
        "chapter_code": "10",
        "section_code": "2",
        "archival_title": "",
        "_score": 0.46380648016929626
      },
      {
        "text": "The second feature of causal reality that stands out for me is Light. Light may enter at the subtle level of consciousness, but it becomes more potent at the causal level. As the experience of Oneness becomes more refined at deeper causal levels, the experience of Light also becomes more refined. If the lower causal realm is the domain of the one God, the higher causal realm is for me the domain of Diamond Luminosity. Sometimes it feels that the domain of Diamond Luminosity may even lie beyond causal reality, but I won't press this point.",
        "citation": "LSDMU ch.1 §10 ¶10",
        "chapter_code": "1",
        "section_code": "10",
        "archival_title": "",
        "_score": 0.46184831857681274
      },
      {
        "text": "In earlier sessions, I had been taken beyond linear time and given an experience of my present life as a completed whole. Now eleven years later, I was taken into a deeper condition in which all my earthly lives were rewound one by one, like winding kite string around a spool, until I exploded in a burst of light, fusing all the strands into one and giving birth to what I have come to call the *Diamond Soul*. It was both me and more than I have ever been. Composed of many lifetimes, it was more than the sum of all their years. In coming together, a burst of energy was generated that fused all these centuries of experience into a single being. I was an individual but an individual beyond any frame of reference I had previously known. I was *“a defined speck of infinitely dense, infinitely transparent Diamond Light.”*",
        "citation": "LSDMU ch.8 §1 ¶36",
        "chapter_code": "8",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.45301955938339233
      },
      {
        "text": "Though I did not pay it much attention at the time, it feels perhaps significant to me now that Vajrayana practice entered my life on the same day that the Diamond Luminosity opened for the first time. I don’t think that Chöd, or Buddhism for that matter, steered my experience in this direction. I think that the trajectory that took me into the Diamond Luminosity was established in the years that led up to this breakthrough. Even so, it was a blessing when these two came together in my life. Vajrayana practice worked well with my psychedelic practice, both in opening the psychedelic window and in reinforcing the result. Vajrayana means the “Diamond Way,” and it was in the *sutras* (scriptures) and *termas* (hidden teachings) of Tibet that I found the clearest exposition of the Diamond Luminosity I had entered. I know that light is discussed in many spiritual traditions, and I’m sure I could find parallels between my experience of this light and their teachings, but it was my karma to find what I needed in Vajrayana, and I am grateful to Carol for bringing me into this lineage.",
        "citation": "LSDMU ch.10 §3 ¶14",
        "chapter_code": "10",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.44941550493240356
      }
    ]
  },
  "talks": {
    "chunks": [
      {
        "text": "Luminosity refer to actual diamonds?” Another viewer asks whether it’s related to the Diamond Sutra.\nChris Bache:\nThat’s not a silly question at all. A bit of background: “Diamond Luminosity” points to states of consciousness I entered in the last five years of my work. I had already gone through what Stan Grof calls the perinatal process and a really solid ego death. I had entered what I later called the ocean of suffering at the collective psyche level, gone into archetypal reality, causal-level reality—many adventures—and I felt philosophically satiated and complete. I was experiencing profound oneness with existence, touching the meta-cosmic void, standing under the waterfall of cosmic love. I was existentially very satisfied.",
        "ts_url": "https://youtu.be/FlHqinHyt9I?t=2404",
        "archival_title": "Diamond Luminosity (live stream)",
        "recorded_date": "2025-05-18",
        "start_hhmmss": "00:40:04",
        "_score": 0.6431790590286255
      },
      {
        "text": "minosity that you began to experience in your sessions? Is it the same thing or something different?\nChris Bache:\nI think it’s a variation of the same thing. The Diamond Luminosity I experienced is, I believe, a level of reality in the cosmos. In Buddhist terminology, I’d describe it as an extra-samsaric reality—beyond cyclic existence, beyond the Bardo. There are many layers of the Bardo—the low animal hell realms, the high deity realms—but the Diamond Luminosity is beyond all of those. There is a clear phenomenological difference between the high deity realms and then moving into the Diamond Luminosity, which is beyond all deities, archetypes, or any dimension we normally encounter.",
        "ts_url": "https://youtu.be/FEQ8ony19sk?t=4806",
        "archival_title": "Psychedelics and Cosmological Exploration with Chris Bache – Reach Truth Podcast",
        "recorded_date": "2022-08-30",
        "start_hhmmss": "01:20:06",
        "_score": 0.5638986825942993
      },
      {
        "text": "Diamond Luminosity, which is beyond all deities, archetypes, or any dimension we normally encounter.\nWhen the soul congealed in my being in the Diamond Luminosity—when the soul exploded from my chest—it had that same quality of light as the Diamond Luminosity but at a slightly lower intensity. Let me back up. We experience light many times in psychedelic journeys. It’s common: going through ego death, entering light; entering collective dimensions, experiencing dimensions of light. I had known light many times. “Diamond Luminosity” is not just a fancy metaphor. I learned there are many degrees and dimensions of light, and the Diamond Luminosity is an exceptionally pure, exceptionally clear dimension of light. I think the diamond soul, as an assay light being, is a manifestation of this quality of light inside individuated existence. So on the one hand it’s the same, and on the other it’s a variation. I wouldn’t say it’s necessarily identical, but it’s very close.",
        "ts_url": "https://youtu.be/FEQ8ony19sk?t=4871",
        "archival_title": "Psychedelics and Cosmological Exploration with Chris Bache – Reach Truth Podcast",
        "recorded_date": "2022-08-30",
        "start_hhmmss": "01:21:11",
        "_score": 0.5534358620643616
      },
      {
        "text": "d state-dependent memory. You were using the music you listened to during the session to help reach—\nChris Bache:\nYes. The day after, you’re still one foot in, one foot out—standing at the edge of the well. By playing the music while your cognitive capacities are back, you let your mind return to that territory and capture it.\n\nJeffrey Mishlove:\nA question raised by several viewers relates to the way we titled this program, using your phrase “Diamond Luminosity.” One of our viewers, Celia Funk, asks, “This may be a silly question, but does the title Diamond Luminosity refer to actual diamonds?” Another viewer asks whether it’s related to the Diamond Sutra.",
        "ts_url": "https://youtu.be/FlHqinHyt9I?t=2331",
        "archival_title": "Diamond Luminosity (live stream)",
        "recorded_date": "2025-05-18",
        "start_hhmmss": "00:38:51",
        "_score": 0.5328390598297119
      },
      {
        "text": "nd luminosity, I’m pointing to a particular quality of light: ultra, ultra clear—beyond imagination.\nOver the last five years of my work—26 sessions—I was taken into diamond luminosity four times. Between those entries, there was lots of purification and many teachings, but those four immersions are the true “diamonds from heaven,” the most important takeaway. Looking to religious literature, the closest analogue I found is Buddhism’s Dharmakaya—the clear light of absolute reality, the light out of which the Big Bang emerges. That is what I believe I experienced in diamond luminosity.\n\nNick Mather\nMuch of your cosmology feels Buddhist, though there are differences—especially around reincarnation, where the goal isn’t to enter nirvana and depart, but to continue evolving. Do you feel your journey confirms Buddhism, and where does it differ?",
        "ts_url": "https://youtu.be/Qfet06ORfwY?t=4206",
        "archival_title": "MIND-BLOWING LSD Secrets Revealed – Rebel Spirit Radio",
        "recorded_date": "2021-07-08",
        "start_hhmmss": "01:10:06",
        "_score": 0.5317223072052002
      },
      {
        "text": "ook’s inner title is Diamonds from Heaven. Are those diamonds the blessing we get from this process?\nChris Bache\nThere are many blessings—insight, transformation, deepening—but “diamonds from heaven” refers to something specific. After about 15 years, having moved through ego death, collective species death, archetypal realities, and causal-level realities, I went through another death-rebirth and was catapulted into a dimension of pure light—crystalline, ultra-clear light. I’d experienced light before, as many psychedelic voyagers do, but this was different. When I call it diamond consciousness or diamond luminosity, I’m pointing to a particular quality of light: ultra, ultra clear—beyond imagination.",
        "ts_url": "https://youtu.be/Qfet06ORfwY?t=4101",
        "archival_title": "MIND-BLOWING LSD Secrets Revealed – Rebel Spirit Radio",
        "recorded_date": "2021-07-08",
        "start_hhmmss": "01:08:21",
        "_score": 0.5177804827690125
      },
      {
        "text": "d then you were led into the diamond luminosity and its discovery. Describe that transition, please.\nChris Bache\nI have to back up a little. I went into archetypal reality—let’s skip over the details—and then through another death-and-rebirth process into what I came to call causal mind, a condition where everything is one: all the diversity of life pulsing as a single totality. It was an overwhelming, absorbing experience of fundamental oneness. My boundaries dissolved completely—not only personal boundaries. From this perspective, there were no boundaries anywhere in the universe; we are all aspects of this fundamental oneness. I experienced what the Buddhists call shunyata—emptiness, transparency. In another session I was taken into the cosmic, fertile void out of which the universe emerged, an experience of overwhelming cosmic love. That went on for a year—extraordinary blessings—and I was completely satisfied, philosophically and spiritually.",
        "ts_url": "https://youtu.be/ec0elBHJXAc?t=4979",
        "archival_title": "The Mind of the Universe: Diamonds from Heaven",
        "recorded_date": "2023-01-27",
        "start_hhmmss": "01:22:59",
        "_score": 0.51021409034729
      },
      {
        "text": "lse—what other scaffolds—do you want to put there before we explore the sense of diamond luminosity?\nChris Bache\nWhat I share doesn’t come from an intellectual basis or books I’ve read—I wish I could give you footnotes and the documentation academics love. I have to speak only out of my spiritual experiences, my psychedelic experiences. Over the course of a long journey, I was plunged into a series of initiatory visionary experiences. What I shared just now is what was given to me, shown with consistency: that humanity is entering a critical time, a critically unstable bifurcation point; that the world is entering a global crisis driven by cascading ecological crises; that these crises would hit again and again, causing profound breakdown. Many wise people see it coming and fear an extinction event—that we won’t survive what’s ahead.",
        "ts_url": "https://youtu.be/ec0elBHJXAc?t=4571",
        "archival_title": "The Mind of the Universe: Diamonds from Heaven",
        "recorded_date": "2023-01-27",
        "start_hhmmss": "01:16:11",
        "_score": 0.497862309217453
      },
      {
        "text": "; archetypal mind—the greater real of archetypal reality; causal oneness—a benediction of blessings.\nDiamond Luminosity is discussed in Chapter 10, the largest in the book—26 sessions, almost a third of the entire journey. Before I talk about Diamond Luminosity, I talk about the birth of the future human, a series of experiences that began during initiation into the universe and continued into the Diamond Luminosity work. At the end, in the last year, there was a final vision that became the capstone of the birth of the future human. It’s impossible to do more than touch on a few themes to give a sense of the trajectory—so first, let’s do that.",
        "ts_url": "https://youtu.be/70TRNG1-ZEg?t=1290",
        "archival_title": "Mapping of Transcendence",
        "recorded_date": "2019-09-26",
        "start_hhmmss": "00:21:30",
        "_score": 0.4941805303096771
      },
      {
        "text": "---\narchivaltitle: Diamonds from Heaven – Lecture at TimeWaver Summer World 2018\n\nchannel: TimeWaver TV\n\nrecorded: 2018-08-30\n\npublished: 2018-08-30\n\nyoutubeid: O4ui6I1Wo9c\n\nspeakers:\nChris Bache\n\nTranscriber: Otter.ai (diarized, speaker-attributed) + GPT-5 normalization\n\ntranscriptiondate: 2025-08-01\n\nlicense: CC0 1.0 Universal\nspeakers: [\"Chris Bache\"]\n---",
        "ts_url": "https://youtu.be/O4ui6I1Wo9c?t=3002",
        "archival_title": "Diamonds from Heaven – Lecture at TimeWaver Summer World 2018",
        "recorded_date": "2018-08-30",
        "start_hhmmss": "00:50:02",
        "_score": 0.4920637011528015
      },
      {
        "text": "ore, diamond light is of a different order entirely—ultra-clear, super-luminous, beyond imagination.\nIn the next four years and twenty-five sessions, I entered this diamond luminosity state only four times, each time separated by tremendous purification and healing. The 50th session was the deepest—an absorption into pure light, boundaries dissolved, happiness beyond description. In that state, something happened that altered my understanding of reality. My visual field pivoted, and in the distance, I perceived a reality as far beyond where I was as my current state was beyond Earth, time, and space. A ray of light from that further reality struck me and shattered me—I call it the Absolute Light. This made me realize that the journey is infinite; there is no final point, no end to God or the Divine. I learned there are depths within oneness, within the void—endless variations. I once believed you could ultimately reach an endpoint—a final destiny. But this experience showed me that the Divine is infinitely large, and the path is an endless progression.",
        "ts_url": "https://youtu.be/O4ui6I1Wo9c?t=2230",
        "archival_title": "Diamonds from Heaven – Lecture at TimeWaver Summer World 2018",
        "recorded_date": "2018-08-30",
        "start_hhmmss": "00:37:10",
        "_score": 0.4905000925064087
      },
      {
        "text": "more importance than others. How are we to worship in light of the Diamond Luminosity—pun intended?\nChris Bache: I’ll tell you how I worship. I worship the universe—the diversity of life on this planet, the manifestation of galaxies, solar systems, star systems. I worship the manifest abundance and unfolding complexity of life itself, and I honor the hidden drivers of this reality. Science tells us that about 96% is dark energy and dark matter, which we’ve never seen and don’t really understand; only about 4% is visible in any realistic form. It’s not a stretch to think the universe is unfolding out of an extraordinarily complex and infinite reality. So I honor the universe as the manifest body of this intelligence, and I honor the intelligence that is manifesting as this body at the same time.",
        "ts_url": "https://youtu.be/cvhWP8xzwiY?t=5941",
        "archival_title": "Exploring LSD and the Mind of the Universe",
        "recorded_date": "2023-01-05",
        "start_hhmmss": "01:39:01",
        "_score": 0.48961302638053894
      },
      {
        "text": "r spiritual reality.\n\nEmmy Vadnais: Very beautiful. Can you share more about the diamond Luminosity?\nJeffrey Mishlove: Light surfaces many times in psychedelic work. Every time you go through death-rebirth, people often encounter light in many forms. I had encountered it at many levels. After ego-death, after the ocean of suffering, after archetypal and causal realities—about 15 years in—I had been given so many spiritual treasures that I felt existentially satisfied. I had experienced radical Shunyata—emptiness of self—oneness of all existence. Then I went through yet another death-rebirth cycle and accessed a dimension of light so pure and clear it stunned me. It became my sole objective to return.\n\nOnce you touch what I’m calling the diamond Luminosity, it’s so far beyond anything I’d previously touched that I lost interest in archetypal or causal realities. I wanted to get back there. It is breathtakingly pure, and the associated ecstasy is staggering. Over the next five years—26 sessions, one-third of my entire journey—I accessed it only four more times. Between those sessions were deep purification, more learning, more teaching.",
        "ts_url": "https://youtu.be/FMgixG6Z0sk?t=3683",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "recorded_date": "2025-03-18",
        "start_hhmmss": "01:01:23",
        "_score": 0.487261563539505
      },
      {
        "text": "sity domain opened to me only four times, and these are the four sessions I present in this chapter.\nMy understanding is that Diamond Luminosity is an extra-Samsara reality—it lies outside the Bardo, outside of Samsara, outside all the cycles of physical reality and the Bardo realities of psychic reality. It is the pure light from which the universe arises and returns. It is Dharmakaya, the clear light of absolute reality. In between these four immersions, there were many intense episodes of cleansing and personal healing. In general, there were two movements during this four-year period: first, going deeper into Diamond Luminosity; then Diamond Luminosity began to crunch itself more deeply into my physical body. The turning point for this was Session 50. I only began to understand what was happening after the fact. I had no control over what was happening in the sessions; I went along with wherever the universe was taking me and only figured out afterward what had taken place. In Session 50, I was as deep into the universe as I ever went. I was in the clearest, most sublime state of Diamond Luminosity I had ever known. Then everything in my visual field pivoted 90 degrees, and I saw a reality far into the distance that looked like luminous galaxies. A ray of light from that reality hit me, and it absolutely shattered me. I call it the absolute light, just to give it a name. What it showed me is that the universe we explore in these deep states of consciousness is endless. I would never get to the end of the divine mind, the cosmic mind, even using this powerful method of exploration.",
        "ts_url": "https://youtu.be/hr0nxquWvgQ?t=2416",
        "archival_title": "LSD & the Mind of the Universe (SMN webinar)",
        "recorded_date": "2022-12-07",
        "start_hhmmss": "00:40:16",
        "_score": 0.48685047030448914
      },
      {
        "text": "e, and healing took place. I was also taken into a series of experiences that pushed the boundaries.\nChris Bache:\nThere was a particular session I call the birth of the diamond soul. I experienced all of my former lives coming into me very quickly. Tremendous work had been done earlier in the session, and I was in a state where I was integrating streams of consciousness from multiple lifetimes. It was like wrapping string around a kite spool—filaments of white light. They hit a critical mass and fused—these lives fused into a single energy entity. When they fused, there was an explosion of diamond light from my chest that catapulted me into a completely different state of consciousness. I was still an individual, but beyond any frame of reference I had known. I wasn’t Chris Bache; I was a being of which Chris Bache was a part, along with these other former lives. That’s what I came to call the birth of the diamond soul.",
        "ts_url": "https://youtu.be/Kh5aqAuDBIM?t=4107",
        "archival_title": "LSD and the Mind of the Universe – S2S Podcast",
        "recorded_date": "2023-01-06",
        "start_hhmmss": "01:08:27",
        "_score": 0.4866422414779663
      },
      {
        "text": "g the ineffable into life here and now. On a specific note: why the word “diamond” for those realms?\nChris Bache: Having experienced the light itself, “diamond” felt like the most natural image. Perhaps I’m influenced by Vajrayana—the Diamond Way—in the background. The image isn’t uncommon in terma texts that try to describe subtle levels of consciousness, so it came organically from the experience.\n\nOn integration, I’m glad it’s getting more attention. We can blow through levels and have extraordinary experiences with increasing predictability, but internalizing them—really digesting them so they become part of your being—is a long process. I think we overemphasize the dying of seeing and underemphasize the dying of keeping.",
        "ts_url": "https://youtu.be/Ucgt6vNpCDI?t=4870",
        "archival_title": "LSD and the Mind of the Universe: Diamonds from Heaven (SDI Meeting)",
        "recorded_date": "2024-02-10",
        "start_hhmmss": "01:21:10",
        "_score": 0.47909224033355713
      },
      {
        "text": "diamond luminosity was crunching itself deeper into my mind, personality, physiology, biochemistry.\nIn the 50th session, a particular experience in diamond luminosity radically changed my understanding of existence. I’d pushed hard, thinking the purpose was to reach a final condition—to get home, to become one with the universe or the metacosmic void. I’d had many experiences of oneness and learned there are degrees of oneness; I’d experienced the primal void and learned there are degrees of the void. At the peak of diamond luminosity, resting intact in a deeply blissful state, my visual field pivoted 90 degrees. A circle opened, and in the far distance I saw a reality far beyond diamond luminosity—a domain of light. A ray of light came from that reality and hit me; it shattered me. It took minutes to recover. That’s when I understood it’s an infinite progression. We’ll never get to the end of it. Even with this aggressive mode of exploration, I’d never reach the end. The mind of the universe is too vast. There is a homecoming, yes, but the idea of an end that changes everything—I don’t think so. Oneness is beautiful and important, but even oneness does not exhaust what the universe has to teach.",
        "ts_url": "https://youtu.be/Ucgt6vNpCDI?t=3003",
        "archival_title": "LSD and the Mind of the Universe: Diamonds from Heaven (SDI Meeting)",
        "recorded_date": "2024-02-10",
        "start_hhmmss": "00:50:03",
        "_score": 0.47407257556915283
      },
      {
        "text": "---\narchivaltitle: \"Diamonds From Heaven — The Mind of the Universe (Chris Bache)\"\n\nchannel: \"Sacred Reconnections\"\n\npublished: 2023-11-05\n\nyoutubeid: pvZDcQfGzpM\ntranscriber: gpt5 model by OpenAI\n\ntranscriptiondate: 2025-08-19\n\nlicense: CC0 1.0 Universal\nspeakers: [\"Chris Bache\", \"Colin Campbell\", \"Rachel Fleming\"]\n---\n\n---\nRachel Fleming: Diamonds from Heaven. It was LSD in the Mind of the Universe—was that the title?\n\nChris Bache: Yes, that was the publisher’s title, but my title while I was writing the book was always Diamonds from Heaven.\n\nRachel Fleming: Okay, beautiful. I’ve been a fan of your books—Colin and I talk about them regularly. Reincarnation was wonderful, then the one in the middle, and now the LSD book has been fabulous. Many people here don’t know your research methods. I’d describe you as an explorer of the outer reaches of the cosmos, in search of the truth of reality and what it means to be human. Your method is deeply interesting. Could you start by telling us what it is and what your work has been?",
        "ts_url": "https://youtu.be/pvZDcQfGzpM?t=0",
        "archival_title": "Diamonds From Heaven – The Mind of the Universe (Chris Bache)",
        "recorded_date": "2023-11-05",
        "start_hhmmss": "00:00:00",
        "_score": 0.4730002284049988
      },
      {
        "text": "olute light.” It pointed to there being not just more, but potentially an infinite number of levels.\nChris Bache:\nThat was a major turning point for me. Setting the stage: I’m 15 years into the journey. I’ve gone through the ocean of suffering, ego death, archetypal reality, many experiences of causal reality. Then I’m dropped into this infinitely satisfying, clear Diamond Luminosity—what Buddhism calls Dharmakaya, the clear light of absolute reality. The second time I’m in that reality—the 50th session—I’m as deep into the universe as I’ve ever been. I couldn’t ask for anything more. Suddenly my visual field pivoted 90 degrees, and I saw a reality far, far in the distance—again, it looked like galaxies. Out of that reality, a beam of light came and hit me, and it absolutely shattered me. It was more powerful than even the Diamond Luminosity that had been my ultimate reality. In one second, it completely changed my understanding.",
        "ts_url": "https://youtu.be/cvhWP8xzwiY?t=3691",
        "archival_title": "Exploring LSD and the Mind of the Universe",
        "recorded_date": "2023-01-05",
        "start_hhmmss": "01:01:31",
        "_score": 0.46870869398117065
      },
      {
        "text": "ly satisfied. I had no idea where the sessions would go next, but there were still five years ahead,\nChris Bache\nAfter going through yet one more intense cycle of death and rebirth, I was spun into a brilliantly clear radiance that Buddhism calls Dharmakaya. I came to call it the domain of Diamond Luminosity. I had known light many times before, but this was an exceptionally pure light. This domain captivated me so completely that it extinguished any interest I had in exploring the other levels of existence that had previously fascinated me. This was a different order of reality altogether. Its clarity was so overwhelming, its energy so pure, that returning to it became my sole focus in future sessions. Over the next four years and 26 sessions, the Diamond Luminosity domain opened to me only four times, and these are the four sessions I present in this chapter.",
        "ts_url": "https://youtu.be/hr0nxquWvgQ?t=2354",
        "archival_title": "LSD & the Mind of the Universe (SMN webinar)",
        "recorded_date": "2022-12-07",
        "start_hhmmss": "00:39:14",
        "_score": 0.4682738184928894
      }
    ]
  },
  "meta": {
    "date": "2025-10-22"
  }
}