{
  "meta": {
    "qid": "psychedelics-and-spiritual-evolution",
    "title": "The Role of Psychedelics in Spiritual Evolution (context)",
    "date": "2025-10-22",
    "version": "v1",
    "source_policy": "Book-first. Public transcripts as color with timestamped links."
  },
  "book": {
    "chunks": [
      {
        "text": "eally look forward to sharing the experiences I report in my book, LSD and the Mind of the Universe.\nDavid has framed our conversation as the question of whether we can all access the cosmic mind using psychedelics. I believe that we all can, but whether we all should is another matter entirely. In contrast to the early idea that psychedelics represent a shortcut to mystical experience, my concern is that the psychedelic journey into the cosmic mind is extremely demanding and must be approached with great care and caution.\n\nIn LSD and the Mind of the Universe, I describe experiences that opened in 73 high-dose LSD sessions conducted over 20 years when I was a young man between 30 and 50 years old, from 1979 to 1999. I then spent another 20 years thinking about these experiences, digesting them, mapping them, and pondering their implications. I hope the visions I brought back will be useful not only to other psychonauts but also to those who would never take a psychedelic themselves. What’s important is the vision of the cosmos they contain, and a vision of where humanity is in its long evolutionary journey and the turning point we’re coming to.",
        "citation": "Bache · 2022-12-07 · Scientific & Medical Network · LSD & the Mind of the Universe (SMN webinar)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD & the Mind of the Universe (SMN webinar)",
        "_score": 0.7201534509658813
      },
      {
        "text": "osophy of religion, not just for psychology, and I knew I wanted to get involved in doing this work.\nSo even though LSD had been made illegal in 1970, I chose to conscientiously break the law and begin a series of rigorously structured sessions following Stan’s protocol. After three medium-dose sessions, I chose to work at high doses. This is a protocol I don’t recommend today. I would be much gentler on myself if I were doing it over again, but at the time this is what I was doing to accelerate my own spiritual development. Quickly it evolved into engaging the deep structures of human evolution and trying to support humanity’s spiritual development, and then exploring this marvelous universe that we are part of.\n\nTami Simon\nYou write toward the beginning of the book, “In the end, what’s important is not the method of exploration used, but what this method shows us about the extraordinary universe we live in.” That’s what I want to focus on—really the discoveries that you made. Let’s start with the title: LSD and the Mind of the Universe. I’m not sure everyone can track with you there—the universe has a mind? Tell us what you discovered.",
        "citation": "Bache · 2023-07-12 · Sounds True · Diamonds from Heaven: Exploring the Mind of the Universe",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Diamonds from Heaven: Exploring the Mind of the Universe",
        "_score": 0.700873851776123
      },
      {
        "text": "ss LSD? Many will see this as a discussion on drugs, when actually it’s something far more profound.\nChris Bache\nWe all suffer from the carryover of our culture’s experience with psychedelics in the 1960s and the negative press generated around them, when the true story is very different. Psychedelics in general, and LSD in particular, function as non-specific amplifiers and catalysts of consciousness. They don’t give you a particular experience; they hyper-amplify your consciousness. If you use those hours of hyper-amplified consciousness carefully—shutting out all outside stimulus and focusing entirely within—you can use them to explore and, in a sense, excavate the deep architecture of the psyche and the nature of consciousness itself.",
        "citation": "Bache · 2020-05-13 · Ryan & Mo - Life In Rural Thailand · EP.6 - Chris Bache | LSD AND THE MIND OF THE UNIVERSE",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "EP.6 - Chris Bache | LSD AND THE MIND OF THE UNIVERSE",
        "_score": 0.6792215704917908
      },
      {
        "text": "to do extremely deep work—can approach the work that needs to be done with the help of psychedelics?\nChris Bache\nYou’re right that I wrote LSD and the Mind of the Universe hoping it would be read not only by psychedelic voyagers—so we could have a Voyager-to-Voyager conversation—but also by people not interested in taking psychedelics or who haven’t had the opportunity. What’s important is the cosmology that emerges, the visions of reality that appear in psychedelic states. These can be valuable whether or not one ever touches these experiences. I’ve had many lifelong meditators write to say they resonate and have had similar experiences—collective suffering, death and rebirth—without psychedelics. That’s what we’d expect: psychedelics amplify consciousness; consciousness does the work. Focused work with consciousness naturally overlaps what emerges in sessions.",
        "citation": "Bache · 2021-05-03 · StephenGray Vision · LSD and the Mind of the Universe – Interview with Stephen Gray",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD and the Mind of the Universe – Interview with Stephen Gray",
        "_score": 0.659844160079956
      },
      {
        "text": "ding truth. Psychedelics can push the edges of those classic cosmologies and open new possibilities.\nFor instance, deep immersion in transtemporal experience is not so deeply embedded in mystical traditions, but it's been a big part of my psychedelic experience. Let me back up: I started in 1979 interested in spirituality and enlightenment. I'd been meditating for years, hit common early blocks, and thought sessions would help me break through to enlightenment faster. It didn't turn out that way. When I really dove in, I found a different track—a cosmic exploration to explore the consciousness of the universe, to experience the fabric of reality. It's not incompatible with the enlightenment track, but cosmic inquiry dominated my sessions. So, I wouldn't use the measure of enlightenment as the only way to evaluate what happened in those sessions. They're different projects. Only in recent years did it come back around to classic enlightenment.\n\nRick Archer: Plenty of yogis and siddhas have performed cosmic exploration and written down their findings; they've just gone about it through other means. Michael, did you want to add something?\n\nMichael Pollan: No, go ahead.",
        "citation": "Bache · 2019-05-15 · Buddha at the Gas Pump® · Michael Pollan and Chris Bache – Buddha at the Gas Pump Interview",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Michael Pollan and Chris Bache – Buddha at the Gas Pump Interview",
        "_score": 0.658309280872345
      },
      {
        "text": "on, deep meditation, or psychedelic journeying. Feel free to share some of your experiences in that.\nChris Bache: Well, I’ve done that as carefully as I can in my book, LSD in the Mind of the Universe. The invitation is to appreciate that we only became conscious of the Mother Universe about 5,000 years ago—when we developed sufficient discipline to drop beneath the conditioning of our individual egoic mind and tap into the stream of consciousness we share with all life. We’ve been walking upright for 5.8 million years, operating with our larger brain for about 200,000 years. Writing came in about 5,000 years ago; the Upanishadic breakthroughs, three to four thousand years ago. But these are nothing compared to the billions of years ahead. We’re just waking up to who we are, so naturally we get confused given the enormity of what we’re growing into.",
        "citation": "Bache · 2021-03-16 · Gene Keys · Contemplating Reincarnation – Part 2",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Contemplating Reincarnation – Part 2",
        "_score": 0.6548298597335815
      },
      {
        "text": "the collective structure of consciousness and the collective import of our transformative practices.\nThen I wrote The Living Classroom in 2008. Even though my students never knew about my psychedelic experiences—I didn’t talk about them on campus for obvious legal reasons—I found that my students were being impacted by my work. There was a ripple effect: the deeper I went into the unified fabric of reality, the more ripples of transformation seemed to radiate around me. I had to study this, to understand what was happening. The Living Classroom is about collective consciousness; I don’t mention psychedelics because the issue is the nature of consciousness itself. It doesn’t matter which transformational method you use—if you go deeply enough, ramifications will spread out around you in 360 degrees.\n\nAll of this comes out of my psychedelic work. LSD and the Mind of the Universe: Diamonds from Heaven really tells the core story of this journey. Thank you for letting me describe it today.",
        "citation": "Bache · 2021-06-03 · Portland Psychedelic Society · LSD and the Mind of the Universe – Christopher Bache, Ph.D.",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD and the Mind of the Universe – Christopher Bache, Ph.D.",
        "_score": 0.6501245498657227
      },
      {
        "text": "the LSD work—but LSD and the Mind of the Universe focuses on what happened in the high-dose journey.\nThe circumstances were unusually stable, concentrated, and focused: the same sitter for years, same set and setting, intention, location (Northeast Ohio), substance, dose level, and the same recording process—always recording each session as completely as possible within 24 hours. When you stabilize your work—eliminate variables, use the same methodology consistently—it stabilizes the conversation between you and the creative intelligence of the universe. It stabilizes the communion so that one session leads to the next in a coherent, intelligent manner. You may not understand the continuity as it unfolds, but over time you see patterns and feel you’re engaging a single creative intelligence. I say that carefully—there are many layers and forms of intelligence—but across sessions the continuity is unmistakable.",
        "citation": "Bache · 2021-03-29 · Spirit Plant Medicine · Chris Bache – LSD and the Mind of the Universe – SPMC 2019",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Chris Bache – LSD and the Mind of the Universe – SPMC 2019",
        "_score": 0.6496041417121887
      },
      {
        "text": "d the species, and ultimately into the generative mind of the universe itself. That’s my experience.\nPhilosophically, we’ve been asking about this mind for years—even denying its existence in some traditions. We’ve long wanted to know our place in the cosmos, whether there is meaning in our lives, whether there is intention in evolution, why life hurts so much, why there is so much suffering. Many modern philosophers have declared these questions unanswerable and changed the subject. But we still want answers. Psychedelics give us an opportunity to systematically and rigorously engage these questions. That’s a turning point.\n\nIdeally, we might take 100 of the best-educated, most creative people—PhDs across multiple disciplines—guide them through a systematic regimen of disclosure and encounter, and then compare notes. What patterns emerge? What common ground? That’s beginning to happen and will continue for hundreds of years. It marks the difference between an old philosophy based on ordinary sensory consciousness and a new philosophy grounded in a technology of encounter.",
        "citation": "Bache · 2023-01-06 · S2S Podcast · LSD and the Mind of the Universe – S2S Podcast",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD and the Mind of the Universe – S2S Podcast",
        "_score": 0.6489056348800659
      },
      {
        "text": "incredible LSD and the Mind of the Universe: Diamonds from Heaven, which many people have read now.\nJust to add a little more about how I understand what happened in that 20-year journey—mind you, it would take all day to do it justice—the very short version is: in each one of those 73 journeys, the first two hours were, as you described in the book, sometimes exquisitely painful as you went through the difficult process of ego dissolution and beyond—letting go of any kind of identity, even as a human. And then what happened, as I recall, is that you broke out into what you have called the vast intelligences of the universe. Believe me, folks, this is no exaggeration—the kind of material that Chris brought back is absolutely stunning and absolutely relevant to what’s going on on the planet.",
        "citation": "Bache · 2024-09-24 · Spirit Plant Medicine · Philosophical Implications of Non-Ordinary States (live)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Philosophical Implications of Non-Ordinary States (live)",
        "_score": 0.6485652923583984
      },
      {
        "text": "es of insight, integration, and deep time without the use of mind-altering drugs or plant medicines.\nChris Bache\nAbsolutely. Many people have written me since the book was published saying, “I understand what you’re talking about; I’ve had similar experiences, but I’ve never done psychedelics—I’m a lifelong meditator.” I think that’s absolutely true. If LSD is an amplifier of consciousness, it’s consciousness that does the work, and there are many ways to intensify and amplify consciousness. Psychedelics are simply another key to working with consciousness, but it’s consciousness that does the work.\n\nDaniel Pinchbeck\nSince you’ve had these insights into the future—though without an exact timeframe—if I remember in Dark Night, Early Dawn you wrote it would be a very compressed period when civilization began to crack apart and the emergent properties of the new human began to integrate. How would you ground that into practical advice for people now? Are psychedelic or entheogenic explorations a way to prepare for what’s coming? Is there a way to minimize the destructive impacts? It feels like there’s a destructive express train heading our way.",
        "citation": "Bache · 2025-07-16 · Daniel Pinchbeck · Consciousness, Psychedelics & Collective Evolution",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Consciousness, Psychedelics & Collective Evolution",
        "_score": 0.6478996276855469
      },
      {
        "text": "e Mind of the Universe—which is a strange book for a professor of religious studies to have written.\nRight at the beginning of my academic career, in 1978, I had just finished graduate work at Brown in philosophy of religion, and I met the work of Stan Grof. I immediately recognized that his research in LSD and psychedelics in general was extraordinarily important—not just for clinical psychology and therapy, but for philosophy, which was what interested me most. Even though it was illegal, I began a quiet, private psychedelic practice that continued for 20 years. I worked for four years, then stopped for six years for reasons I describe in the book, then worked for another 10 years. This was from ’79 to ’99, when I was 30 to 50. I then spent the next 20 years digesting those experiences—trying to absorb them, extrapolate, and clarify the cosmological implications—and then I published LSD in the Mind of the Universe. That’s the brief sketch of what brings me here.",
        "citation": "Bache · 2023-12-05 · Numinus Network · What 73 High-Dose LSD Sessions Taught Christopher Bache",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "What 73 High-Dose LSD Sessions Taught Christopher Bache",
        "_score": 0.6470092535018921
      }
    ]
  },
  "talks": {
    "queries": [
      "psychedelics and spiritual evolution",
      "evolution of consciousness psychedelics",
      "sacred medicine practice",
      "entheogens as practice"
    ],
    "chunks": [
      {
        "text": "methods.\n\nSimeon Mihaylov\nSo you began with the motivation to explore the universe as a philosopher?\nChris Bache\nCorrect. I’m not a therapist—though I received much healing in this work and am grateful for it. My primary intention, as a philosopher of religion, was to explore the universe as deeply as I could and understand not only my nature but the larger landscape.\n\nSimeon Mihaylov\nYou’ve said your experiences fit within the larger body of religious and philosophical traditions, which gave you confidence in their genuineness, yet they also pushed boundaries and took you into areas you hadn’t encountered elsewhere. Do psychedelics, then, offer the promise of genuinely new philosophical and spiritual insights? How do you see them fitting into the future development of philosophy and spirituality for our species?\n\nChris Bache\nThis is an exciting time and territory. I became convinced early on that psychedelics represent a true before-and-after moment in philosophical reflection. Philosophy, in one way or another, reflects on the breadth of human experience—our own and others’. Here we have an opportunity to temporarily deepen and widen awareness, pushing its boundaries.",
        "ts_url": "https://youtu.be/Kh5aqAuDBIM?t=1105",
        "archival_title": "LSD and the Mind of the Universe – S2S Podcast",
        "recorded_date": "2023-01-06",
        "_score": 0.7350703477859497,
        "start_hhmmss": "00:18:25"
      },
      {
        "text": "any insights on how psychedelics or raising consciousness might help us find a better path forward?\nChris Bache:\nLet’s hold the second part and address the first, because this was one of the biggest surprises of my work. First, I had to let go of framing my work as personal journey—personal transformation, personal healing, personal awakening—and get involved in a much larger dance with the species mind and the collective unconscious, then be catapulted into archetypal reality and deeper, causal levels.\n\nWhat I'm about to say about where we are historically will sound outrageous and highly speculative, but when you work very deeply—far underneath the personal psyche, dropping into the collective psyche and into the creative intent underlying the evolution of our species—these things come into focus in ways that make sense from a quantum or post-Newtonian paradigm.",
        "ts_url": "https://youtu.be/AyMBQMGaIeA?t=2972",
        "archival_title": "What 73 High-Dose LSD Sessions Taught Christopher Bache",
        "recorded_date": "2023-12-05",
        "_score": 0.7224031686782837,
        "start_hhmmss": "00:49:32"
      },
      {
        "text": "ally think is greatly under-focused. Where do you see psychedelics playing a role in this evolution?\nChris Bache: I understand the very strong emphasis in the psychedelic community on demonstrating the therapeutic effectiveness of psychedelics. It’s really important that we not blow this opportunity. We kind of blew it in the ’60s—it blew up in our faces. We lost the right to use these things and had to go underground. It’s important that with this new opportunity we document and demonstrate their effectiveness. Right now their effectiveness is being demonstrated in their therapeutic potential. But if we keep going, it’s only a matter of time before mainstream thinkers begin to understand why psychedelics are so therapeutically effective: because they open communion with the deeper dimensions of mind. In the early stages, this encounter with the deeper dimensions of our consciousness is very cleansing, very healing—therapeutically efficacious. That can be demonstrated. But that’s just the tip of the iceberg. We go deeper, and deeper. It opens our relationship to each other, to the planet, to other life forms. It opens our relationship to spiritual reality. I was trained as a philosopher of religion, and it’s always been the philosophical import of psychedelics that has interested me. I’m not a clinician or therapist. I’m interested in the philosophical and cosmological opportunities. From that perspective, we’re coming to a critical moment in history. It’s not enough just to heal us at this moment. We have to heal not simply the personal unconscious—though that’s very important—we have to heal the soul, the fundamental human condition. That means recovering an understanding of what we are, who we are, where we are, what existence is about. Psychedelics are being rediscovered in Western industrial cultures—indigenous cultures have had them a long time—where we’ve lost contact with the deeper levels of our own psyche, with the consciousness of the Earth, with the consciousness of the creator of galaxies. Psychedelics can awaken us quickly, jar us into awareness of this deeper dimension at exactly the time we need it. We can’t get through this period of history with the limited understanding of ourselves that grew out of 19th-century science—this materialist, mechanistic, reductionistic understanding—which is an absolutely devastating worldview to try to live in. That we come into existence by accident, it’s all random, there’s no meaning to it—no meaning to our individual challenges, no meaning to history. That worldview leads to the kind of planet we’ve developed, where we try to eat it all alive and get as much experience as we can because when we die it’s all over and was an exercise in futility anyway. Psychedelics help us understand that’s not true. It’s a very different agenda.",
        "ts_url": "https://youtu.be/B0BhUOEP1Mg?t=5108",
        "archival_title": "Bicycle Day Conversation with Jef Baker",
        "recorded_date": "2020-04-19",
        "_score": 0.7218621969223022,
        "start_hhmmss": "01:25:08"
      },
      {
        "text": "es of insight, integration, and deep time without the use of mind-altering drugs or plant medicines.\nChris Bache\nAbsolutely. Many people have written me since the book was published saying, “I understand what you’re talking about; I’ve had similar experiences, but I’ve never done psychedelics—I’m a lifelong meditator.” I think that’s absolutely true. If LSD is an amplifier of consciousness, it’s consciousness that does the work, and there are many ways to intensify and amplify consciousness. Psychedelics are simply another key to working with consciousness, but it’s consciousness that does the work.\n\nDaniel Pinchbeck\nSince you’ve had these insights into the future—though without an exact timeframe—if I remember in Dark Night, Early Dawn you wrote it would be a very compressed period when civilization began to crack apart and the emergent properties of the new human began to integrate. How would you ground that into practical advice for people now? Are psychedelic or entheogenic explorations a way to prepare for what’s coming? Is there a way to minimize the destructive impacts? It feels like there’s a destructive express train heading our way.",
        "ts_url": "https://youtu.be/tzscyUU1rXI?t=1262",
        "archival_title": "Consciousness, Psychedelics & Collective Evolution",
        "recorded_date": "2025-07-16",
        "_score": 0.7191967964172363,
        "start_hhmmss": "00:21:02"
      },
      {
        "text": "ut that, but it’s an intriguing vision from a profound teacher about the potential we’re activating.\nWhat’s important is to realize we’re just children waking up in a garden that’s been developing for billions of years. We’re only beginning to wake up to what’s going on, to who we are, to what’s happening. We’re like children in a playpen, but I think we’re about to get out of the playpen. We’re about to walk. We’re about to become mature adults.\n\nSandy Sedgbeer:\nYou feel there is an urgent need to get psychedelics back on the table so their efficacy can be proven, and we can start adopting them to help people heal their wounds and, hopefully, evolve more quickly?\n\nChris Bache:\nI think so. They’re very valuable substances, and fortunately we are reclaiming them after a 40-year interruption. These are amplifiers of consciousness. Everything hinges on how we use those hours of amplification. If we use them carefully and wisely, these substances can help heal the wounds of life. Deeper still, they can help us recover insights into our true nature—our fundamental core identity with all other life forms. They open up spiritual platforms.",
        "ts_url": "https://youtu.be/2Trb-vC8zc0?t=3085",
        "archival_title": "LSD & the Mind of the Universe (What Is Going OM)",
        "recorded_date": "2023-08-17",
        "_score": 0.7183995246887207,
        "start_hhmmss": "00:51:25"
      },
      {
        "text": "ould we best use psychedelics for spiritual awakening in light of the coming challenges we may face?\nChris Bache: I hope we use them for more than spiritual awakening. The whole movement in the psychedelic renaissance toward healing is really important. When I look at human beings, I don’t simply see human beings—I tend to see souls. When I look at children, I don’t see young beings; they could be very old beings in a young body. And when I see old people, I don’t necessarily see old beings; it could be a very young soul in an old body. I look at the qualities of soul present in an incarnation.",
        "ts_url": "https://youtu.be/cvhWP8xzwiY?t=6225",
        "archival_title": "Exploring LSD and the Mind of the Universe",
        "recorded_date": "2023-01-05",
        "_score": 0.7177326083183289,
        "start_hhmmss": "01:43:45"
      },
      {
        "text": "have much more sensitivity to collective karma that I might previously have seen as personal karma.\nReid Robison:\nEarlier you mentioned the role psychedelics might be playing in this evolution of consciousness. When we were talking about that place between blades of grass and chimpanzees, what are your thoughts on Terence McKenna's stoned ape hypothesis? Was that an example of the universe between spirit and matter learning as it evolved? Do you view psychedelics as playing a role in history as well?\n\nChris Bache:\nTerence's hypothesis is interesting. I don't have an opinion on it or any new insights to add. I hold it as an interesting hypothesis without any independent way of assessing it.",
        "ts_url": "https://youtu.be/AyMBQMGaIeA?t=2550",
        "archival_title": "What 73 High-Dose LSD Sessions Taught Christopher Bache",
        "recorded_date": "2023-12-05",
        "_score": 0.7110676765441895,
        "start_hhmmss": "00:42:30"
      },
      {
        "text": "and an extraordinarily exciting time.\n\nJoe Moore:\nDo you see psychedelics aiding in this in any way?\nChris Bache:\nYeah, absolutely. The ways in which psychedelics have come back into our culture—both from Central and South American cultures that have kept traditions alive, and through the new psychedelics. LSD is often compared to the atom bomb; they were discovered at the same time. It’s an exponential opportunity to explore dimensions of consciousness that previous generations, for the most part, had to spend lifetimes meditating just to access. Now people of even modest spiritual capacities can have temporary experiences of these realities, which require a profound redrafting of our existential assumptions about how life works.",
        "ts_url": "https://youtu.be/CbgJkCoee3w?t=4471",
        "archival_title": "LSD and the Mind of the Universe: Diamonds from Heaven",
        "recorded_date": "2020-01-07",
        "_score": 0.7093932628631592,
        "start_hhmmss": "01:14:31"
      },
      {
        "text": "f a journey of aliveness with infinitely deep origins and infinitely deep potential into the future.\nChris Bache\nBoy, do I want to jump on that. As we develop our potentials and make this turning point—as we mature as a species—what kind of human being are we becoming? What are the potentials we are activating? I think it’s far beyond what we see even in science fiction. I want to build up to that by pivoting more directly to psychedelics.\n\nThis is something both Duane and I share, and I suspect a high percentage of people in this room have used psychedelics responsibly as part of their personal history or spiritual practice, just as many do yoga or meditation. Psychedelics are part of the arsenal not only of spiritual healing—healing the soul—but of becoming more aware of what our lives are about and what life itself is about.",
        "ts_url": "https://youtu.be/TeifW7GZ9xI?t=3951",
        "archival_title": "Wisdom Keepers conversation with Duane Elgin",
        "recorded_date": "2023-01-30",
        "_score": 0.7055196762084961,
        "start_hhmmss": "01:05:51"
      },
      {
        "text": "But you went through them in a fraction of that time. What kind of effect does that have on someone?\nChris Bache: I want to be careful. In therapeutically or spiritually focused psychedelic sessions, you speed up what happens in life at a slower pace. In reincarnation, we grow and evolve: die, return to soul consciousness; are born, contract into egoic consciousness; die, return to soul consciousness—again and again. We choose lives that challenge, stretch, and heal us, develop new talents, deepen capacities.\n\nPsychedelic therapy accelerates that process. Long, sustained meditation retreats do too. You bite off larger pieces of personal karma. But then something else takes over. It’s not about your personal enlightenment anymore. Your ties to the human family, the family of life, the universe deepen. You begin to feel engaged in a profound life process.",
        "ts_url": "https://youtu.be/2Trb-vC8zc0?t=1444",
        "archival_title": "LSD & the Mind of the Universe (What Is Going OM)",
        "recorded_date": "2023-08-17",
        "_score": 0.7037072777748108,
        "start_hhmmss": "00:24:04"
      },
      {
        "text": "versus, for example, meditation or other spiritual practices that can lead deeper into these realms?\nChris Bache: I’d been meditating since college, in a couple traditions, and as a professor of religious studies I had a solid grounding in the world’s spiritual traditions. I taught psychology of religion, transpersonal studies, and comparative mysticism. I initially thought these sessions would help me break through obstacles in my contemplative practice. What I found was a protocol of spiritual exploration that took me deeper than I imagined possible. After a couple of years, I developed an aptitude for working in these states. I never stopped meditating—I always meditated, did yoga, and various practices. In fact, the deeper you want to go with psychedelics, the more important a daily spiritual practice becomes to anchor and absorb what you unleash. Psychedelics gave me access to states you can reach with meditation, but typically only with many lifetimes of practice. I differentiate between the path of temporary immersion—working with psychedelics, immersed for hours at a time—and the path of presence—contemplative presence—which is slower but tends to produce abiding transparency. They’re complementary approaches, but different.",
        "ts_url": "https://youtu.be/FMgixG6Z0sk?t=930",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "recorded_date": "2025-03-18",
        "_score": 0.7022804021835327,
        "start_hhmmss": "00:15:30"
      },
      {
        "text": "ing.\nIain McNay:\nSo is the transformation happening within the trip, or after you come back—or both?\nChris Bache:\nIt’s both. And I want to say this—there’s a lot of discussion about psychedelics and enlightenment: do psychedelics lead to enlightenment? Are they counterproductive or productive? These adventures were not aimed at enlightenment; I mean, they started that way. I started because I was interested in enlightenment—I thought I could do these sessions, ego would die, and I’d get to enlightenment faster. But that changed quickly. After my first ego death, instead of personal transformation, the story opened up into a story of deep collective transformation. I began to enter what I call the ocean of suffering—what the Buddhists call the hell realms—deep suffering still living within the collective psyche. This went on for two years, over many sessions and years, involving so many people that it eventually shattered my perception of what was going on. It wasn't aimed at my personal transformation but at the transformation of some aspect of humanity’s collective unconscious. After that culminated, I entered into archetypal reality. In that phase, I had to cease to be a human being. I discovered that there is a human identity deeper than your individual identity. Just as I had to die as Chris Bache to become something larger, I had to die as a human per se and go completely outside of any frame of reference of humanity to move into what I determined were different dimensions of archetypal reality. Every step deeper is a step into much more intense energy. In the beginning, it can be shattering and hard to maintain coherent awareness. But I found that if I went back again, systematically—about five times a year—over time you go through a purification and clarification process. You learn how to stay conscious at levels of reality where, at first, you could not remain conscious—you have to practice.",
        "ts_url": "https://youtu.be/yewNM9smrqo?t=817",
        "archival_title": "Diamonds from Heaven – Interview with Iain McNay",
        "recorded_date": "2018-07-05",
        "_score": 0.7005985975265503,
        "start_hhmmss": "00:13:37"
      }
    ]
  }
}