{
  "meta": {
    "qid": "journey-structure",
    "title": "The Journey Structure (Sessions 1–73)",
    "date": "2025-10-22",
    "version": "v1",
    "source_policy": "Book-first. Public transcripts as color with timestamped links."
  },
  "book": {
    "chunks": [
      {
        "text": "the LSD work—but LSD and the Mind of the Universe focuses on what happened in the high-dose journey.\nThe circumstances were unusually stable, concentrated, and focused: the same sitter for years, same set and setting, intention, location (Northeast Ohio), substance, dose level, and the same recording process—always recording each session as completely as possible within 24 hours. When you stabilize your work—eliminate variables, use the same methodology consistently—it stabilizes the conversation between you and the creative intelligence of the universe. It stabilizes the communion so that one session leads to the next in a coherent, intelligent manner. You may not understand the continuity as it unfolds, but over time you see patterns and feel you’re engaging a single creative intelligence. I say that carefully—there are many layers and forms of intelligence—but across sessions the continuity is unmistakable.",
        "citation": "Bache · 2021-03-29 · Spirit Plant Medicine · Chris Bache – LSD and the Mind of the Universe – SPMC 2019",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Chris Bache – LSD and the Mind of the Universe – SPMC 2019",
        "_score": 0.6507681608200073
      },
      {
        "text": "a journey. The publisher wanted a more marketable title, and that’s LSD in the Mind of the Universe.\nThe beginning of this book goes back over 40 years. In 1978, when I began graduate school, I encountered Stanislav Grof’s work. His book Realms of the Human Unconscious turned my life around, followed quickly by LSD Psychotherapy. He gave me the method and the confidence to explore my consciousness and, through that exploration, to come to know the deep psyche—the deep universe—better. I want to emphasize I did this work as a philosopher. I was not a therapist. I wasn’t primarily seeking healing—though healing did come—but seeking to understand our universe as deeply as I could by exploring my consciousness as deeply as I could.",
        "citation": "Bache · 2019-11-13 · Trust Psyche · LSD & the Mind of the Universe: Diamonds from Heaven",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD & the Mind of the Universe: Diamonds from Heaven",
        "_score": 0.6460164785385132
      },
      {
        "text": "ing deeper requires yet another cycle of complete surrender to enter the initiation available there.\nWorking with high doses of LSD has been compared to a nuclear bomb. The bomb and LSD were both created in the same decade. A long, sustained series of psychedelic experiences, focused therapeutically, triggers a sustained “nuclear explosion”—not only de‑structuring reality as you’ve known it, but exposing deeper levels that were always there but invisible until this explosion brought them into awareness. We’re not talking about bombs, of course; we’re talking about this beautiful universe: 100 billion galaxies, billions of stars in the Milky Way. I’ll use that as backdrop to touch on turning points in my journey and levels of reality I entered.\n\nLooking back, I identified five core levels or cycles of death and rebirth: personal mind; collective mind (species mind); archetypal mind; causal oneness (the One); and Diamond Luminosity. That’s the structure I used to tell the travelogue in the book.",
        "citation": "Bache · 2021-06-03 · Portland Psychedelic Society · LSD and the Mind of the Universe – Christopher Bache, Ph.D.",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD and the Mind of the Universe – Christopher Bache, Ph.D.",
        "_score": 0.635793924331665
      },
      {
        "text": "incredible LSD and the Mind of the Universe: Diamonds from Heaven, which many people have read now.\nJust to add a little more about how I understand what happened in that 20-year journey—mind you, it would take all day to do it justice—the very short version is: in each one of those 73 journeys, the first two hours were, as you described in the book, sometimes exquisitely painful as you went through the difficult process of ego dissolution and beyond—letting go of any kind of identity, even as a human. And then what happened, as I recall, is that you broke out into what you have called the vast intelligences of the universe. Believe me, folks, this is no exaggeration—the kind of material that Chris brought back is absolutely stunning and absolutely relevant to what’s going on on the planet.",
        "citation": "Bache · 2024-09-24 · Spirit Plant Medicine · Philosophical Implications of Non-Ordinary States (live)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Philosophical Implications of Non-Ordinary States (live)",
        "_score": 0.6326205730438232
      },
      {
        "text": "folding into deeper levels of reality. This may not be true for everyone; it simply was true for me.\nLSD is often likened to the atomic bomb, invented in the same decade. I use the nuclear explosion as an image of the combustive fire generated in a long series of sessions—this cycle of death and rebirth. As it continues, it activates and brings into conscious awareness deeper levels of the universe, just as a nuclear explosion brings into visible form atmospheric layers that were always there but hidden. It is the power of the psychedelic dynamic that brings these dimensions into our conscious awareness. We’re not talking about literal explosions, but exploration into the mind of the universe—the cosmic mind.\n\nAt the end of my journey, looking back, I identified five strata I had entered systematically over 20 years: the personal mind; the collective mind (our species); archetypal mind; causal oneness; and diamond luminosity. I’ll take you into the book chapter by chapter with a few highlights, just to invite you into the dialogue.",
        "citation": "Bache · 2022-12-07 · Scientific & Medical Network · LSD & the Mind of the Universe (SMN webinar)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD & the Mind of the Universe (SMN webinar)",
        "_score": 0.615346372127533
      },
      {
        "text": "his hypothesis and see how my sessions mapped against the solar system’s rhythms during those years.\nThe story I’m telling in LSD in the Mind of the Universe is not primarily a personal story. In one sense it is, but in another sense it’s not. Imagine a series of sessions: after the first 15 or so, insights and help for my personal life tended to come at the beginning and end of sessions, as I was leaving and returning to time-space reality—small circles. During the peak hours—large circles—I was usually operating beyond my personal reality, beyond Chris’s reality—not entirely, but largely. The story I’m telling is what unfolded in those peak hours. It’s primarily a cosmological narrative, not a therapeutic narrative. The personal details matter in a therapeutic narrative, not so much in a cosmological one.",
        "citation": "Bache · 2019-11-13 · Trust Psyche · LSD & the Mind of the Universe: Diamonds from Heaven",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD & the Mind of the Universe: Diamonds from Heaven",
        "_score": 0.6125324368476868
      },
      {
        "text": "eally look forward to sharing the experiences I report in my book, LSD and the Mind of the Universe.\nDavid has framed our conversation as the question of whether we can all access the cosmic mind using psychedelics. I believe that we all can, but whether we all should is another matter entirely. In contrast to the early idea that psychedelics represent a shortcut to mystical experience, my concern is that the psychedelic journey into the cosmic mind is extremely demanding and must be approached with great care and caution.\n\nIn LSD and the Mind of the Universe, I describe experiences that opened in 73 high-dose LSD sessions conducted over 20 years when I was a young man between 30 and 50 years old, from 1979 to 1999. I then spent another 20 years thinking about these experiences, digesting them, mapping them, and pondering their implications. I hope the visions I brought back will be useful not only to other psychonauts but also to those who would never take a psychedelic themselves. What’s important is the vision of the cosmos they contain, and a vision of where humanity is in its long evolutionary journey and the turning point we’re coming to.",
        "citation": "Bache · 2022-12-07 · Scientific & Medical Network · LSD & the Mind of the Universe (SMN webinar)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD & the Mind of the Universe (SMN webinar)",
        "_score": 0.6114825010299683
      },
      {
        "text": "osophy of religion, not just for psychology, and I knew I wanted to get involved in doing this work.\nSo even though LSD had been made illegal in 1970, I chose to conscientiously break the law and begin a series of rigorously structured sessions following Stan’s protocol. After three medium-dose sessions, I chose to work at high doses. This is a protocol I don’t recommend today. I would be much gentler on myself if I were doing it over again, but at the time this is what I was doing to accelerate my own spiritual development. Quickly it evolved into engaging the deep structures of human evolution and trying to support humanity’s spiritual development, and then exploring this marvelous universe that we are part of.\n\nTami Simon\nYou write toward the beginning of the book, “In the end, what’s important is not the method of exploration used, but what this method shows us about the extraordinary universe we live in.” That’s what I want to focus on—really the discoveries that you made. Let’s start with the title: LSD and the Mind of the Universe. I’m not sure everyone can track with you there—the universe has a mind? Tell us what you discovered.",
        "citation": "Bache · 2023-07-12 · Sounds True · Diamonds from Heaven: Exploring the Mind of the Universe",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Diamonds from Heaven: Exploring the Mind of the Universe",
        "_score": 0.6045070886611938
      },
      {
        "text": "They’re complex, interwoven, involving many levels of reality orchestrated in tidal surges of state.\nThere was a systematic instruction: one session more or less started where the previous session stopped. When you work systematically, there’s a progressive deepening. It took years to understand what the universe was showing me—where it was taking me. I had a sense of a systematic encounter with an intelligence orchestrating my experience in dialogue with me—not taking any deity or archetypal form, always dissolving into deeper layers of infinity when pressed. That, cumulatively, is the story I’m telling in LSD in the Mind of the Universe.\n\nRachel Fleming: Would you say this is an objective reality—that if someone used a similar method, they would reach the unfolding you did? Or is that not possible to say?",
        "citation": "Bache · 2023-11-05 · Sacred Reconnections · Diamonds From Heaven – The Mind of the Universe (Chris Bache)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Diamonds From Heaven – The Mind of the Universe (Chris Bache)",
        "_score": 0.6000678539276123
      },
      {
        "text": "ous psychedelic experiences—must be surrendered if a truly new and novel dimension is going to open.\nI asked myself: How many fundamental, core death-rebirth transitions did I go through? There are levels within levels, with iterations that go deeper and deeper. But I identified five core cycles. First, the death of self: the complete shattering of your time-space identity—ego death. Second, entering the collective mind, the collective psyche. Third, entering archetypal mind—the domain described by Jung and Plato, though different than either portray it. Fourth, entering causal oneness. Oneness appears much earlier in the journey, but causal oneness is distinctive: there is no outer boundary. It is the totality of existence; you cannot step outside it to get a perspective on it. Fifth, the domain of Diamond Luminosity, which occupied me for the last five years of my journey.\n\nIn the book, these stages map to chapters: crossing the boundary of birth and death; exploring collective mind—the ocean of suffering, deep time in the soul, initiation into the universe; archetypal mind—the greater real of archetypal reality; causal oneness—a benediction of blessings.",
        "citation": "Bache · 2019-09-26 · ECR – Existential Consciousness Research Inst. · Mapping of Transcendence",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Mapping of Transcendence",
        "_score": 0.5981824398040771
      },
      {
        "text": "ive us an outline—what was happening in there, after 70-something sessions of 500 micrograms of LSD?\nChris Bache:\nThat is the question, and it's hard to summarize—it's taken me about 300 pages just to tell the story. There were so many layers. Basically, my experience has been that the universe—or the mind of the universe, or the mind of the divine—is an infinite ocean of potential. When we drop our individual mind into that ocean, it catalyzes experiences out of that infinite potential. As we are changed, influenced, healed, and purified by that exchange, the seed crystal of our mind changes. When we later drop that same, now-transformed mind into the ocean, it catalyzes a deeper set of experiences.",
        "citation": "Bache · 2018-10-12 · Adventures Through the Mind · Mapping Consciousness with High-Dose LSD (ATTMind #83)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Mapping Consciousness with High-Dose LSD (ATTMind #83)",
        "_score": 0.587199330329895
      },
      {
        "text": "later. Can you take us further into your sessions to give us a taste of what that was like for you?\nChris Bache: That’s hard because of context. Some very influential books were based on a limited number of psychedelic experiences. Aldous Huxley wrote The Doors of Perception after one mescaline experience. Huston Smith wrote his reflections after taking LSD six times. Michael Pollan’s helpful book was also after a handful of experiences. The challenge with my work is how long the journey was and how many layers of consciousness opened. It’s not simply opening 73 times to the same interface. There’s a cycle of death and rebirth that reproduces itself. Death breaks you free of one level of reality—physical reality initially—and takes you into a nonphysical spiritual reality. You work there for a while, and if you work consistently, you go through another death and rebirth into another level, where you learn that level’s rules, and so on. Focusing on any one level leaves out many others. Eventually, when putting the whole together, I distinguished five broad categories my sessions fell into: personal mind—your personal unconscious and story; collective mind—the collective psyche, humanity’s species mind; archetypal mind—which for me was more Platonic than Jungian, dimensions outside time and space and outside the collective psyche; causal levels of reality—where oneness becomes the dominant reality; and beyond that, diamond luminosity—a particularly clear dimension of light I worked with in the last five years. My experiences lay out as a sequential journey from personal mind to collective mind, archetypal mind, and so forth.",
        "citation": "Bache · 2025-03-18 · New Thinking Allowed · Psychedelics and the Cosmic Mind",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "_score": 0.584730327129364
      },
      {
        "text": "LSD and the Mind of the Universe is the memoir of a psychedelic explorer. It is the story of one person’s journey into the mind of the cosmos. I’ve tried to tell this story as concisely as I can, focusing on the journey itself and keeping theoretical discussion to a minimum. I will rely on other authors to give the reader the history and science of psychedelics, their psychopharmacology, and their clinical applications. I share my psychedelic experiences here not because I think they are special or unique, for they are not, but because, all things considered, they are the most valuable gift I have to offer the psychedelic conversation.",
        "citation": "LSDMU",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "",
        "_score": 0.6738083958625793
      },
      {
        "text": "*LSD and the Mind of the Universe is primarily a* cosmological narrative, not a therapeutic narrative. In a therapeutic narrative, the personal details are important; in a cosmological narrative, they are less so. Of course, this entire journey was deeply personal and I own it as such, but my personal story is not the important story here, nor is it essential to the story I want to convey. It is when one moves beyond the shoals of the personal psyche and enters the ocean of the deep psyche that the larger and more philosophically interesting story begins to emerge.",
        "citation": "LSDMU ch.1 §8 ¶7",
        "chapter_code": "1",
        "section_code": "8",
        "archival_title": "",
        "_score": 0.6657232642173767
      },
      {
        "text": "And last, this book has two titles, what Tibetans would call an outer title and an inner title. LSD and the Mind of the Universe is its outer title, describing what the book is about—exploring the mind of the universe through carefully conducted LSD sessions. Diamonds from Heaven is its inner title, describing its innermost essence, for at the center of the mind of the universe, one enters the infinite clear light of Diamond Luminosity.",
        "citation": "LSDMU",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "",
        "_score": 0.5734927654266357
      },
      {
        "text": "The story I am telling in this book, therefore, is a story of entering progressively deeper states of consciousness and through these states experiencing progressively deeper levels of reality. Because the universe is holographically integrated, experiences of great depth may open at any point along the way, so I don’t want to make a gospel of linear progression. Many variables influence what emerges in a person’s sessions on any given day. That said, it was my experience that by standardizing as many of these variables as possible, the universe by and large revealed itself in stages. Each of these stages had its distinctive characteristics and dynamics. I think of them as different *platforms of experience*. On my journey, I was systematically moved from one platform of experience to another over many years.",
        "citation": "LSDMU ch.1 §10 ¶1",
        "chapter_code": "1",
        "section_code": "10",
        "archival_title": "",
        "_score": 0.5534631609916687
      },
      {
        "text": "Psychedelic sessions are so multidimensional and multi-thematic that isolating a narrative in them can be challenging. Themes from personal and transpersonal levels of reality braid themselves together in a complex fashion. Scenarios repeat themselves across many sessions, their plot thickening as more layers are added. In the chapters that follow, I don’t want to oversimplify this complexity by making the sessions appear simpler than they actually were. At the same time, I need to consolidate what took place in order to present them in a reasonably efficient manner. I’ve had to make decisions about what is important to share from them and what can be left out. In order to convey the most important elements of this journey, I’ve done some judicious pruning.",
        "citation": "LSDMU ch.1 §8 ¶1",
        "chapter_code": "1",
        "section_code": "8",
        "archival_title": "",
        "_score": 0.5326799154281616
      },
      {
        "text": "As I have been working on LSD and the Mind of the Universe, my absorption of my psychedelic experiences has deepened in unexpected ways. They are beginning to live in me differently than before and I in them. It feels like my session memories have come together to form a greater living whole and that the inside and outside of my life are moving toward a new synthesis. There is a saying from the Navajo: “When you put a thing in order, and give it aname, and you are all in accord, it becomes.” By telling my story, by giving it aname and owning my experience, something new has been set in motion. A new peace has settled over me. At first this peace eased my existential loneliness and made the loss of communion more bearable, but then it deepened further. As I was finishing the book and beginning to speak about it publicly, a new spiritual transparency began to open in my life. It sometimes feels as though the Beloved is not waiting for me to die but is coming for me here. Where this will lead, I don’t know. It is still unfolding, taking me to new places, but surely this is the work of integration—to own, internalize, and manifest your experiences as deeply as you can. To let them flow through you and shape your presence on this Earth.",
        "citation": "LSDMU ch.12 §3 ¶5",
        "chapter_code": "12",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.5312299728393555
      },
      {
        "text": "When the shell of the private mind dissolves in psychedelic practice, experience opens to a landscape so vast it’s hard to find the right words to describe it—the Mind of the Universe, the Cosmic Mind, the Great Expanse. One falls into it, explodes into it, melts into it, sometimes cataclysmically, sometimes so gently it feels like the most natural thing in the world. We are not in control of these expeditions. We show up, do the work, and make our requests, but in this collaboration a larger intelligence sets the course. What we experience seems to be a combination of what the universe wants us to know and what we are capable of knowing. If we drop into this ocean too quickly, we will lose our bearings and won't be able to bring back much of value. But if we use these hours conscientiously, this intelligence will take us in and teach us. Here all instruction is by initiation. We learn by becoming. The lessons are repeated again and again until our grasp of the material is secure, then new layers are added until the fuller picture emerges.",
        "citation": "LSDMU ch.9 §0 ¶3",
        "chapter_code": "9",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.527588963508606
      },
      {
        "text": "As I begin the story of this journey, what is foremost in my mind is how many levels of consciousness I will be asking the reader to enter with me in the chapters ahead. In this respect, the story that follows is very different from some early influential accounts of psychedelic experience. Aldous Huxley wrote his beautiful book *The Doors of Perception* after only one mescaline trip, and he took psychedelics only ten times during his life. Similarly, when the great historian of religion Huston Smith published his collected reflections on psychedelics, *Cleansing the Doors of Perception*, he had taken LSD only a half dozen times. After that, he said, “The utility seemed to go down quickly and the bummers increased,” leading him to adopt Alan Watts’s advice: “When you get the message, hang up the phone.” This book is about what happens if you don’t hang up the phone.",
        "citation": "LSDMU ch.2 §0 ¶3",
        "chapter_code": "2",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5268547534942627
      },
      {
        "text": "LSD unleashes such dramatically different states of awareness from anything we experience in our everyday life that we have to learn how to work with it. Like an athlete undertaking a strenuous sport, we have to train for the event. Not only do our minds have to adjust to the expanded capacities LSD awakens, so do our bodies. Our subtle energy system has to be conditioned and strengthened to sustain the enormous flows of energy evoked by the LSD state. As I look back on these early sessions, they seem to have functioned as an intensive training camp, preparing me physically and psychologically for the long journey that was beginning. They also broke me down existentially, taking me into my first death and rebirth.",
        "citation": "LSDMU ch.2 §0 ¶5",
        "chapter_code": "2",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5205837488174438
      },
      {
        "text": "The heart of this book comes from my psychedelic journal, approximately four hundred pages of session accounts. Witha sincere bow to Carl Jung, this journal is my “Red Book” without the pictures. It is the record of my deepest experience of the universe, the primary text that for me comes before all subsequent interpretation and reflection. Once I have written up a session, I do not change or edit it. I have learned that attempting to make improvements in the account may distort something contained in the original raw language, so I leave it alone. Whenever I quote from this journal in the chapters that follow, a unique font will be used. I will also number the sessions. Numbering them simply makes it easier to track the stages of the journey as it unfolds.",
        "citation": "LSDMU ch.1 §7 ¶17",
        "chapter_code": "1",
        "section_code": "7",
        "archival_title": "",
        "_score": 0.5188770294189453
      },
      {
        "text": "One of the great challenges of entering intense psychedelic states of consciousness is learning how to learn from experiences that are breaking all the rules as they redefine the possible. In these states, our deepest instincts are often overturned and reversed. One learns to yield to, even welcome the offensive rather than pull back from it. Painful experiences can become something you seek out rather than avoid. The utterly bizarre can become the familiar so many times that you cannot anticipate what shape the next twist of learning will take. You may find yourself stuck in some endless repetitive maze where it is not clear what is happening, what you are doing to perpetuate this stalemate, or what you might do (or stop doing) to shift the situation. It may not even be clear whether this is a situation you can influence or whether it is something you simply must endure, as the following excerpt illustrates.",
        "citation": "LSDMU ch.7 §8 ¶1",
        "chapter_code": "7",
        "section_code": "8",
        "archival_title": "",
        "_score": 0.5140453577041626
      },
      {
        "text": "In this context, I will mention that this may be one advantage of the long LSD time window compared with short-acting psychedelics like 5-MeO-DMT. LSD does not blast you through the many layers of the cosmos as quickly as 5-MeO-DMT does, but the eight-hour LSD interface invites/propels/forces a polishing of the consciousness doing the exploring as it is impacted/ instructed/healed by the consciousness being explored. An LSD session grinds slow but it grinds fine. It gives us time to be engaged and changed by the realities we are encountering. I think this polishing influences both the eventual clarity of our perception in these states and what we are able to bring back from them, both in terms of healing and understanding.",
        "citation": "LSDMU ch.1 §9 ¶4",
        "chapter_code": "1",
        "section_code": "9",
        "archival_title": "",
        "_score": 0.5114625692367554
      }
    ]
  },
  "talks": {
    "queries": [
      "journey structure",
      "sessions 1-73",
      "protocol",
      "dosage",
      "method",
      "map",
      "LSD sessions structure",
      "overview of LSDMU journey"
    ],
    "chunks": [
      {
        "text": "ugh your journeys, and how might that relate to the lack of one ultimate level and meta-coexistence?\nChris Bache: That’s a big question. I was a religious studies professor. My first vocation was wanting to be a Catholic priest. I was raised Roman Catholic and spent four years in the seminary. The Catholic tradition treated me well; no trauma. Then I did an undergraduate degree in theology at Notre Dame, a master’s in New Testament criticism at Cambridge, and philosophy of religion at Brown. By the time I finished graduate school, I had pretty much studied my way out of religion altogether. I recapitulated the transition from medieval Catholic theology to the scriptural revolution in Protestantism, to the scientific critique of religion in the modern mind. I finished a fairly sophisticated agnostic with very high standards for any conceptualization of something beyond time and space—something approximating God.",
        "ts_url": "https://youtu.be/cvhWP8xzwiY?t=5063",
        "archival_title": "Exploring LSD and the Mind of the Universe",
        "recorded_date": "2023-01-05",
        "_score": 0.5857090353965759,
        "start_hhmmss": "01:24:23"
      },
      {
        "text": "John Dupuy:\nDid you feel you were being held or guided—in some sense taken care of—in this journey?\nChris Bache:\nAt every step along the way. When I would go through, consciousness was waiting for me. I might not understand the logic of the sequence for years—there are things I only began to understand when I wrote the book—but I had enough structure to know there was a logic to the process. I always felt met and engaged—sometimes very consciously, where I would ask questions and it would orchestrate my experience. There was an intelligence meeting me, taking me, educating me, breaking me down, reducing me to dust, taking me further, taking me back, over and over until I understood something—and then it would take me deeper.",
        "ts_url": "https://youtu.be/-2NMOMvRkYE?t=1309",
        "archival_title": "Evolution of Collective Consciousness (Deep Transformation Podcast – Part 1)",
        "recorded_date": "2022-01-20",
        "_score": 0.5821077823638916,
        "start_hhmmss": "00:21:49"
      },
      {
        "text": "st one goes something like, “Thus ends the journey that never needed to be made in the first place.”\nChris Bache\nYes. I started this work focused on enlightenment, which is what the Ten Oxherding Pictures are about—awakening to the ever-present condition so that, in the end, you come back to where you were, but with your filters clear and the present luminously there. That was my initial agenda.\n\nBut it was superseded by two other aspects. First, the challenges of our collective enlightenment—our collective evolution. Eventually my personal healing or enlightenment was superseded by responding to the call to support our collective transformation in history. Second, that was superseded by the opportunity to explore the deep structure of the universe itself—a cosmological exploration. You don’t need to explore the universe’s deep structure to awaken to your essential nature. These are different projects. My work combined the enlightenment project but yielded to a different one—the philosopher’s project: an invitation to explore, as far as I could, the nature of cosmic reality.",
        "ts_url": "https://youtu.be/zXt-LkmINyc?t=1431",
        "archival_title": "LSD and the Mind of the Universe – Interview with Stephen Gray",
        "recorded_date": "2021-05-03",
        "_score": 0.5576844215393066,
        "start_hhmmss": "00:23:51"
      },
      {
        "text": "to historically specific expressions.\n\nStephen Gray:\nWas there a visual component to these journeys?\nChris Bache:\nVery strong visual components—not hallucinatory. I could lift my eye shades mid-journey and not be hallucinating. The visuals were very deep, but I never saw the intelligence I was experiencing so intimately. It would purify me—beat me up, crush me, destroy me—and then, after purification, receive me, educate me, take me through things until it was sure I understood, then take me deeper. But it never adopted an identifiable form.\n\nMarc Caron:\nA brief follow-up: how does your work map onto Pierre Teilhard de Chardin’s vision of the noosphere and this epochal birth?",
        "ts_url": "https://youtu.be/9jsKPUwwqfQ?t=3364",
        "archival_title": "Philosophical Implications of Non-Ordinary States (live)",
        "recorded_date": "2024-09-24",
        "_score": 0.5546943545341492,
        "start_hhmmss": "00:56:04"
      },
      {
        "text": "e saying corresponds, deepens, and fills out what I’ve learned in my own journey. So how’s it going?\nChris Bache:\nIt’s going just as you say. There’s nothing unique about my experiences—they’re part of our collective experiences that push the boundaries in certain ways. Many people have written to say I clarified their experiences—“Here’s what I experienced around this topic.” Many have written, “I’ve never touched psychedelics in my life, but I’ve had experiences completely in alignment with yours. Let me explain mine.” Clearly this is a large pattern emerging within the collective psyche. It’s a joy to share and to enter into conversation with other journeyers.",
        "ts_url": "https://youtu.be/-2NMOMvRkYE?t=5700",
        "archival_title": "Evolution of Collective Consciousness (Deep Transformation Podcast – Part 1)",
        "recorded_date": "2022-01-20",
        "_score": 0.5541290044784546,
        "start_hhmmss": "01:35:00"
      },
      {
        "text": "art, but to continue evolving. Do you feel your journey confirms Buddhism, and where does it differ?\nChris Bache\nI’ve been deeply influenced by all the world’s religions. I began as a Christian and a Catholic—four years in seminary studying for the priesthood. I studied Hebrew and Greek for biblical work. I’ve learned so much from Hinduism, Buddhism, Taoism, and Native traditions. The two deepest, longest-lasting influences on me have been Christianity and Buddhism.\n\nI think my journey affirms the deepest truths of Christianity and of all the world’s religions—Judaism’s Kabbalah, Hinduism, Buddhism—while also, in important ways, eclipsing the religions of the last several thousand years. The universe I was initiated into demanded levels of understanding beyond anything I had learned in those traditions. I had to become operational within a deeper metaphysics.",
        "ts_url": "https://youtu.be/Qfet06ORfwY?t=4310",
        "archival_title": "MIND-BLOWING LSD Secrets Revealed – Rebel Spirit Radio",
        "recorded_date": "2021-07-08",
        "_score": 0.5518485307693481,
        "start_hhmmss": "01:11:50"
      },
      {
        "text": "cosmological exploration? And how might someone structure them if they’re aimed at the other goals?\nChris Bache:\nI didn’t understand much of this at the time; I understood it only after going a long way down the road and looking back at how my choices affected the trajectory. The dose decision is significant. Working with high doses, you completely surrender to the process. It’s impossible to direct it. You can set all the good intentions you want, but the states that arise with high doses, amplified by carefully selected music and internalization in a kiva-like practice, set in motion processes so powerful you can’t control them. The strategy is to surrender—let consciousness take you wherever it wants, show you whatever it wants, no matter how inscrutable, painful, or absurd it seems at the time.",
        "ts_url": "https://youtu.be/FEQ8ony19sk?t=1178",
        "archival_title": "Psychedelics and Cosmological Exploration with Chris Bache – Reach Truth Podcast",
        "recorded_date": "2022-08-30",
        "_score": 0.5400621294975281,
        "start_hhmmss": "00:19:38"
      },
      {
        "text": "going to do X amount of sessions,” or did you go in saying, “I’ll have a few and see where it goes”?\nChris Bache\nNo trajectory or goal. I saw the range of experiences Stan described in Realms of the Human Unconscious. With my grounding in Western philosophical and theological thought, I appreciated the significance of these states. I believed that people making the most important contributions in my discipline would be speaking from an experiential basis in a matter of years, not just a theoretical one. To do that, you have to get in and do the work. I had no idea how long it would be. Early on, I thought you go through ego death and then get unrestricted access to deep consciousness. What I found is the universe has many layers. While it’s all holographically integrated, if you engage systematically with a careful methodology, the universe takes you in by degrees, by layers. As you move into a new layer of consciousness and stabilize there, if you keep pushing, you go to the edge of that layer and through another death-and-rebirth process—different than ego death but building on it. You go through a series of death-and-rebirth processes as you explore progressively deeper levels. That’s how it happened for me. There was a systematic progression into communion with the universe. That’s how I laid out the book: beginning to end, consolidating the story, each chapter moving into another level of consciousness or engagement.",
        "ts_url": "https://youtu.be/CbgJkCoee3w?t=1035",
        "archival_title": "LSD and the Mind of the Universe: Diamonds from Heaven",
        "recorded_date": "2020-01-07",
        "_score": 0.539993166923523,
        "start_hhmmss": "00:17:15"
      },
      {
        "text": "ience at the right time. In your journeys you describe a sense of guidance. Could you speak to that?\nChris Bache:\nI always felt myself engaging—and being engaged by—a larger consciousness. It didn’t take concrete, personified form. Its core qualities changed as I went deeper. The way I think of it: the consciousness we enter into in psychedelic states is an infinite consciousness capable of generating any number of experiences. Our mind acts as a seed crystal that catalyzes certain experiences from this infinite field.\n\nIf you do this repeatedly, as you integrate experiences and undergo purifications, your consciousness changes. The consciousness you take into the next encounter catalyzes a deeper set of experiences from the infinite potential. What you experience as a guiding intelligence arises at the intersection of your individual mind and the universal mind; as you change, that intersection changes. The guiding consciousness felt constant to me but remained formless, seldom adopting concrete form—because forms would change as the experiences deepened.",
        "ts_url": "https://youtu.be/cvhWP8xzwiY?t=867",
        "archival_title": "Exploring LSD and the Mind of the Universe",
        "recorded_date": "2023-01-05",
        "_score": 0.5348140597343445,
        "start_hhmmss": "00:14:27"
      },
      {
        "text": "you unpick a bit of the structure you see as useful for helping us move toward being future humans?\nChris Bache\nThere are several things rolled into your observations—all good. First, I think integration is very important. We have the chemical technology to trigger very deep states of consciousness, but these states may have very little lasting impact on our deeply ingrained psychological and cultural habits if we don't take time to sit with them and integrate them as deeply as we can into our embodied existence.\n\nOver the course of my work, even though I was paying a lot of attention and doing as good a job as I could to integrate each individual session, I still underestimated the long-term challenges of integrating an entire spiritual journey. I didn't fully comprehend this until I had stopped my journey and realized how hard the stopping hit me, exposing the imbalance—the failure to integrate the most extreme, radical experiences, which were the deepest: being drawn into intimacy, into communion with—I want to say the divine, but I'm cautious because we have to unpack theological baggage.",
        "ts_url": "https://youtu.be/q-caGhIlKS8?t=689",
        "archival_title": "The Phoenix Always Rises: Evolving into the Future Human",
        "recorded_date": "2025-01-08",
        "_score": 0.529525876045227,
        "start_hhmmss": "00:11:29"
      },
      {
        "text": "nced this profoundly in your psychedelic journeys—the constant states of transformation and rebirth.\nChris Bache\nYes. When I started, I thought there was just one death—ego death—that would launch you into the spiritual universe. But the spiritual universe has many layers. Being operational at one layer doesn’t mean you’re operational at deeper layers. You go through another metamorphosis—another death and surrender—to be reborn into another layer, and so on. That reflects the Tibetan idea of Bardo: a discrete layer of consciousness. In describing the after-death journey, there are multiple Bardos you pass through—the hungry ghosts, heavenly spirits, and so on. In the West, we often use Bardo to represent the totality of what happens after death, and that’s fine, but the original use points to stages in a progression.",
        "ts_url": "https://youtu.be/AQwAxhukBrE?t=481",
        "archival_title": "Contemplating Reincarnation – Part 2",
        "recorded_date": "2021-03-16",
        "_score": 0.5289703011512756,
        "start_hhmmss": "00:08:01"
      },
      {
        "text": "aker:\nYou used the term “breadth” as well as depth—like bandwidth—which I hadn’t heard put that way.\nChris Bache:\nIn certain experiences, breadth is a useful metaphor for the ways we connect with humanity, other persons, nature—states of consciousness that are extremely wide, so to speak. Depth is different: entering contact with deeper levels of reality—other systems, other beings, archetypal realities, the void, the pure cosmic void. Different categories of experience.\n\nJef Baker:\nThat might be a good point to talk about archetypes.\n\nChris Bache:\nWhen I got to the end of the journey, I looked back and asked how many fundamental platforms of consciousness I had entered. I boiled them down to five: work at the personal level; work at the collective mind—where the ocean of suffering arose and purification aimed at the collective more than the personal; then the archetypal dimension; then oneness or causal consciousness; and finally what I call the diamond luminosity—what Buddhism calls Dharmakaya, the clear light of absolute reality.",
        "ts_url": "https://youtu.be/B0BhUOEP1Mg?t=1609",
        "archival_title": "Bicycle Day Conversation with Jef Baker",
        "recorded_date": "2020-04-19",
        "_score": 0.5279010534286499,
        "start_hhmmss": "00:26:49"
      }
    ]
  }
}