{
  "meta": {
    "qid": "great-death-and-rebirth",
    "title": "The Great Death and Rebirth of the Cosmos (synthesis)",
    "date": "2025-10-22",
    "version": "v1",
    "source_policy": "Book-first. Public transcripts as color with timestamped links."
  },
  "book": {
    "chunks": []
  },
  "talks": {
    "queries": [
      "death and rebirth of cosmos",
      "cosmological rebirth",
      "apocalypse as unveiling",
      "kali yuga into new age"
    ],
    "chunks": [
      {
        "text": "---\narchivaltitle: Prof Chris Bache - Cycles of Death & Rebirth\n\nchannel: \"Scientific & Medical Network\"\n\nrecorded: 2023-04-18\n\npublished: 2023-04-18\n\nyoutubeid: bQw4ypKrJb8\ntranscriber: gpt5 model by OpenAI\n\ntranscriptiondate: 2025-08-19\n\nlicense: CC0 1.0 Universal\nspeakers: [\"Chris Bache\"]\n---\n\n---\nChris Bache: When one works with very high doses of LSD, one goes through a series of Death-Rebirth experiences. In this image, the drop at the center underneath the line represents our egoic, private consciousness. Everything above the line represents spiritual reality. In transpersonal consciousness, the first Death-Rebirth experience takes place at the interface of our time-space consciousness and the beginnings of spiritual consciousness, and it's usually referred to as ego death. It is the complete destruction of our personal time-space identity and the beginning of an opening into spiritual reality.",
        "ts_url": "https://youtu.be/bQw4ypKrJb8?t=4",
        "archival_title": "Prof Chris Bache – Cycles of Death & Rebirth",
        "recorded_date": "2023-04-18",
        "_score": 0.7076575756072998,
        "start_hhmmss": "00:00:04"
      },
      {
        "text": "rough cycles of death and rebirth, their significance, and how they facilitate collective awakening.\nChris Bache:\nFirst, what I’m going to describe is my variation on an ancient Buddhist teaching. When one sits to meditate or do spiritual practice, the first step is cultivating bodhicitta—the wish to save all sentient beings. You do the practice not for personal benefit but to nourish the uplift of the whole of creation. The last step is distributing the merit—you give away the blessings you’ve acquired. In mature spiritual practice, everything is for the benefit of the whole.",
        "ts_url": "https://youtu.be/ec0elBHJXAc?t=3309",
        "archival_title": "The Mind of the Universe: Diamonds from Heaven",
        "recorded_date": "2023-01-27",
        "_score": 0.7041682004928589,
        "start_hhmmss": "00:55:09"
      },
      {
        "text": "and rebirth. How has that process impacted you? What was that like for you during these experiences?\nChris Bache: Violence may not be quite the right word. It shows up in the early stages when you're going through powerful kriyas and this tremendous physical and emotional detoxification, which can leave you in convulsions, bouncing around the mattress, as your body throws off vast quantities of physical and emotional stress. There is a certain violence in dying. Over the course of the work, I learned that the deepest breakthroughs followed the deepest purifications, and the deepest deaths yielded the deepest ecstatic joys on the other side. As that became clear, death became my closest ally. Rather than trying to avoid harsh confrontations, I did everything I could to facilitate their emergence. I went right at it—not because I like suffering, but because I like what was on the other side. I came to understand that even death in a psychedelic context is a form of purification: letting go of reality as you know it at one level to gain access to reality at a deeper level. So it became part of the work.",
        "ts_url": "https://www.inbodiedlife.com/blog/chris-bache",
        "archival_title": "Learning to be Gods: Conversations about LSD and the Mind of the Universe with Chris Bache",
        "recorded_date": "2023-06-30",
        "_score": 0.6919712424278259,
        "start_hhmmss": "00:19:54"
      },
      {
        "text": "Chris a chance to connect the living universe with the evolution of life through that living system.\nChris Bache\nIn that context, let me say something hard and consoling at the same time. From a reincarnation perspective, we’re always popping into time-space and popping out into a spiritual meta-universe, then back in and out again. From this perspective, what is death? All the enlightenment and awakening traditions say the same thing: birth is not the beginning of our life. Look carefully and you’ll find in your body and mind evidence of experience that far predates your physical life. Death is not the end, because we now have, especially through the work of people like Michael Newton on life-between-lives and past-life therapy, abundant evidence of a continuity of consciousness that predates and postdates our individual life.",
        "ts_url": "https://youtu.be/TeifW7GZ9xI?t=3065",
        "archival_title": "Wisdom Keepers conversation with Duane Elgin",
        "recorded_date": "2023-01-30",
        "_score": 0.6843578219413757,
        "start_hhmmss": "00:51:05"
      },
      {
        "text": "e to life, not because you're trying to make your ego feel happy. Have I missed anything out on the—\nChris Bache:\nHealth world? I think it's great. And if you do your work well, one of the things that happens is you lose all fear of death. Once you transition several times into that reality, you know in your bones, from your own experience, that death is not an end of anything. It's simply the end of an incarnational cycle, and there is absolutely nothing to fear about death. Death is homecoming. All of the Hollywood bullshit thrown up at us—dark places and demons and ghosts and all this stuff—it's just nonsense. Ninety-nine percent of people die and make a transition into the light perfectly naturally and comfortably. If you're afraid of dying, you've got your entire metaphysics upside down. Death is homecoming. Death is the end of your matriculation. It's the harvesting of your life. Birth should be mourned. Birth is where the work begins. It's like being a freshman in college—it's hard. Graduation is wonderful, right?",
        "ts_url": "https://youtu.be/q-caGhIlKS8?t=4351",
        "archival_title": "The Phoenix Always Rises: Evolving into the Future Human",
        "recorded_date": "2025-01-08",
        "_score": 0.6738936305046082,
        "start_hhmmss": "01:12:31"
      },
      {
        "text": "back for that one. It’s really good to bear these things in mind as we move through intense periods.\nChris Bache: Let’s allow ourselves to look deep into the future of this future human. Whatever transformation we’re going through—and we agree it’s acute, giving birth to a new order of human capacity—however long it takes, the human story isn’t stopping. The evolutionary drama isn’t ending. This is a new platform within which the story will continue to develop. We’ve been evolving by learning from suffering, our great teacher in much of the past, but we’re getting past that—just as we’re growing out of our fear of death. If there were one thing I wish I could give people from my sessions, it would be to lose the fear of death. If you’re afraid of death, your cosmology is upside down. You don’t understand what’s going on. Death is graduation. Death is the great respite, the great reward.",
        "ts_url": "https://youtu.be/5Lus4MLlzbA?t=2863",
        "archival_title": "Contemplating Reincarnation – Part 3",
        "recorded_date": "2021-03-27",
        "_score": 0.6678948402404785,
        "start_hhmmss": "00:47:43"
      },
      {
        "text": "nced this profoundly in your psychedelic journeys—the constant states of transformation and rebirth.\nChris Bache\nYes. When I started, I thought there was just one death—ego death—that would launch you into the spiritual universe. But the spiritual universe has many layers. Being operational at one layer doesn’t mean you’re operational at deeper layers. You go through another metamorphosis—another death and surrender—to be reborn into another layer, and so on. That reflects the Tibetan idea of Bardo: a discrete layer of consciousness. In describing the after-death journey, there are multiple Bardos you pass through—the hungry ghosts, heavenly spirits, and so on. In the West, we often use Bardo to represent the totality of what happens after death, and that’s fine, but the original use points to stages in a progression.",
        "ts_url": "https://youtu.be/AQwAxhukBrE?t=481",
        "archival_title": "Contemplating Reincarnation – Part 2",
        "recorded_date": "2021-03-16",
        "_score": 0.6641451120376587,
        "start_hhmmss": "00:08:01"
      },
      {
        "text": "orced since first experiencing it in the late 1990s, to the writing of the book, to the present day?\nChris Bache: It hasn't changed one bit. I say in the book that when I had the experience in session 55—the death and rebirth of humanity in 1995—for weeks I walked around like I was walking around Hiroshima a week before the bomb went off. I have carried in my being, in my body, a knowing of where we are in history and what's coming.\n\nWhen I look around, whether I agree with people politically or socially or not, I see heroes. I see every human being here on this planet as having incarnated voluntarily, choosing to be part of this evolutionary pivot. Every person here—even though they may not remember it—has chosen to be here, and this is going to be a very difficult period to incarnate. The beings who are part of the incarnation process are extraordinarily powerful, valuable beings.",
        "ts_url": "https://youtu.be/icBasHgjzsY?t=4772",
        "archival_title": "LSD and the Mind of the Universe – Christopher Bache, Ph.D.",
        "recorded_date": "2021-06-03",
        "_score": 0.6635923385620117,
        "start_hhmmss": "01:19:32"
      },
      {
        "text": "g from that into something else. Could you give a step-by-step of what the early stages looked like?\nChris Bache:\nFor about the first two years, I worked at what Stan Grof describes as the perinatal level of consciousness—the interface between personal egoic reality in space-time and early transpersonal consciousness. I had many experiences of reliving my own birth, experiences of death and dying, until, after about two and a half years, my personal reality was shattered. I died as the person I had known myself to be and was then reborn into a reality that radically transcended Chris Bache's reality. At that point, I was working deep within the collective unconscious, and the process began again.",
        "ts_url": "https://youtu.be/L3D_fSr75u8?t=937",
        "archival_title": "Mapping Consciousness with High-Dose LSD (ATTMind #83)",
        "recorded_date": "2018-10-12",
        "_score": 0.6609907150268555,
        "start_hhmmss": "00:15:37"
      },
      {
        "text": "tures within which you are holding reality. So it’s death, but a fluid death—a purification process.\nJohn Dupuy:\nSo, Chris, following up on what Roger asked about what dies—what doesn’t die? Because in your book you talk a lot about reincarnation as a given in the universe as it was revealed to you—this universe, multiverse, whatever this mysterium tremendum is that you’ve brought back to us. So what doesn’t die?\n\nChris Bache:\nWhen we go deep, we realize that everything is dying and living, dying and living, constantly. There are no stable things which are not dying in this universe. To see that clearly is considered a great accomplishment—to really understand that everything is temporary, transitional, moving, fluid. People have asked me, “What is it that dies?” What I will say is there is always continuity of memory. If you organize your session well, there is continuity of recall; therefore there is continuity of memory. You might say that memory doesn’t die, but I don’t think that’s the best way to describe it. I think memory is shattered and reconstituted. I don’t know what doesn’t die, but—\n\nJohn Dupuy:\n—is being purified, right? What is it that’s being purified?",
        "ts_url": "https://youtu.be/-2NMOMvRkYE?t=2767",
        "archival_title": "Evolution of Collective Consciousness (Deep Transformation Podcast – Part 1)",
        "recorded_date": "2022-01-20",
        "_score": 0.6600664258003235,
        "start_hhmmss": "00:46:07"
      },
      {
        "text": "e case: a painful birth to transition into a more functional, balanced species. Could you elaborate?\nChris Bache: I explore this in a chapter called “The Birth of the Future Human,” and earlier in “The Great Awakening” in Dark Night, Early Dawn (2000). I was uncomfortable entering this territory at first—I’m not drawn to historical speculation. I began this work for individual healing and enlightenment, and that premise was blown away within a few years. The purification, the access to information and knowledge—everything seemed to be in service of the species as a whole. It’s not that our species is special in the universe, but the Divine’s focus here, now, seems species-wide.\n\nThis emphasis repeated so often and strongly that the gist of my 20-year journey became the collective story of death and rebirth. I have deep convictions that we’ve entered the dark night of our collective soul—a period of purification, confronting the sins of our fathers and mothers, which are our own through reincarnation. We’re facing our past choices and their consequences, purifying the toxins they left, to open into new dimensions of our being.",
        "ts_url": "https://youtu.be/B0BhUOEP1Mg?t=3521",
        "archival_title": "Bicycle Day Conversation with Jef Baker",
        "recorded_date": "2020-04-19",
        "_score": 0.6594325304031372,
        "start_hhmmss": "00:58:41"
      },
      {
        "text": "h the previous experience. If you re-listened, it would tend to pull you back toward that territory?\nChris Bache\nIt would tend to, or at least there was the potential for it to pull you in that direction. Maybe not the second time, but with repeated listening it can narrow your experience instead of expanding and opening it.\n\nRyan Kemp\nAs you touched on, what you came to learn was a series of iterated deaths and rebirths in one body, which appears in Stan Grof’s work as well. Could you talk about how you view that—and its relationship to actual death and rebirth as we know it, the leaving of this form and coming back into a new form?\n\nChris Bache\nIt took me a long time to understand the patterns of my sessions. In some ways they started as I expected, drawing upon Stan’s map of consciousness, but after a few years they seemed to diverge and enter new territory. One thing I’ve come to understand is that consciousness has many levels—operational tiers. Each time you enter a new level, there is required a surrender of everything you had known and assumed before, in order to enter a level that operates by completely different rules.",
        "ts_url": "https://youtu.be/Dw7D7ih8vy0?t=1056",
        "archival_title": "EP.6 - Chris Bache | LSD AND THE MIND OF THE UNIVERSE",
        "recorded_date": "2020-05-13",
        "_score": 0.6582409143447876,
        "start_hhmmss": "00:17:36"
      }
    ]
  }
}