{
  "book": {
    "chunks": [
      {
        "text": "This insight invites us to think about the dynamics of death and rebirth more multidimensionally. It is an insight that generalizes across multiple levels of reality. At the subtle level of consciousness, for example, death and rebirth may open a portal that serves not only to drain destructive energies out of the species-mind but also to infuse healing energies into the species-mind from a higher source, as the sessions reported in chapter 8 demonstrate. At still deeper levels, such portals may allow any number of transcendental blessings to be infused directly into lower orders of existence. The question then becomes: How does the addition of this principle of *infusion from above* influence the question of how we might understand what is dying and being reborn at these deep levels of psychedelic experience?",
        "citation": "LSDMU Appendix I §1 ¶20",
        "chapter_code": "",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.6240571737289429
      },
      {
        "text": "My psychedelic journey generated a repeating cycle of death and rebirth that systematically initiated me into progressively deeper levels of consciousness. This generates a thought-provoking question: What exactly is dying and being reborn in this spiral of initiation? There is often an acute sensation of dying at the deeper levels, but what does this sensation attach to? Is it simply ego dying over and over again, or is there something more going on? I want to briefly propose four overlapping answers to this question.",
        "citation": "LSDMU Appendix I §1 ¶1",
        "chapter_code": "",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.6237979531288147
      },
      {
        "text": "Confronting our personal shadow is always challenging work, but to understand the deeper suffering that emerges on this journey, we must understand the role that death and rebirth play in an extended psychedelic practice. The experience of dying and being reborn is one of the central dynamics of therapeutically focused psychedelic work. Death is simply the price one is asked to pay to gain access to the myriad worlds that lie beyond the body-mind ego, death not as a metaphor or symbolic enactment but the agonizing loss of everything we know to be real and true, the spasm of our last breath, the terrifying surrender. Death comes in many shapes and sizes. It may steal in softly, melting our resistance slowly, or break through the door violently with drums pounding. Either way, if we want to experience the deeper currents of the cosmos, sooner or later death calls to us.",
        "citation": "LSDMU ch.1 §12 ¶4",
        "chapter_code": "1",
        "section_code": "12",
        "archival_title": "",
        "_score": 0.5961923003196716
      },
      {
        "text": "The proposal that death and rebirth take place at multiple levels of consciousness falls within the broad framework of Grof’s body of work, where he points to the numerous forms that death can take at transpersonal levels. In *The Ultimate Journey*, for example, he writes:",
        "citation": "LSDMU ch.6 §1 ¶15",
        "chapter_code": "6",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.5896740555763245
      },
      {
        "text": "*LSD and the Mind of the Universe is primarily a* cosmological narrative, not a therapeutic narrative. In a therapeutic narrative, the personal details are important; in a cosmological narrative, they are less so. Of course, this entire journey was deeply personal and I own it as such, but my personal story is not the important story here, nor is it essential to the story I want to convey. It is when one moves beyond the shoals of the personal psyche and enters the ocean of the deep psyche that the larger and more philosophically interesting story begins to emerge.",
        "citation": "LSDMU ch.1 §8 ¶7",
        "chapter_code": "1",
        "section_code": "8",
        "archival_title": "",
        "_score": 0.5822386741638184
      },
      {
        "text": "The death-rebirth process is never fully completed in a single session. Many sessions of repeatedly engaging the same issues are required before one has exhausted them. The usual pattern is that a subject working at this level will eventually experience a major perinatal crisis centering on one of the phases described above. Yielding to and resolving the crisis will usually shift the person into positive transpersonal experiences for the remainder of the session even though perinatal content may remain for future sessions. If the process is continued through serial sessions, a final death-rebirth experience eventually will completely exhaust all perinatal content. Making copious use of case histories, Grof has demonstrated that systematically engaging this traumatic material can actually dissolve the perinatal matrices, thus permanently removing their influence from the individual’s behavior. In subsequent sessions, the subject moves directly into transpersonal experience as the journey in consciousness continues. Grof has found that *every single person who reaches this level in their work adopts a spiritual interpretation of existence, regardless of their prior psychosocial conditioning*. This includes such unmystical types as staunch atheists, skeptics, Marxists, and positivistically oriented scientists.",
        "citation": "LSDMU ch.2 §4 ¶15",
        "chapter_code": "2",
        "section_code": "4",
        "archival_title": "",
        "_score": 0.5771481394767761
      },
      {
        "text": "Because the universe is infinitely deep with many layers, one faces many deaths on this journey. Ego-death is only the first. Death and rebirth is a cycle that repeats itself multiple times because the universe tends to yield its treasures in layers. The death of the egoic self is followed by other deaths at deeper levels, harder to describe because the terrain is less familiar but no less demanding to undergo.",
        "citation": "LSDMU ch.1 §12 ¶7",
        "chapter_code": "1",
        "section_code": "12",
        "archival_title": "",
        "_score": 0.5711123943328857
      },
      {
        "text": "Let me take this one step further. When this cycle of purification reaches particularly deep, it becomes a *cycle of death and rebirth*. I had originally thought that death and rebirth was a one-time event, but after going through this cycle multiple times at different levels of consciousness, I began to realize that in psychedelic sessions, *“death” is actually a very intense form of purification*.",
        "citation": "LSDMU ch.7 §6 ¶12",
        "chapter_code": "7",
        "section_code": "6",
        "archival_title": "",
        "_score": 0.5682134628295898
      },
      {
        "text": "After you have died and been reborn many times in your sessions, eventually the very concept of death begins to lose its meaning. You learn through repetition that at the deepest level of your being, it is impossible to die. The form that we are can be shattered, our reality can be repeatedly destroyed, but our innermost essence always reemerges. The phoenix always rises. When the process of purification reaches particularly deep, when it reaches so deep that it begins to dissolve the structure of our life as we have known it, it becomes *purification unto death*. When it empties us of all that we have known and all that we have been, a crisis is reached where what we have been collapses and we are carried forward into a new level of reality.",
        "citation": "LSDMU ch.7 §6 ¶13",
        "chapter_code": "7",
        "section_code": "6",
        "archival_title": "",
        "_score": 0.5664865970611572
      },
      {
        "text": "LSD unleashes such dramatically different states of awareness from anything we experience in our everyday life that we have to learn how to work with it. Like an athlete undertaking a strenuous sport, we have to train for the event. Not only do our minds have to adjust to the expanded capacities LSD awakens, so do our bodies. Our subtle energy system has to be conditioned and strengthened to sustain the enormous flows of energy evoked by the LSD state. As I look back on these early sessions, they seem to have functioned as an intensive training camp, preparing me physically and psychologically for the long journey that was beginning. They also broke me down existentially, taking me into my first death and rebirth.",
        "citation": "LSDMU ch.2 §0 ¶5",
        "chapter_code": "2",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5655906796455383
      },
      {
        "text": "As I have been working on LSD and the Mind of the Universe, my absorption of my psychedelic experiences has deepened in unexpected ways. They are beginning to live in me differently than before and I in them. It feels like my session memories have come together to form a greater living whole and that the inside and outside of my life are moving toward a new synthesis. There is a saying from the Navajo: “When you put a thing in order, and give it aname, and you are all in accord, it becomes.” By telling my story, by giving it aname and owning my experience, something new has been set in motion. A new peace has settled over me. At first this peace eased my existential loneliness and made the loss of communion more bearable, but then it deepened further. As I was finishing the book and beginning to speak about it publicly, a new spiritual transparency began to open in my life. It sometimes feels as though the Beloved is not waiting for me to die but is coming for me here. Where this will lead, I don’t know. It is still unfolding, taking me to new places, but surely this is the work of integration—to own, internalize, and manifest your experiences as deeply as you can. To let them flow through you and shape your presence on this Earth.",
        "citation": "LSDMU ch.12 §3 ¶5",
        "chapter_code": "12",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.5553544759750366
      },
      {
        "text": "At the present time, however, I have shifted to what I think is a simpler and more elegant way of understanding the ocean of suffering. I now see death and rebirth as a cycle that repeats many times as we move into progressively deeper levels of consciousness. Being an archetypal cycle, any single death-rebirth experience may incorporate material from multiple levels of consciousness. But looking back over the trajectory of all my sessions, I now recognize that the death-rebirth cycle was repeating itself in different forms at different levels of consciousness. The image below may help convey this point.",
        "citation": "LSDMU ch.6 §1 ¶10",
        "chapter_code": "6",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.5522050261497498
      },
      {
        "text": "I know it sounds arrogant to speak on such a scale, but I must if lam to describe the visions that repeatedly came through my sessions. Ego-death destroys the existential isolation and constant self-referencing that organizes our ordinary experience of the world. When the partitions of personal consciousness are surrendered, our experience spontaneously opens to the larger rhythms of life that we are part of. One portion of these rhythms is the collective psyche of our species. At the subtle level of consciousness, we can dissolve into the human species-mind so deeply that the beginnings and endings of our personal life become insignificant. When the “small-self” opens to the “species-self” this completely, it is only natural that insights into humanity’s larger developmental trajectory sometimes emerge in our awareness. We would be surprised if this did not happen.",
        "citation": "LSDMU ch.9 §0 ¶9",
        "chapter_code": "9",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5508210062980652
      },
      {
        "text": "**Death and Rebirth**",
        "citation": "LSDMU ch.2 §4 ¶14",
        "chapter_code": "2",
        "section_code": "4",
        "archival_title": "",
        "_score": 0.5498817563056946
      },
      {
        "text": "When the shell of the private mind dissolves in psychedelic practice, experience opens to a landscape so vast it’s hard to find the right words to describe it—the Mind of the Universe, the Cosmic Mind, the Great Expanse. One falls into it, explodes into it, melts into it, sometimes cataclysmically, sometimes so gently it feels like the most natural thing in the world. We are not in control of these expeditions. We show up, do the work, and make our requests, but in this collaboration a larger intelligence sets the course. What we experience seems to be a combination of what the universe wants us to know and what we are capable of knowing. If we drop into this ocean too quickly, we will lose our bearings and won't be able to bring back much of value. But if we use these hours conscientiously, this intelligence will take us in and teach us. Here all instruction is by initiation. We learn by becoming. The lessons are repeated again and again until our grasp of the material is secure, then new layers are added until the fuller picture emerges.",
        "citation": "LSDMU ch.9 §0 ¶3",
        "chapter_code": "9",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5428233742713928
      },
      {
        "text": "If the ultimate goal of spiritual practice is the permanent transformation of our consciousness, then the soft underbelly of psychedelics is their temporary nature. LSD plunges us into intense spiritual exercises, holds us there for a while, and then brings us back. Clearly, we cannot stay where we have gone; it is a mistaken strategy to try to do so. We must accept these limitations and work with them. But how can we work with these temporary states in a way that will advance our permanent transformation?",
        "citation": "LSDMU ch.1 §3 ¶4",
        "chapter_code": "1",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.5384364128112793
      },
      {
        "text": "One last point before we begin. It was during this late phase of the journey that I learned that there are many *degrees of dying* in a psychedelic session and that the deepest breakthroughs tend to follow the deepest deaths. With this discovery, death became my closest ally in the work. What had begun in the early sessions as confronting my shadow morphed into a discipline of actively embracing death in whatever form it presented itself. Far from being something to be feared, death became something I sought out, repeatedly plunging myself into its purifying fire. This is a strange thing to say, I know, but other psychedelic journeyers will understand. I was not a glutton for pain; rather, I was a glutton for what lies on the other side of pain.",
        "citation": "LSDMU ch.10 §0 ¶19",
        "chapter_code": "10",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5348353981971741
      },
      {
        "text": "LSD generates a powerful but temporary increase in the mind’s sensitivity. Our habitual conditioning is interrupted and our field of awareness is dramatically expanded, but after a number of hours our consciousness returns to its familiar patterns. If we don’t take steps to accurately record our experiences as soon as we return, our memory of them tends to fade. What was overwhelmingly powerful one day becomes slightly dimmer the next and dimmer still a month later. Preserving the memory of our experiences as carefully as possible completes the circle of learning and lays a stronger foundation for our next session.",
        "citation": "LSDMU ch.1 §7 ¶2",
        "chapter_code": "1",
        "section_code": "7",
        "archival_title": "",
        "_score": 0.5311592221260071
      }
    ]
  },
  "talks": {
    "chunks": [
      {
        "text": "---\narchivaltitle: Prof Chris Bache - Cycles of Death & Rebirth\n\nchannel: \"Scientific & Medical Network\"\n\nrecorded: 2023-04-18\n\npublished: 2023-04-18\n\nyoutubeid: bQw4ypKrJb8\ntranscriber: gpt5 model by OpenAI\n\ntranscriptiondate: 2025-08-19\n\nlicense: CC0 1.0 Universal\nspeakers: [\"Chris Bache\"]\n---\n\n---\nChris Bache: When one works with very high doses of LSD, one goes through a series of Death-Rebirth experiences. In this image, the drop at the center underneath the line represents our egoic, private consciousness. Everything above the line represents spiritual reality. In transpersonal consciousness, the first Death-Rebirth experience takes place at the interface of our time-space consciousness and the beginnings of spiritual consciousness, and it's usually referred to as ego death. It is the complete destruction of our personal time-space identity and the beginning of an opening into spiritual reality.",
        "ts_url": "https://youtu.be/bQw4ypKrJb8?t=4",
        "archival_title": "Prof Chris Bache – Cycles of Death & Rebirth",
        "recorded_date": "2023-04-18",
        "start_hhmmss": "00:00:04",
        "_score": 0.7076575756072998
      },
      {
        "text": "rough cycles of death and rebirth, their significance, and how they facilitate collective awakening.\nChris Bache:\nFirst, what I’m going to describe is my variation on an ancient Buddhist teaching. When one sits to meditate or do spiritual practice, the first step is cultivating bodhicitta—the wish to save all sentient beings. You do the practice not for personal benefit but to nourish the uplift of the whole of creation. The last step is distributing the merit—you give away the blessings you’ve acquired. In mature spiritual practice, everything is for the benefit of the whole.",
        "ts_url": "https://youtu.be/ec0elBHJXAc?t=3309",
        "archival_title": "The Mind of the Universe: Diamonds from Heaven",
        "recorded_date": "2023-01-27",
        "start_hhmmss": "00:55:09",
        "_score": 0.7041682004928589
      },
      {
        "text": "and rebirth. How has that process impacted you? What was that like for you during these experiences?\nChris Bache: Violence may not be quite the right word. It shows up in the early stages when you're going through powerful kriyas and this tremendous physical and emotional detoxification, which can leave you in convulsions, bouncing around the mattress, as your body throws off vast quantities of physical and emotional stress. There is a certain violence in dying. Over the course of the work, I learned that the deepest breakthroughs followed the deepest purifications, and the deepest deaths yielded the deepest ecstatic joys on the other side. As that became clear, death became my closest ally. Rather than trying to avoid harsh confrontations, I did everything I could to facilitate their emergence. I went right at it—not because I like suffering, but because I like what was on the other side. I came to understand that even death in a psychedelic context is a form of purification: letting go of reality as you know it at one level to gain access to reality at a deeper level. So it became part of the work.",
        "ts_url": "https://www.inbodiedlife.com/blog/chris-bache",
        "archival_title": "Learning to be Gods: Conversations about LSD and the Mind of the Universe with Chris Bache",
        "recorded_date": "2023-06-30",
        "start_hhmmss": "00:19:54",
        "_score": 0.6919712424278259
      },
      {
        "text": "Chris a chance to connect the living universe with the evolution of life through that living system.\nChris Bache\nIn that context, let me say something hard and consoling at the same time. From a reincarnation perspective, we’re always popping into time-space and popping out into a spiritual meta-universe, then back in and out again. From this perspective, what is death? All the enlightenment and awakening traditions say the same thing: birth is not the beginning of our life. Look carefully and you’ll find in your body and mind evidence of experience that far predates your physical life. Death is not the end, because we now have, especially through the work of people like Michael Newton on life-between-lives and past-life therapy, abundant evidence of a continuity of consciousness that predates and postdates our individual life.",
        "ts_url": "https://youtu.be/TeifW7GZ9xI?t=3065",
        "archival_title": "Wisdom Keepers conversation with Duane Elgin",
        "recorded_date": "2023-01-30",
        "start_hhmmss": "00:51:05",
        "_score": 0.6843578219413757
      },
      {
        "text": "e to life, not because you're trying to make your ego feel happy. Have I missed anything out on the—\nChris Bache:\nHealth world? I think it's great. And if you do your work well, one of the things that happens is you lose all fear of death. Once you transition several times into that reality, you know in your bones, from your own experience, that death is not an end of anything. It's simply the end of an incarnational cycle, and there is absolutely nothing to fear about death. Death is homecoming. All of the Hollywood bullshit thrown up at us—dark places and demons and ghosts and all this stuff—it's just nonsense. Ninety-nine percent of people die and make a transition into the light perfectly naturally and comfortably. If you're afraid of dying, you've got your entire metaphysics upside down. Death is homecoming. Death is the end of your matriculation. It's the harvesting of your life. Birth should be mourned. Birth is where the work begins. It's like being a freshman in college—it's hard. Graduation is wonderful, right?",
        "ts_url": "https://youtu.be/q-caGhIlKS8?t=4351",
        "archival_title": "The Phoenix Always Rises: Evolving into the Future Human",
        "recorded_date": "2025-01-08",
        "start_hhmmss": "01:12:31",
        "_score": 0.6738936305046082
      },
      {
        "text": "back for that one. It’s really good to bear these things in mind as we move through intense periods.\nChris Bache: Let’s allow ourselves to look deep into the future of this future human. Whatever transformation we’re going through—and we agree it’s acute, giving birth to a new order of human capacity—however long it takes, the human story isn’t stopping. The evolutionary drama isn’t ending. This is a new platform within which the story will continue to develop. We’ve been evolving by learning from suffering, our great teacher in much of the past, but we’re getting past that—just as we’re growing out of our fear of death. If there were one thing I wish I could give people from my sessions, it would be to lose the fear of death. If you’re afraid of death, your cosmology is upside down. You don’t understand what’s going on. Death is graduation. Death is the great respite, the great reward.",
        "ts_url": "https://youtu.be/5Lus4MLlzbA?t=2863",
        "archival_title": "Contemplating Reincarnation – Part 3",
        "recorded_date": "2021-03-27",
        "start_hhmmss": "00:47:43",
        "_score": 0.6678948402404785
      },
      {
        "text": "nced this profoundly in your psychedelic journeys—the constant states of transformation and rebirth.\nChris Bache\nYes. When I started, I thought there was just one death—ego death—that would launch you into the spiritual universe. But the spiritual universe has many layers. Being operational at one layer doesn’t mean you’re operational at deeper layers. You go through another metamorphosis—another death and surrender—to be reborn into another layer, and so on. That reflects the Tibetan idea of Bardo: a discrete layer of consciousness. In describing the after-death journey, there are multiple Bardos you pass through—the hungry ghosts, heavenly spirits, and so on. In the West, we often use Bardo to represent the totality of what happens after death, and that’s fine, but the original use points to stages in a progression.",
        "ts_url": "https://youtu.be/AQwAxhukBrE?t=481",
        "archival_title": "Contemplating Reincarnation – Part 2",
        "recorded_date": "2021-03-16",
        "start_hhmmss": "00:08:01",
        "_score": 0.6641451120376587
      },
      {
        "text": "orced since first experiencing it in the late 1990s, to the writing of the book, to the present day?\nChris Bache: It hasn't changed one bit. I say in the book that when I had the experience in session 55—the death and rebirth of humanity in 1995—for weeks I walked around like I was walking around Hiroshima a week before the bomb went off. I have carried in my being, in my body, a knowing of where we are in history and what's coming.\n\nWhen I look around, whether I agree with people politically or socially or not, I see heroes. I see every human being here on this planet as having incarnated voluntarily, choosing to be part of this evolutionary pivot. Every person here—even though they may not remember it—has chosen to be here, and this is going to be a very difficult period to incarnate. The beings who are part of the incarnation process are extraordinarily powerful, valuable beings.",
        "ts_url": "https://youtu.be/icBasHgjzsY?t=4772",
        "archival_title": "LSD and the Mind of the Universe – Christopher Bache, Ph.D.",
        "recorded_date": "2021-06-03",
        "start_hhmmss": "01:19:32",
        "_score": 0.6635923385620117
      },
      {
        "text": "g from that into something else. Could you give a step-by-step of what the early stages looked like?\nChris Bache:\nFor about the first two years, I worked at what Stan Grof describes as the perinatal level of consciousness—the interface between personal egoic reality in space-time and early transpersonal consciousness. I had many experiences of reliving my own birth, experiences of death and dying, until, after about two and a half years, my personal reality was shattered. I died as the person I had known myself to be and was then reborn into a reality that radically transcended Chris Bache's reality. At that point, I was working deep within the collective unconscious, and the process began again.",
        "ts_url": "https://youtu.be/L3D_fSr75u8?t=937",
        "archival_title": "Mapping Consciousness with High-Dose LSD (ATTMind #83)",
        "recorded_date": "2018-10-12",
        "start_hhmmss": "00:15:37",
        "_score": 0.6609907150268555
      },
      {
        "text": "tures within which you are holding reality. So it’s death, but a fluid death—a purification process.\nJohn Dupuy:\nSo, Chris, following up on what Roger asked about what dies—what doesn’t die? Because in your book you talk a lot about reincarnation as a given in the universe as it was revealed to you—this universe, multiverse, whatever this mysterium tremendum is that you’ve brought back to us. So what doesn’t die?\n\nChris Bache:\nWhen we go deep, we realize that everything is dying and living, dying and living, constantly. There are no stable things which are not dying in this universe. To see that clearly is considered a great accomplishment—to really understand that everything is temporary, transitional, moving, fluid. People have asked me, “What is it that dies?” What I will say is there is always continuity of memory. If you organize your session well, there is continuity of recall; therefore there is continuity of memory. You might say that memory doesn’t die, but I don’t think that’s the best way to describe it. I think memory is shattered and reconstituted. I don’t know what doesn’t die, but—\n\nJohn Dupuy:\n—is being purified, right? What is it that’s being purified?",
        "ts_url": "https://youtu.be/-2NMOMvRkYE?t=2767",
        "archival_title": "Evolution of Collective Consciousness (Deep Transformation Podcast – Part 1)",
        "recorded_date": "2022-01-20",
        "start_hhmmss": "00:46:07",
        "_score": 0.6600664258003235
      },
      {
        "text": "e case: a painful birth to transition into a more functional, balanced species. Could you elaborate?\nChris Bache: I explore this in a chapter called “The Birth of the Future Human,” and earlier in “The Great Awakening” in Dark Night, Early Dawn (2000). I was uncomfortable entering this territory at first—I’m not drawn to historical speculation. I began this work for individual healing and enlightenment, and that premise was blown away within a few years. The purification, the access to information and knowledge—everything seemed to be in service of the species as a whole. It’s not that our species is special in the universe, but the Divine’s focus here, now, seems species-wide.\n\nThis emphasis repeated so often and strongly that the gist of my 20-year journey became the collective story of death and rebirth. I have deep convictions that we’ve entered the dark night of our collective soul—a period of purification, confronting the sins of our fathers and mothers, which are our own through reincarnation. We’re facing our past choices and their consequences, purifying the toxins they left, to open into new dimensions of our being.",
        "ts_url": "https://youtu.be/B0BhUOEP1Mg?t=3521",
        "archival_title": "Bicycle Day Conversation with Jef Baker",
        "recorded_date": "2020-04-19",
        "start_hhmmss": "00:58:41",
        "_score": 0.6594325304031372
      },
      {
        "text": "h the previous experience. If you re-listened, it would tend to pull you back toward that territory?\nChris Bache\nIt would tend to, or at least there was the potential for it to pull you in that direction. Maybe not the second time, but with repeated listening it can narrow your experience instead of expanding and opening it.\n\nRyan Kemp\nAs you touched on, what you came to learn was a series of iterated deaths and rebirths in one body, which appears in Stan Grof’s work as well. Could you talk about how you view that—and its relationship to actual death and rebirth as we know it, the leaving of this form and coming back into a new form?\n\nChris Bache\nIt took me a long time to understand the patterns of my sessions. In some ways they started as I expected, drawing upon Stan’s map of consciousness, but after a few years they seemed to diverge and enter new territory. One thing I’ve come to understand is that consciousness has many levels—operational tiers. Each time you enter a new level, there is required a surrender of everything you had known and assumed before, in order to enter a level that operates by completely different rules.",
        "ts_url": "https://youtu.be/Dw7D7ih8vy0?t=1056",
        "archival_title": "EP.6 - Chris Bache | LSD AND THE MIND OF THE UNIVERSE",
        "recorded_date": "2020-05-13",
        "start_hhmmss": "00:17:36",
        "_score": 0.6582409143447876
      },
      {
        "text": "he role of fear and integration versus disintegration, and your ability to contain this information?\nChris Bache\nTo go through a death–rebirth cycle is always an ordeal. It always involves surrender to the unknown and yielding to the fear that’s holding your system locked in place. At advanced stages I truly did fear for my sanity, or at least I knew I was going someplace completely beyond anything I could hold on to. I couldn’t hold on to sanity as I had known it. It was like going over a waterfall. But once you go over and experience that death, you wake up in a new reality as a new kind of being—not just a new-and-improved you, but a different kind of being—where, for hours at a time, you can experience the universe as it experiences itself, completely beyond any human frame of reference.",
        "ts_url": "https://youtu.be/eV86_iSTEbU?t=3418",
        "archival_title": "Exploring LSD as a Practice (Edge of Mind Podcast – Part 1)",
        "recorded_date": "2022-02-17",
        "start_hhmmss": "00:56:58",
        "_score": 0.6556759476661682
      },
      {
        "text": "ecisive turning point, but never how it would realize itself. I had no idea how it would come about.\nThen, in the 55th session—the Great Awakening session—I was taken deep into the future to experience the death and rebirth of the human species. Not a physical death and rebirth, but a psycho-spiritual one—though it did involve much physical suffering and many deaths. I experienced it not as “Chris Bache,” not even as an expanded version of myself, but as the entire species. My consciousness dissolved into the collective psyche. I experienced a crescendo of suffering and a birth coming out of that suffering—a new form of human being.",
        "ts_url": "https://youtu.be/Kh5aqAuDBIM?t=6255",
        "archival_title": "LSD and the Mind of the Universe – S2S Podcast",
        "recorded_date": "2023-01-06",
        "start_hhmmss": "01:44:15",
        "_score": 0.6543970704078674
      },
      {
        "text": "e from you as a human being to allow that to happen, since you've got no idea where it really leads?\nChris Bache:\nIt does. This is one of the great gifts that Stan Grof gave me—reading his work, I learned to trust the process. If you submit to it—let it take you where it will—no matter how terrible it becomes, no matter how inscrutable, if you surrender to it, it will always culminate. It will take you through a breaking point, and then it will catch you. You die, and then you awaken into a different condition, a different reality, as a different being in a different dimension of existence.\n\nIain McNay:\nSo what do you mean that you will die—what does that actually mean in a tangible way?\n\nChris Bache:\nIn order to experience intimately the deep nature of reality, you can't take your ego into that reality and have a transpersonal experience. The only way to enter these realities is to become a “citizen” of those realities. Our time-space identity—just by the conditioning of time and space—keeps us small. In order to enter vast expanses of reality, we have to let go of what keeps us small. So you go through a psychological death—ego death is very common.",
        "ts_url": "https://youtu.be/yewNM9smrqo?t=560",
        "archival_title": "Diamonds from Heaven – Interview with Iain McNay",
        "recorded_date": "2018-07-05",
        "start_hhmmss": "00:09:20",
        "_score": 0.6539073586463928
      },
      {
        "text": "death and about life and about our future as individuals and as a species. It’s a beautiful vision.\nChris Bache:\nEvery time we die, at the deepest level all spiritual traditions tell us no one dies—we transition into a different level of reality. I’m not making light of death or trivializing it, only affirming this deeper insight: everything we are survives the death of the body. At the end of every lifetime, we return to where we came from as a resting place. We are restored and refreshed, and then we return to the challenges of history. We don’t have to live through all the evolutionary future to know freedom from the fear of death. If there were one thing from my psychedelic experiences I wish I could give the world, it would be eliminating the fear of death. I am not only unafraid of dying—I’m looking forward to it, because death is homecoming. Always, death is homecoming.\n\nSimeon Mihaylov:\nDifferent spiritual traditions have said that in different ways. Carl Jung says at one point that life is a short period between two infinities—which, in the end, might just be one. I think that’s a beautiful way of putting it.",
        "ts_url": "https://youtu.be/Kh5aqAuDBIM?t=6930",
        "archival_title": "LSD and the Mind of the Universe – S2S Podcast",
        "recorded_date": "2023-01-06",
        "start_hhmmss": "01:55:30",
        "_score": 0.6504723429679871
      },
      {
        "text": "ain and suffering to reach deeper levels of consciousness. Can you share what that was like for you?\nChris Bache: In the early stage at the level of personal mind, the pain and suffering took the form Stan Grof discusses as the perinatal level—sometimes reliving birth and confronting the fundamental existential questions of life in physical reality. Is there meaning, order, design, intelligence? At the physical level, everything we love will be destroyed at death. Is there any reality beyond death? You have to face the deepest levels of metaphysical angst until your identity is crushed and shattered. That’s easier for some than others, but you must surrender your time-space identity to gain access to the next level. At that next level, I continued a deepening confrontation with pain, suffering, and violence—so deep and prolonged, encompassing so many hundreds of thousands of persons over thousands of years, that I concluded it wasn’t a cleansing of my personal psyche. Something was using my sessions to set in motion a reconciliation and healing of levels of pain that were fundamentally collective. Then further deaths and rebirths followed, where the nature of death and suffering changes the deeper you go. The basic principle is simple: if you want to experience oneness with God or the mind of the universe, our historical consciousness is too small—if you want to literally experience it, not just think it. To immerse yourself in communion with these levels, your small identity must be surrendered and you must flow into a larger identity. Eventually you enter levels where it would misrepresent things to say “Chris Bache went and had those experiences.” Rather, Chris Bache has to be destroyed, dissolved, for these levels of consciousness to manifest inside my awareness. The fact that I remember them doesn’t mean my personality was present when they were had. You lose yourself, enter communion with the universe, and when you come back you gather the experiences, and my personality synthesizes and integrates them. It’s a pulsing: surrender completely, open, breathe, receive teachings, then bring it back in and consolidate.",
        "ts_url": "https://youtu.be/FMgixG6Z0sk?t=1648",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "recorded_date": "2025-03-18",
        "start_hhmmss": "00:27:28",
        "_score": 0.6502598524093628
      },
      {
        "text": "generative, life-affirming, and liberating, and yet it’s one of the scarier things for most people.\nChris Bache: I understand that, and maybe I pushed it a little harder than most. That makes some people in the therapeutic community uncomfortable. But once you learn that deep purification—the deep confrontation with limits at any level—leads to ecstatic deliverance from those limits at another level, then it's the most natural thing in the world. It's quite natural for us to die. Nobody survives the game of life. We live in a culture that's uncomfortable engaging content around death because we don't understand what death is. We're chronically constricted within time-space realities. We don't understand what happens when we die or the liberation death involves. It's not just psychedelics that show us this. Near-death research shows us this; hypnotic regression past-life therapy shows us this; Michael Newton’s work shows us this. Once you understand the larger circle—that life is a circle; that there is birth, a deep internalization of circumstances and challenges and learning; and then death, which is a phase of homecoming, returning to the light—what's to be afraid of? Dying is graduation. Birth is when the hard work begins. That's what you should be afraid of.",
        "ts_url": "https://www.inbodiedlife.com/blog/chris-bache",
        "archival_title": "Learning to be Gods: Conversations about LSD and the Mind of the Universe with Chris Bache",
        "recorded_date": "2023-06-30",
        "start_hhmmss": null,
        "_score": 0.6442540884017944
      },
      {
        "text": "ownward. This is a cosmic dance—a meeting between deep levels of the Divine, God communing with God.\nChris Bache:\nSo what dies and is reborn at these deeper cycles of death and rebirth—beyond the ego, beyond the species ego, beyond a series of shamanic personas? I think what dies and is reborn is something of truly cosmic proportions. Some dimension God is calling, some dimension that is extraordinarily vast, surrenders, and in that surrendering awakens more completely to itself. Much to our surprise, the divine appears to genuinely appreciate our help in facilitating this communion. Stan, thank you from the bottom of my heart—thank you.",
        "ts_url": "https://youtu.be/cEsoN2IaGc4?t=1810",
        "archival_title": "Exploring the Boundaries of Death and Rebirth in LSD Psychotherapy",
        "recorded_date": "2015-03-16",
        "start_hhmmss": "00:30:10",
        "_score": 0.6431567668914795
      }
    ]
  },
  "meta": {
    "date": "2025-10-22"
  }
}