{
  "meta": {
    "qid": "nature-of-consciousness",
    "title": "The Nature of Consciousness",
    "date": "2025-10-22",
    "version": "v1",
    "source_policy": "Book-first. Public transcripts as color with timestamped links."
  },
  "book": {
    "chunks": [
      {
        "text": "osophy of religion, not just for psychology, and I knew I wanted to get involved in doing this work.\nSo even though LSD had been made illegal in 1970, I chose to conscientiously break the law and begin a series of rigorously structured sessions following Stan’s protocol. After three medium-dose sessions, I chose to work at high doses. This is a protocol I don’t recommend today. I would be much gentler on myself if I were doing it over again, but at the time this is what I was doing to accelerate my own spiritual development. Quickly it evolved into engaging the deep structures of human evolution and trying to support humanity’s spiritual development, and then exploring this marvelous universe that we are part of.\n\nTami Simon\nYou write toward the beginning of the book, “In the end, what’s important is not the method of exploration used, but what this method shows us about the extraordinary universe we live in.” That’s what I want to focus on—really the discoveries that you made. Let’s start with the title: LSD and the Mind of the Universe. I’m not sure everyone can track with you there—the universe has a mind? Tell us what you discovered.",
        "citation": "Bache · 2023-07-12 · Sounds True · Diamonds from Heaven: Exploring the Mind of the Universe",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Diamonds from Heaven: Exploring the Mind of the Universe",
        "_score": 0.666420578956604
      },
      {
        "text": "eally look forward to sharing the experiences I report in my book, LSD and the Mind of the Universe.\nDavid has framed our conversation as the question of whether we can all access the cosmic mind using psychedelics. I believe that we all can, but whether we all should is another matter entirely. In contrast to the early idea that psychedelics represent a shortcut to mystical experience, my concern is that the psychedelic journey into the cosmic mind is extremely demanding and must be approached with great care and caution.\n\nIn LSD and the Mind of the Universe, I describe experiences that opened in 73 high-dose LSD sessions conducted over 20 years when I was a young man between 30 and 50 years old, from 1979 to 1999. I then spent another 20 years thinking about these experiences, digesting them, mapping them, and pondering their implications. I hope the visions I brought back will be useful not only to other psychonauts but also to those who would never take a psychedelic themselves. What’s important is the vision of the cosmos they contain, and a vision of where humanity is in its long evolutionary journey and the turning point we’re coming to.",
        "citation": "Bache · 2022-12-07 · Scientific & Medical Network · LSD & the Mind of the Universe (SMN webinar)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD & the Mind of the Universe (SMN webinar)",
        "_score": 0.6631860733032227
      },
      {
        "text": "ss LSD? Many will see this as a discussion on drugs, when actually it’s something far more profound.\nChris Bache\nWe all suffer from the carryover of our culture’s experience with psychedelics in the 1960s and the negative press generated around them, when the true story is very different. Psychedelics in general, and LSD in particular, function as non-specific amplifiers and catalysts of consciousness. They don’t give you a particular experience; they hyper-amplify your consciousness. If you use those hours of hyper-amplified consciousness carefully—shutting out all outside stimulus and focusing entirely within—you can use them to explore and, in a sense, excavate the deep architecture of the psyche and the nature of consciousness itself.",
        "citation": "Bache · 2020-05-13 · Ryan & Mo - Life In Rural Thailand · EP.6 - Chris Bache | LSD AND THE MIND OF THE UNIVERSE",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "EP.6 - Chris Bache | LSD AND THE MIND OF THE UNIVERSE",
        "_score": 0.6564956903457642
      },
      {
        "text": "the LSD work—but LSD and the Mind of the Universe focuses on what happened in the high-dose journey.\nThe circumstances were unusually stable, concentrated, and focused: the same sitter for years, same set and setting, intention, location (Northeast Ohio), substance, dose level, and the same recording process—always recording each session as completely as possible within 24 hours. When you stabilize your work—eliminate variables, use the same methodology consistently—it stabilizes the conversation between you and the creative intelligence of the universe. It stabilizes the communion so that one session leads to the next in a coherent, intelligent manner. You may not understand the continuity as it unfolds, but over time you see patterns and feel you’re engaging a single creative intelligence. I say that carefully—there are many layers and forms of intelligence—but across sessions the continuity is unmistakable.",
        "citation": "Bache · 2021-03-29 · Spirit Plant Medicine · Chris Bache – LSD and the Mind of the Universe – SPMC 2019",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Chris Bache – LSD and the Mind of the Universe – SPMC 2019",
        "_score": 0.6535547971725464
      },
      {
        "text": "the collective structure of consciousness and the collective import of our transformative practices.\nThen I wrote The Living Classroom in 2008. Even though my students never knew about my psychedelic experiences—I didn’t talk about them on campus for obvious legal reasons—I found that my students were being impacted by my work. There was a ripple effect: the deeper I went into the unified fabric of reality, the more ripples of transformation seemed to radiate around me. I had to study this, to understand what was happening. The Living Classroom is about collective consciousness; I don’t mention psychedelics because the issue is the nature of consciousness itself. It doesn’t matter which transformational method you use—if you go deeply enough, ramifications will spread out around you in 360 degrees.\n\nAll of this comes out of my psychedelic work. LSD and the Mind of the Universe: Diamonds from Heaven really tells the core story of this journey. Thank you for letting me describe it today.",
        "citation": "Bache · 2021-06-03 · Portland Psychedelic Society · LSD and the Mind of the Universe – Christopher Bache, Ph.D.",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD and the Mind of the Universe – Christopher Bache, Ph.D.",
        "_score": 0.6471006870269775
      },
      {
        "text": "a journey. The publisher wanted a more marketable title, and that’s LSD in the Mind of the Universe.\nThe beginning of this book goes back over 40 years. In 1978, when I began graduate school, I encountered Stanislav Grof’s work. His book Realms of the Human Unconscious turned my life around, followed quickly by LSD Psychotherapy. He gave me the method and the confidence to explore my consciousness and, through that exploration, to come to know the deep psyche—the deep universe—better. I want to emphasize I did this work as a philosopher. I was not a therapist. I wasn’t primarily seeking healing—though healing did come—but seeking to understand our universe as deeply as I could by exploring my consciousness as deeply as I could.",
        "citation": "Bache · 2019-11-13 · Trust Psyche · LSD & the Mind of the Universe: Diamonds from Heaven",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD & the Mind of the Universe: Diamonds from Heaven",
        "_score": 0.6464022397994995
      },
      {
        "text": "ensions of consciousness that truly are the mind of the universe—or, if you prefer, the mind of God.\nAs vast as the universe is—billions of galaxies, immense age and scale—this universe has a mind as deep, broad, and old as its body is. My individual experience of consciousness is a drop, a fractal aspect of the totality of consciousness that flows. That’s why I gave the book the title LSD and the Mind of the Universe: when you go very deep using a powerful and circumscribed protocol, you drop into deeper and deeper layers and are given the opportunity to explore the very nature of physical reality itself.\n\nEmmy Vadnais:\nI think we just lost your video, Chris.\n\nChris Bache:\nI lost the video here. Let’s see—how’s the audio? Okay, let me see if I can—\n\nJeffrey Mishlove:\nI guess the camera is pointing somewhere else.\n\nChris Bache:\nI don’t know why it dropped, but I can shift to a different—\n\nEmmy Vadnais:\nThere we go. We’ve got a view of you now. Wonderful.",
        "citation": "Bache · 2025-05-18 · New Thinking Allowed · Diamond Luminosity (live stream)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Diamond Luminosity (live stream)",
        "_score": 0.6394421458244324
      },
      {
        "text": "to let go completely and go where it wants to take you. Don’t waste time trying to maintain control.\nEmmy Vadnais: Before we go further, have you come to understand what LSD is doing to human physiology and the nervous system? Many people think of consciousness as tied to the brain. I recently spoke with Jill Bolte Taylor, the Harvard neuroanatomist who wrote My Stroke of Insight. She described our personal sense of identity as being just the size of a peanut in our brains.\n\nChris Bache: I follow the scientific discussion—the biochemistry of LSD, how it affects brain structure, default mode network interruption, and so on—but I’m not drawn to that conversation. I’m not primarily a scientist. I’ve taken more of a psychological approach: whatever the mechanism, these substances amplify and hypersensitize consciousness, allowing you to experience dimensions of mind—and eventually reality beyond mind—that are usually filtered by our space-time focus.\n\nEmmy Vadnais: Where we can feel trapped inside our bodies or what most people consider a primarily materialistic world, which we know is not the whole picture.",
        "citation": "Bache · 2025-03-18 · New Thinking Allowed · Psychedelics and the Cosmic Mind",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "_score": 0.6393274664878845
      },
      {
        "text": "on, deep meditation, or psychedelic journeying. Feel free to share some of your experiences in that.\nChris Bache: Well, I’ve done that as carefully as I can in my book, LSD in the Mind of the Universe. The invitation is to appreciate that we only became conscious of the Mother Universe about 5,000 years ago—when we developed sufficient discipline to drop beneath the conditioning of our individual egoic mind and tap into the stream of consciousness we share with all life. We’ve been walking upright for 5.8 million years, operating with our larger brain for about 200,000 years. Writing came in about 5,000 years ago; the Upanishadic breakthroughs, three to four thousand years ago. But these are nothing compared to the billions of years ahead. We’re just waking up to who we are, so naturally we get confused given the enormity of what we’re growing into.",
        "citation": "Bache · 2021-03-16 · Gene Keys · Contemplating Reincarnation – Part 2",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Contemplating Reincarnation – Part 2",
        "_score": 0.6361479163169861
      },
      {
        "text": "tic resonance underneath the verbal exchange of ideas—consciousness directly engaging consciousness.\nI published a book in 2008, after I stopped my sessions, called The Living Classroom, in which I lay it all out—but I never mentioned psychedelics, because the issue is not psychedelics; the issue is consciousness, the potential of consciousness. If you do very deep consciousness work without psychedelics, I think you can trigger the same things. Just recently—this month—SUNY Press is bringing out a second edition of The Living Classroom, and they invited me to tell the truth about my psychedelic practice because I'm out of the closet by now; LSD in the Mind of the Universe is out. So the new edition makes clear that my psychedelic practice was driving the phenomena that emerged in my classes, even though other people not using psychedelics can experience the same thing.",
        "citation": "Bache · 2025-01-08 · Accidental Gods · The Phoenix Always Rises: Evolving into the Future Human",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "The Phoenix Always Rises: Evolving into the Future Human",
        "_score": 0.6290897727012634
      },
      {
        "text": "n as we know it? If you have, you’re in luck, because that’s exactly what we’re going to talk about.\nWe’re speaking with Christopher Bache, author of LSD and the Mind of the Universe. Christopher M. Bache is a Professor Emeritus in the Department of Philosophy and Religious Studies at Youngstown State University, where he taught for 33 years; a Fellow at the Institute of Noetic Sciences; adjunct faculty at the California Institute of Integral Studies; and on the advisory board for Grof Transpersonal Training and the Grof Foundation. He’s an award-winning teacher and international speaker, the author of three books, and he’s been on the show previously—Episode 89, Mapping Consciousness with High Dose LSD—where we talked about his 73 high-dose LSD journeys over 20 years and what he learned about the nature of reality and the universe.",
        "citation": "Bache · 2021-04-21 · Adventures Through the Mind · Global Collapse, Spirituality & The Birth of the Future Human (ATTMind #142)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Global Collapse, Spirituality & The Birth of the Future Human (ATTMind #142)",
        "_score": 0.6273522973060608
      },
      {
        "text": "I’m not sure everyone can track with you there—the universe has a mind? Tell us what you discovered.\nChris Bache\nAs I came to experience it, consciousness is like an infinite ocean. When we open ourselves in deep psychedelic states, it’s as if our mind is a seed-catalyst dropped into this ocean, and it crystallizes a set of experiences out of this infinite potential. By absorbing and internalizing what we’re being offered—what we’re being taught—we’re changed, purified, transformed inwardly. Then, when we drop that changed mind back into the infinite potential, it triggers an even deeper set of experiences from its infinity.\n\nI experienced myself as engaging an intelligence—a consciousness—that was directing my sessions. I did not control what was unfolding. I was always yielding and following a lead that came from deeper levels of consciousness. As the journey continued, the levels of consciousness I was entering deepened multiple times.",
        "citation": "Bache · 2023-07-12 · Sounds True · Diamonds from Heaven: Exploring the Mind of the Universe",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Diamonds from Heaven: Exploring the Mind of the Universe",
        "_score": 0.6253393292427063
      },
      {
        "text": "LSD and the Mind of the Universe is the memoir of a psychedelic explorer. It is the story of one person’s journey into the mind of the cosmos. I’ve tried to tell this story as concisely as I can, focusing on the journey itself and keeping theoretical discussion to a minimum. I will rely on other authors to give the reader the history and science of psychedelics, their psychopharmacology, and their clinical applications. I share my psychedelic experiences here not because I think they are special or unique, for they are not, but because, all things considered, they are the most valuable gift I have to offer the psychedelic conversation.",
        "citation": "LSDMU",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "",
        "_score": 0.7050057649612427
      },
      {
        "text": "And last, this book has two titles, what Tibetans would call an outer title and an inner title. LSD and the Mind of the Universe is its outer title, describing what the book is about—exploring the mind of the universe through carefully conducted LSD sessions. Diamonds from Heaven is its inner title, describing its innermost essence, for at the center of the mind of the universe, one enters the infinite clear light of Diamond Luminosity.",
        "citation": "LSDMU",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "",
        "_score": 0.6300467252731323
      },
      {
        "text": "*LSD and the Mind of the Universe is primarily a* cosmological narrative, not a therapeutic narrative. In a therapeutic narrative, the personal details are important; in a cosmological narrative, they are less so. Of course, this entire journey was deeply personal and I own it as such, but my personal story is not the important story here, nor is it essential to the story I want to convey. It is when one moves beyond the shoals of the personal psyche and enters the ocean of the deep psyche that the larger and more philosophically interesting story begins to emerge.",
        "citation": "LSDMU ch.1 §8 ¶7",
        "chapter_code": "1",
        "section_code": "8",
        "archival_title": "",
        "_score": 0.5935664176940918
      },
      {
        "text": "As I have experienced it, consciousness is an infinite ocean of experiential possibilities. When we take these amplifying medicines, the mind we drop into this ocean acts as a seed crystal that catalyzes a certain set of experiences from its infinite potential. As we are gradually healed, purified, and transformed by these encounters, the seed crystal of our mind is changed. In subsequent sessions, it catalyzes still deeper experiences from this ocean. If we repeat this process many times in a sustained fashion, a sequence of initiations into successively deeper levels of consciousness takes place, and a deepening visionary communion unfolds. Each segment of this communion tends to pick up where the previous segment stopped. Sometimes there is a very tight continuity between the sessions, sometimes it is broader, but it’s always there woven into the fabric of engagement.",
        "citation": "LSDMU ch.1 §9 ¶3",
        "chapter_code": "1",
        "section_code": "9",
        "archival_title": "",
        "_score": 0.5522921085357666
      },
      {
        "text": "Reduced to its essence the teaching was this: Matter is the canvas that mind paints upon. It has no capacity to act apart from the animating presence of consciousness and is responsive to the direction of consciousness. Therefore, whatever our experience is in spacetime, we must have the courage to sit still and face the fact that we are experiencing nothing but the manifestation of our own consciousness. No matter how terrible the pain, no matter how horrendous the injustice or inscrutable the logic, our experience in space-time is the direct expression of our consciousness in a higher order of reality.",
        "citation": "LSDMU ch.8 §0 ¶32",
        "chapter_code": "8",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5400999188423157
      },
      {
        "text": "When the shell of the private mind dissolves in psychedelic practice, experience opens to a landscape so vast it’s hard to find the right words to describe it—the Mind of the Universe, the Cosmic Mind, the Great Expanse. One falls into it, explodes into it, melts into it, sometimes cataclysmically, sometimes so gently it feels like the most natural thing in the world. We are not in control of these expeditions. We show up, do the work, and make our requests, but in this collaboration a larger intelligence sets the course. What we experience seems to be a combination of what the universe wants us to know and what we are capable of knowing. If we drop into this ocean too quickly, we will lose our bearings and won't be able to bring back much of value. But if we use these hours conscientiously, this intelligence will take us in and teach us. Here all instruction is by initiation. We learn by becoming. The lessons are repeated again and again until our grasp of the material is secure, then new layers are added until the fuller picture emerges.",
        "citation": "LSDMU ch.9 §0 ¶3",
        "chapter_code": "9",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5376228094100952
      },
      {
        "text": "LSD generates a powerful but temporary increase in the mind’s sensitivity. Our habitual conditioning is interrupted and our field of awareness is dramatically expanded, but after a number of hours our consciousness returns to its familiar patterns. If we don’t take steps to accurately record our experiences as soon as we return, our memory of them tends to fade. What was overwhelmingly powerful one day becomes slightly dimmer the next and dimmer still a month later. Preserving the memory of our experiences as carefully as possible completes the circle of learning and lays a stronger foundation for our next session.",
        "citation": "LSDMU ch.1 §7 ¶2",
        "chapter_code": "1",
        "section_code": "7",
        "archival_title": "",
        "_score": 0.5375469923019409
      },
      {
        "text": "The more I have thought about the extraordinary range of experiences that opened on my journey, the more I have come to appreciate the complex dynamics of psychedelic disclosure. In these states, we are using consciousness to explore consciousness, and a fascinating dance takes place between the mind doing the exploring and the larger mind being explored.",
        "citation": "LSDMU ch.1 §9 ¶1",
        "chapter_code": "1",
        "section_code": "9",
        "archival_title": "",
        "_score": 0.5308008193969727
      },
      {
        "text": "The choice to work with high doses turned out to have enormous consequences for what unfolded on this journey. It radically expanded not only the *depth of consciousness* reached but also the *breadth of consciousness* being activated in each session. It wasn’t simply a matter of eating the same karmic meal in fewer bites, as I had naively thought. Because the web of life is an integrated whole from the very start, working with high doses of LSD activates wider portions of this web. Working at these levels changed not only how deep my experiences went but also who or what was actually having these experiences, what the “working unit” of experience was in a session. In these highly energized conditions, the size of the patient literally expands. What I mean by this will become clearer as we proceed.",
        "citation": "LSDMU ch.1 §5 ¶2",
        "chapter_code": "1",
        "section_code": "5",
        "archival_title": "",
        "_score": 0.5248790979385376
      },
      {
        "text": "As I have been working on LSD and the Mind of the Universe, my absorption of my psychedelic experiences has deepened in unexpected ways. They are beginning to live in me differently than before and I in them. It feels like my session memories have come together to form a greater living whole and that the inside and outside of my life are moving toward a new synthesis. There is a saying from the Navajo: “When you put a thing in order, and give it aname, and you are all in accord, it becomes.” By telling my story, by giving it aname and owning my experience, something new has been set in motion. A new peace has settled over me. At first this peace eased my existential loneliness and made the loss of communion more bearable, but then it deepened further. As I was finishing the book and beginning to speak about it publicly, a new spiritual transparency began to open in my life. It sometimes feels as though the Beloved is not waiting for me to die but is coming for me here. Where this will lead, I don’t know. It is still unfolding, taking me to new places, but surely this is the work of integration—to own, internalize, and manifest your experiences as deeply as you can. To let them flow through you and shape your presence on this Earth.",
        "citation": "LSDMU ch.12 §3 ¶5",
        "chapter_code": "12",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.5242120027542114
      },
      {
        "text": "If the ultimate goal of spiritual practice is the permanent transformation of our consciousness, then the soft underbelly of psychedelics is their temporary nature. LSD plunges us into intense spiritual exercises, holds us there for a while, and then brings us back. Clearly, we cannot stay where we have gone; it is a mistaken strategy to try to do so. We must accept these limitations and work with them. But how can we work with these temporary states in a way that will advance our permanent transformation?",
        "citation": "LSDMU ch.1 §3 ¶4",
        "chapter_code": "1",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.5234073400497437
      },
      {
        "text": "LSD unleashes such dramatically different states of awareness from anything we experience in our everyday life that we have to learn how to work with it. Like an athlete undertaking a strenuous sport, we have to train for the event. Not only do our minds have to adjust to the expanded capacities LSD awakens, so do our bodies. Our subtle energy system has to be conditioned and strengthened to sustain the enormous flows of energy evoked by the LSD state. As I look back on these early sessions, they seem to have functioned as an intensive training camp, preparing me physically and psychologically for the long journey that was beginning. They also broke me down existentially, taking me into my first death and rebirth.",
        "citation": "LSDMU ch.2 §0 ¶5",
        "chapter_code": "2",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5228065848350525
      }
    ]
  },
  "talks": {
    "queries": [
      "nature of consciousness",
      "mind of the universe",
      "cosmic consciousness",
      "nondual awareness",
      "vast mind",
      "collective mind"
    ],
    "chunks": [
      {
        "text": "ce and you only miss two or three words. Enjoy. I find him very mind-blowing—but see what you think.\nChris Bache:\n…shared in the animistic community is the belief that nature is infused with consciousness—infused with mind and soul. And, of course, now we know how vast the physical universe is, and the question becomes: how large is the mind of the universe? How deep is it?\n\nI was just out of graduate school in 1978, finishing in philosophy of religion, when I met the work of Stanislav Grof—one of the foremost thinkers in transpersonal psychology and the psychedelic community. I read his book Realms of the Human Unconscious, and my life pivoted. I immediately saw that his research was relevant not only to clinical psychology but also to philosophy. He was offering a method to safely and systematically explore the deepest levels of consciousness where the answers to the philosophical questions I was carrying lay, coming out of training in religious studies.",
        "ts_url": "https://youtu.be/3QxDjWvqKzA?t=722",
        "archival_title": "The Mind of the Universe – Conversation with Prof. Chris Bache",
        "recorded_date": "2022-02-19",
        "_score": 0.6646357774734497,
        "start_hhmmss": "00:12:02"
      },
      {
        "text": "f the evolution and ecology of consciousness? Where might we focus our intentions on a path forward?\nChris Bache\nAbout halfway through my journey, in the 38th session, in a year of enormous blessings, I was taken on an experience preceded by very intense purification—very intense death-rebirth processes. At one phase in this journey, I experienced all my former lives coming into me. I had done past-life therapy before. I was familiar with about a dozen of my past lives, and I’d already written a book on reincarnation, so I was comfortable with the idea. But this was different: my former lives began coming into me like winding a string on a kite spool. They hit a critical mass and fused. There was an explosion of energy, and all these separate lives fused into one life. A burst of diamond light came out of my chest, and I was catapulted into a state of consciousness beyond anything I had realized up to that time. I was an individual, but an individual beyond any frame of reference I had known. Then I was given a lot of teachings, over and over again, so I would understand what was happening. It changed my understanding of how reincarnation works and where it’s taking us.",
        "ts_url": "https://youtu.be/I1n2E46S-4E?t=4795",
        "archival_title": "What 73 high dose LSD sessions taught Christopher Bache PhD about the nature of reality (Rebroadcast)",
        "recorded_date": "2024-09-24",
        "_score": 0.6575281620025635,
        "start_hhmmss": "01:19:55"
      },
      {
        "text": "I’m not sure everyone can track with you there—the universe has a mind? Tell us what you discovered.\nChris Bache\nAs I came to experience it, consciousness is like an infinite ocean. When we open ourselves in deep psychedelic states, it’s as if our mind is a seed-catalyst dropped into this ocean, and it crystallizes a set of experiences out of this infinite potential. By absorbing and internalizing what we’re being offered—what we’re being taught—we’re changed, purified, transformed inwardly. Then, when we drop that changed mind back into the infinite potential, it triggers an even deeper set of experiences from its infinity.\n\nI experienced myself as engaging an intelligence—a consciousness—that was directing my sessions. I did not control what was unfolding. I was always yielding and following a lead that came from deeper levels of consciousness. As the journey continued, the levels of consciousness I was entering deepened multiple times.",
        "ts_url": "https://youtu.be/mG1uyBw0ucg?t=288",
        "archival_title": "Diamonds from Heaven: Exploring the Mind of the Universe",
        "recorded_date": "2023-07-12",
        "_score": 0.6501778364181519,
        "start_hhmmss": "00:04:48"
      },
      {
        "text": "d without psychedelics? How can one remember past lives? Maybe starting with: what is consciousness?\nChris Bache:\nI’m happy to let psychologists and philosophers tear their hair out on that one. I’ll go with whatever definition they come up with as long as it’s sufficiently broad to incorporate the total phenomenology of consciousness. Simply, consciousness comes from “con” + “scire”—to know. Consciousness is that with which we know—the knowing function, the awareness through which we know anything else.",
        "ts_url": "https://youtu.be/FlHqinHyt9I?t=1051",
        "archival_title": "Diamond Luminosity (live stream)",
        "recorded_date": "2025-05-18",
        "_score": 0.6424315571784973,
        "start_hhmmss": "00:17:31"
      },
      {
        "text": "---\narchivaltitle: \"Prof. Dr. Christopher Bache about his work and consciousness\"\nchannel: \"ECR - Existential Consciousness Research Institute\"\npublished: 2020-01-10\nyoutubeid: \"QaBoLNV4FQI\"\ntranscriber: \"gpt5 model by OpenAI (edited from Otter.ai first-pass transcript)\"\ntranscriptiondate: 2025-09-30\nlicense: \"CC0 1.0 Universal (Public Domain Dedication)\"\nspeakers: [\"Chris Bache\"]\n---",
        "ts_url": "https://youtu.be/QaBoLNV4FQI?t=20",
        "archival_title": "Prof. Dr. Christopher Bache about his work and consciousness",
        "recorded_date": "2020-01-10",
        "_score": 0.6415615081787109,
        "start_hhmmss": "00:00:20"
      },
      {
        "text": "d in those first 20 years.\n\nEmmy Vadnais:\nSo you feel like you’re still integrating the experiences?\nChris Bache:\nVery much so. It raises substantial intellectual questions: how do you possibly integrate experiences that so radically transcend the conditions of time and space and our consciousness inside time and space? If you have temporary experiences that go radically beyond spatial consciousness and linear time, what does it even mean to integrate them? What does integration look like when you’re dealing with such radical experiences? With lower-dose work or gentler psychedelics, where experiences come closer to your world inside time and space, integration is less demanding. But if you really open the very deep waters of the psyche, integration becomes a more substantive issue.\n\nEmmy Vadnais:\nWe’re getting lots of questions. This one from Robert Bushman might be a good place to start: What is consciousness? Is there an ultimate reality, or is it infinitely fractal? How can an individual’s conscious awareness expand without psychedelics? How can one remember past lives? Maybe starting with: what is consciousness?",
        "ts_url": "https://youtu.be/FlHqinHyt9I?t=951",
        "archival_title": "Diamond Luminosity (live stream)",
        "recorded_date": "2025-05-18",
        "_score": 0.6356089115142822,
        "start_hhmmss": "00:15:51"
      },
      {
        "text": "of the evolution and ecology of consciousness—where we might focus our intentions on a path forward.\nChris Bache:\nAbout halfway through my journey, in the 38th session, in a year of great blessings—just enormous blessings—I was taken into an experience preceded by very intense purification processes, a very intense death-rebirth process. At one phase, I had the experience of all my former lives coming into me. I had done past-life therapy before and was familiar with about a dozen of my past lives. I’d already written the book on reincarnation, so I was comfortable with the idea. But I began to experience my former lives coming into me like winding a string on a kite spool. They seemed to hit a critical mass, and when they did, they fused. There was an explosion of energy and all these separate lives fused into one life. There was an explosion of diamond light out of my chest, and I was catapulted into a state of consciousness beyond anything I had realized up to that time. I was an individual, but an individual beyond any frame of reference I had known. I was then given a whole lot of teachings, over and over again, so I would understand what was happening. It changed my whole understanding of how reincarnation works and where it’s taking us.",
        "ts_url": "https://youtu.be/AyMBQMGaIeA?t=4795",
        "archival_title": "What 73 High-Dose LSD Sessions Taught Christopher Bache",
        "recorded_date": "2023-12-05",
        "_score": 0.626798689365387,
        "start_hhmmss": "01:19:55"
      },
      {
        "text": "sing: surrender completely, open, breathe, receive teachings, then bring it back in and consolidate.\nEmmy Vadnais: What are some of the teachings you received?\n\nChris Bache: That the universe is a manifestation of a single consciousness—a massive consciousness beyond anything we’ve grasped in Western religious and philosophical traditions. Creation is intentional. I hesitate to use “design,” but there is an intelligence manifesting in time and space. We are part of this intelligence; our nature is of the same nature as its nature—Atman is Brahman. Reincarnation is a fact of life. We won’t get far trying to understand existence unless we understand the pulse of life—that our current life is just the most recent in many cycles of life and death. There is an underlying logic to our circumstances—what Buddhists and Hindus call karma—an intentionality working itself out in our lives. Our evolution is not driven solely by blind chance and mechanical processes; there is a deeper intelligence manifesting in our circumstances and challenges, inviting us to become more by the end of life than we were at the beginning. Those are a few touch points.",
        "ts_url": "https://youtu.be/FMgixG6Z0sk?t=1882",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "recorded_date": "2025-03-18",
        "_score": 0.6150393486022949,
        "start_hhmmss": "00:31:22"
      },
      {
        "text": "What we do with that as a species—imagine what we can do operating from that kind of consciousness.\nTasshin Fogleman:\nI’m getting the sense—coming back to what might be incomplete about Buddhism or earlier teachings—that the sensibility I received was: existence is a cycle of birth and death that is, in some ways, hellish, and you should escape. From what I’m hearing, both individually and collectively, the aim isn’t to escape but to learn, grow, evolve, increase complexity and nuance and understanding of oneself and the universe, and really to manifest that, rather than just getting out or eradicating it.\n\nChris Bache:\nYes, I think so. In the end, once we make this transition, we understand that what we have escaped is not time and space, but a constricted consciousness associated with living inside time and space. When that bubble pops—when we truly escape that small world—we experience time and space completely differently: as the Buddha world, as Buddha nature.\n\nTasshin Fogleman:\nIf you don’t mind me asking, what is your everyday consciousness like now after all of these experiences and explorations?",
        "ts_url": "https://youtu.be/FEQ8ony19sk?t=5613",
        "archival_title": "Psychedelics and Cosmological Exploration with Chris Bache – Reach Truth Podcast",
        "recorded_date": "2022-08-30",
        "_score": 0.6120991706848145,
        "start_hhmmss": "01:33:33"
      },
      {
        "text": "any insights on how psychedelics or raising consciousness might help us find a better path forward?\nChris Bache:\nLet’s hold the second part and address the first, because this was one of the biggest surprises of my work. First, I had to let go of framing my work as personal journey—personal transformation, personal healing, personal awakening—and get involved in a much larger dance with the species mind and the collective unconscious, then be catapulted into archetypal reality and deeper, causal levels.\n\nWhat I'm about to say about where we are historically will sound outrageous and highly speculative, but when you work very deeply—far underneath the personal psyche, dropping into the collective psyche and into the creative intent underlying the evolution of our species—these things come into focus in ways that make sense from a quantum or post-Newtonian paradigm.",
        "ts_url": "https://youtu.be/AyMBQMGaIeA?t=2972",
        "archival_title": "What 73 High-Dose LSD Sessions Taught Christopher Bache",
        "recorded_date": "2023-12-05",
        "_score": 0.6107869148254395,
        "start_hhmmss": "00:49:32"
      },
      {
        "text": "method is deeply interesting. Could you start by telling us what it is and what your work has been?\nChris Bache: What we share in the animistic community is the belief that nature is infused with consciousness—with mind and soul. Now that we know how vast the physical universe is, the question becomes: how large and how deep is the mind of the universe? Just out of graduate school in 1978, finishing in philosophy of religion, I encountered the work of Stanislav Grof—one of the foremost thinkers in transpersonal psychology and the psychedelic community. I read his book Realms of the Human Unconscious, and my life pivoted. I saw his research was relevant not only to clinical psychology but to philosophy: he was offering a method to safely and systematically explore the deepest levels of consciousness, where the answers to the philosophical questions I carried from religious studies might lie.",
        "ts_url": "https://youtu.be/pvZDcQfGzpM?t=49",
        "archival_title": "Diamonds From Heaven – The Mind of the Universe (Chris Bache)",
        "recorded_date": "2023-11-05",
        "_score": 0.6079192161560059,
        "start_hhmmss": "00:00:49"
      },
      {
        "text": "ience at the right time. In your journeys you describe a sense of guidance. Could you speak to that?\nChris Bache:\nI always felt myself engaging—and being engaged by—a larger consciousness. It didn’t take concrete, personified form. Its core qualities changed as I went deeper. The way I think of it: the consciousness we enter into in psychedelic states is an infinite consciousness capable of generating any number of experiences. Our mind acts as a seed crystal that catalyzes certain experiences from this infinite field.\n\nIf you do this repeatedly, as you integrate experiences and undergo purifications, your consciousness changes. The consciousness you take into the next encounter catalyzes a deeper set of experiences from the infinite potential. What you experience as a guiding intelligence arises at the intersection of your individual mind and the universal mind; as you change, that intersection changes. The guiding consciousness felt constant to me but remained formless, seldom adopting concrete form—because forms would change as the experiences deepened.",
        "ts_url": "https://youtu.be/cvhWP8xzwiY?t=867",
        "archival_title": "Exploring LSD and the Mind of the Universe",
        "recorded_date": "2023-01-05",
        "_score": 0.607349693775177,
        "start_hhmmss": "00:14:27"
      }
    ]
  }
}