{
  "book": {
    "chunks": [
      {
        "text": "Metzner is trying to walk us back from the turbulent ’60s, when 500 mcg was considered the measure of “true initiation” and Terrence McKenna was promoting “heroic dosages” for those who wanted to “really get the message.” Metzner believes that this more-is-better approach brought with it too much trauma and at the very least wasted a lot of time without yielding longlasting therapeutic gains. Better to work more slowly and be able to integrate more of what one sees. Accordingly, he recommends a therapeutic dose range for LSD between 50 and 200 mcg, essentially staying within the limits of psycholytic therapy.",
        "citation": "LSDMU ch.1 §4 ¶12",
        "chapter_code": "1",
        "section_code": "4",
        "archival_title": "",
        "_score": 0.6366240978240967
      },
      {
        "text": "In his book *Allies for Awakening*, Ralph Metzner recommends against working with doses of LSD this high. When doses are raised to this level, he says, heightened awareness flips into dissociative and/or dysphoric responses for most people. A dissociative response is one in which the individual essentially blanks out and is not able to remember or describe the experience. The experience may be pleasant, even blissful, but the person can’t bring much of it back. A dysphoric response is one in which one’s innate resistance to losing control triggers an intense struggle and possibly paranoid or schizoid reactions. The trauma of being overwhelmed overpowers any positive insights or visions one may have.",
        "citation": "LSDMU ch.1 §4 ¶11",
        "chapter_code": "1",
        "section_code": "4",
        "archival_title": "",
        "_score": 0.6282371282577515
      },
      {
        "text": "The choice to work with high doses turned out to have enormous consequences for what unfolded on this journey. It radically expanded not only the *depth of consciousness* reached but also the *breadth of consciousness* being activated in each session. It wasn’t simply a matter of eating the same karmic meal in fewer bites, as I had naively thought. Because the web of life is an integrated whole from the very start, working with high doses of LSD activates wider portions of this web. Working at these levels changed not only how deep my experiences went but also who or what was actually having these experiences, what the “working unit” of experience was in a session. In these highly energized conditions, the size of the patient literally expands. What I mean by this will become clearer as we proceed.",
        "citation": "LSDMU ch.1 §5 ¶2",
        "chapter_code": "1",
        "section_code": "5",
        "archival_title": "",
        "_score": 0.599894642829895
      },
      {
        "text": "LSD generates a powerful but temporary increase in the mind’s sensitivity. Our habitual conditioning is interrupted and our field of awareness is dramatically expanded, but after a number of hours our consciousness returns to its familiar patterns. If we don’t take steps to accurately record our experiences as soon as we return, our memory of them tends to fade. What was overwhelmingly powerful one day becomes slightly dimmer the next and dimmer still a month later. Preserving the memory of our experiences as carefully as possible completes the circle of learning and lays a stronger foundation for our next session.",
        "citation": "LSDMU ch.1 §7 ¶2",
        "chapter_code": "1",
        "section_code": "7",
        "archival_title": "",
        "_score": 0.598797082901001
      },
      {
        "text": "*LSD and the Mind of the Universe is primarily a* cosmological narrative, not a therapeutic narrative. In a therapeutic narrative, the personal details are important; in a cosmological narrative, they are less so. Of course, this entire journey was deeply personal and I own it as such, but my personal story is not the important story here, nor is it essential to the story I want to convey. It is when one moves beyond the shoals of the personal psyche and enters the ocean of the deep psyche that the larger and more philosophically interesting story begins to emerge.",
        "citation": "LSDMU ch.1 §8 ¶7",
        "chapter_code": "1",
        "section_code": "8",
        "archival_title": "",
        "_score": 0.5752112865447998
      },
      {
        "text": "In this context, I will mention that this may be one advantage of the long LSD time window compared with short-acting psychedelics like 5-MeO-DMT. LSD does not blast you through the many layers of the cosmos as quickly as 5-MeO-DMT does, but the eight-hour LSD interface invites/propels/forces a polishing of the consciousness doing the exploring as it is impacted/ instructed/healed by the consciousness being explored. An LSD session grinds slow but it grinds fine. It gives us time to be engaged and changed by the realities we are encountering. I think this polishing influences both the eventual clarity of our perception in these states and what we are able to bring back from them, both in terms of healing and understanding.",
        "citation": "LSDMU ch.1 §9 ¶4",
        "chapter_code": "1",
        "section_code": "9",
        "archival_title": "",
        "_score": 0.5715304613113403
      },
      {
        "text": "LSD unleashes such dramatically different states of awareness from anything we experience in our everyday life that we have to learn how to work with it. Like an athlete undertaking a strenuous sport, we have to train for the event. Not only do our minds have to adjust to the expanded capacities LSD awakens, so do our bodies. Our subtle energy system has to be conditioned and strengthened to sustain the enormous flows of energy evoked by the LSD state. As I look back on these early sessions, they seem to have functioned as an intensive training camp, preparing me physically and psychologically for the long journey that was beginning. They also broke me down existentially, taking me into my first death and rebirth.",
        "citation": "LSDMU ch.2 §0 ¶5",
        "chapter_code": "2",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5599075555801392
      },
      {
        "text": "Given the emphasis being placed today on the therapeutic applications of psychedelics, it may be surprising to learn that my early sessions did not involve much personal healing. There was some but not much. If I had been working with lower doses, there would probably have been more, but when you work with doses of LSD this high, you tend to drop quickly beneath the personal unconscious into what Stanislav Grof calls the perinatal level of consciousness. Instead of engaging the individual wounds we have collected in life, one goes deeper to confront a universal wound shared by all human beings—the certain destruction of everyone and everything we love and care about, including ourselves.",
        "citation": "LSDMU ch.2 §0 ¶6",
        "chapter_code": "2",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5475831031799316
      },
      {
        "text": "I initially chose to work with high doses of LSD because it was difficult to find days for inner journeying in a dual-career marriage and I simply wanted to make the most of each session. I knew that the sessions would be more challenging, but the spiritual literature I had read described one’s karmic conditioning as being ultimately finite, and I thought that I could work through mine faster by using this intense method of transformation, in effect biting off larger pieces of karma in each session. I thought that if I confronted my shadow conscientiously and could endure the intensity of the work, it would get me to my goal of personal liberation faster. Later, after this model had imploded for reasons I will give in chapter 6, I continued working with high doses because I had developed a taste for it. It took me where I wanted to go and then further than I imagined possible.",
        "citation": "LSDMU ch.1 §5 ¶1",
        "chapter_code": "1",
        "section_code": "5",
        "archival_title": "",
        "_score": 0.5380629897117615
      },
      {
        "text": "From an historical perspective, therapeutically structured LSD sessions are a modern variation of an ancient spiritual path that has been well documented by scholars. From the Eleusinian mystery rites of ancient Greece to the peyote ceremonies of Native Americans and the ayahuasca churches of present-day Brazil, human beings have been ingesting consciousness-amplifying substances for thousands of years and have all come to the same conclusion: these substances are sacraments that help us reconnect with the universe. Seen in this context, therapeutically structured LSD sessions are not an end run around spiritual practice, as some early scholars thought, but a particularly intense form of spiritual practice, with its own distinctive characteristics and challenges.",
        "citation": "LSDMU ch.1 §3 ¶2",
        "chapter_code": "1",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.5255991816520691
      },
      {
        "text": "I was never in control of what happened in my sessions. I found early on that I could set all the intentions I wanted, but when one is working with doses of LSD this high, it makes little difference. From the very beginning, a larger intelligence had been in control of my sessions. I learned that the best thing I could do was simply get out of the way and let it take me where it wanted me to go. And so it was for my last sessions. The same intelligence that had guided me all these years choreographed the ending of our time together before I even knew we were parting.",
        "citation": "LSDMU ch.11 §0 ¶3",
        "chapter_code": "11",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5178298950195312
      },
      {
        "text": "As I have been working on LSD and the Mind of the Universe, my absorption of my psychedelic experiences has deepened in unexpected ways. They are beginning to live in me differently than before and I in them. It feels like my session memories have come together to form a greater living whole and that the inside and outside of my life are moving toward a new synthesis. There is a saying from the Navajo: “When you put a thing in order, and give it aname, and you are all in accord, it becomes.” By telling my story, by giving it aname and owning my experience, something new has been set in motion. A new peace has settled over me. At first this peace eased my existential loneliness and made the loss of communion more bearable, but then it deepened further. As I was finishing the book and beginning to speak about it publicly, a new spiritual transparency began to open in my life. It sometimes feels as though the Beloved is not waiting for me to die but is coming for me here. Where this will lead, I don’t know. It is still unfolding, taking me to new places, but surely this is the work of integration—to own, internalize, and manifest your experiences as deeply as you can. To let them flow through you and shape your presence on this Earth.",
        "citation": "LSDMU ch.12 §3 ¶5",
        "chapter_code": "12",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.5104656219482422
      },
      {
        "text": "If the ultimate goal of spiritual practice is the permanent transformation of our consciousness, then the soft underbelly of psychedelics is their temporary nature. LSD plunges us into intense spiritual exercises, holds us there for a while, and then brings us back. Clearly, we cannot stay where we have gone; it is a mistaken strategy to try to do so. We must accept these limitations and work with them. But how can we work with these temporary states in a way that will advance our permanent transformation?",
        "citation": "LSDMU ch.1 §3 ¶4",
        "chapter_code": "1",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.5033961534500122
      },
      {
        "text": "In this opening chapter, I want to candidly describe how I worked with LSD and share some core observations about the psychedelic process. Even as psychedelic research resumes, there is still a great deal of misinformation and mistrust of psychedelics in our culture. By putting my cards on the table up front, I hope to create as clear a field as possible for the story that follows. Readers who are not familiar with the psychedelic literature will get a solid understanding of how this method of inquiry works, while those who know this literature well will see how I have adapted and personalized it.",
        "citation": "LSDMU ch.1 §0 ¶2",
        "chapter_code": "1",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5033276081085205
      },
      {
        "text": "By this time, I was a seasoned journeyer. I knew how my system responded to LSD, and I had a solid sense of the size and shape of my psychedelic window. On this day, however, my window opened wider and stayed open longer than it ever had before. In my session notes, I wrote:",
        "citation": "LSDMU ch.10 §3 ¶3",
        "chapter_code": "10",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.4980022609233856
      },
      {
        "text": "While the issue of set and setting has been much discussed in the psychedelic literature, I find less attention being paid to the issue of systematic recall after a session has ended. I don’t know why this is the case because I have found that making an accurate record of each session can pose a significant challenge. This may be because of the high doses I was working with, but I think it represents a larger issue as well.",
        "citation": "LSDMU ch.1 §7 ¶1",
        "chapter_code": "1",
        "section_code": "7",
        "archival_title": "",
        "_score": 0.4977431297302246
      },
      {
        "text": "I have asked myself this question many times over the years, responding differently at different stages of my journey, sometimes cursing the day I started this work but more often on my knees in gratitude. It is a pressing question, especially if one works with high doses of a powerful psychedelic like LSD, for this protocol unleashes more extreme experiences than when lower doses or milder psychedelics are used. For the time being, let me say just this.",
        "citation": "LSDMU ch.8 §1 ¶45",
        "chapter_code": "8",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.494743287563324
      },
      {
        "text": "I’ve never dropped acid and gone to a concert, never spent the night tripping with friends. When I took LSD on these seventy-three days, I entered a carefully constructed space dedicated to self-transformation. I was isolated from the outside world, in my home or my wife’s private office, and protected from all interruptions. I was lying down on a mattress on the floor, surrounded by cushions, and wearing eyeshades and headphones. The music was carefully selected to support the stages of opening and closing—gentle music as the drug comes on, powerful evocative music as it builds momentum, expansive music for the peak hours, and gentle music for the long, slow return.",
        "citation": "LSDMU ch.1 §1 ¶1",
        "chapter_code": "1",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.49238842725753784
      }
    ]
  },
  "talks": {
    "chunks": [
      {
        "text": "it during the course of these experiences as part of integration, or was it reflection looking back?\nChris Bache:\nReflection looking back. All my sessions were recorded within 24 hours. I had about 400 pages of notes, which I studied, blocked, took apart, reassembled, diagrammed in different ways. It took years to piece together the storyline—and decide what to leave out and what to include. I left out a lot of the personal healings and small personal things because those weren’t the important parts for this book. Everyone has a personal story; as a philosopher, the story becomes interesting when the process takes you beyond the personal psyche into the deep waters of the psyche.",
        "ts_url": "https://www.inbodiedlife.com/blog/chris-bache",
        "archival_title": "Learning to be Gods: Conversations about LSD and the Mind of the Universe with Chris Bache",
        "recorded_date": "2023-06-30",
        "start_hhmmss": "00:57:51",
        "_score": 0.5889891982078552
      },
      {
        "text": "ally that model shattered when I realized the sessions went far beyond my personal psyche and karma.\nJef Baker:\nWas that at the point of the “ocean of suffering,” when you experienced the collective human pain throughout history? That was honestly hard to read.\n\nChris Bache:\nYes. I had to think carefully about how much to expose, because it’s challenging material. But to finish that earlier point, even after I let go of the personal model, I found I liked where the high-dose work took me. It took me farther than I imagined, and I developed a taste for it. I don’t recommend that protocol. I’d do it differently now—be gentler, balance high-dose with low-dose work, and balance LSD with psilocybin, ayahuasca, more organic psychedelics. I started in ’79 and did the work between 1979 and 1999, from age 30 to 50. At the time, I pushed myself harder than I’d recommend. It’s not necessary.\n\nJef Baker:\nIn the book you acknowledge that too, which is good.",
        "ts_url": "https://youtu.be/B0BhUOEP1Mg?t=529",
        "archival_title": "Bicycle Day Conversation with Jef Baker",
        "recorded_date": "2020-04-19",
        "start_hhmmss": "00:08:49",
        "_score": 0.5666027069091797
      },
      {
        "text": "see if I got it right. Welcome to the people who are live and those who are going to join us later.\nChris Bache—the story I know is that he is now a retired professor of religious studies and philosophy from Ohio State University and Youngstown, Ohio. Early in his career he was always interested in mysticism and deep spiritual exploration, and he came upon the work of the legendary psychiatrist Stanislav Grof, who pioneered a protocol for working with high doses of LSD in particular. Chris undertook what turned out to be a 20-year journey of 73 high-dose LSD sessions following the Stan Grof protocol—sessions using 500 to 600 micrograms of LSD, which, for any of you not familiar with that calculation, is a high dose. The protocol involves working at home or in a safe, quiet space with headphones and a carefully curated playlist, eyeshades to block out the light so inner visions aren’t obstructed, and a qualified sitter. In Chris’s case, the sitter was a therapist who knew what she was doing. Generally, he did this on a Saturday, and the following day—again following the Grof protocol—he spent basically the whole day with the headphones on to trigger memories of what was playing when certain experiences and visions occurred, and then meticulously transcribed all that.",
        "ts_url": "https://youtu.be/9jsKPUwwqfQ?t=133",
        "archival_title": "Philosophical Implications of Non-Ordinary States (live)",
        "recorded_date": "2024-09-24",
        "start_hhmmss": "00:02:13",
        "_score": 0.5639901757240295
      },
      {
        "text": "topher Bache, welcome back to the show.\n\nChris Bache\nHi Sandy. It's a pleasure to be with you today.\nSandy Sedgbeer\nYou too. So Life Cycles has been hailed as the first book to both describe the dynamics of rebirth and explore the ramifications of adopting a reincarnationist perspective. Now, this was published, what, about 35 years ago?\n\nChris Bache\nThereabouts. I started my psychedelic work after my first year as an academic. I worked for four years, then stopped for six. During that six-year interval, I did three years of past-life therapy, uncovering and working with my own former lives, and I wrote Life Cycles. By then my psychedelic work had gone deep enough to give me personal insights into karma—the deeper cause-and-effect that underlies our lives. I hadn’t yet had former-life experiences in a psychedelic context, though I had in hypnotherapy. The real foundation for Life Cycles was studying Ian Stevenson and later other pioneers documenting children and adults with validated past-life memories.",
        "ts_url": "https://youtu.be/-Tavh3KhQPE?t=92",
        "archival_title": "Reincarnation and the Web of Life (What Is Going OM)",
        "recorded_date": "2024-11-07",
        "start_hhmmss": "00:01:32",
        "_score": 0.5495738387107849
      },
      {
        "text": "orced since first experiencing it in the late 1990s, to the writing of the book, to the present day?\nChris Bache: It hasn't changed one bit. I say in the book that when I had the experience in session 55—the death and rebirth of humanity in 1995—for weeks I walked around like I was walking around Hiroshima a week before the bomb went off. I have carried in my being, in my body, a knowing of where we are in history and what's coming.\n\nWhen I look around, whether I agree with people politically or socially or not, I see heroes. I see every human being here on this planet as having incarnated voluntarily, choosing to be part of this evolutionary pivot. Every person here—even though they may not remember it—has chosen to be here, and this is going to be a very difficult period to incarnate. The beings who are part of the incarnation process are extraordinarily powerful, valuable beings.",
        "ts_url": "https://youtu.be/icBasHgjzsY?t=4772",
        "archival_title": "LSD and the Mind of the Universe – Christopher Bache, Ph.D.",
        "recorded_date": "2021-06-03",
        "start_hhmmss": "01:19:32",
        "_score": 0.539502739906311
      },
      {
        "text": "mmy Vadnais: What was the impetus for you to embark on this deep exploration with high doses of LSD?\nChris Bache: I had just finished graduate school and started my academic career. I was then a fairly convinced, atheistically inclined agnostic. Then I encountered two people’s work: Ian Stevenson, whose research on reincarnation convinced me it was a simple fact of life; and Stanislav Grof. I read Grof’s Realms of the Human Unconscious in 1978, two years after it came out. I recognized it had tremendous significance not only for psychotherapy but for philosophy of religion and consciousness. I knew that if I was going to make a contribution in this field, I had to undergo my own therapeutic exploration. Very uncomfortably, I decided to break the law in what I hoped was a disciplined, restrained way and began a series of sessions that, much to my surprise, lasted 20 years. I worked for four years, stopped for six, then worked another 10, finishing in 1999. I spent the next 20 years digesting, analyzing, sifting, and sorting these experiences, and then wrote LSD and the Mind of the Universe in 2019, 20 years after I stopped my sessions.",
        "ts_url": "https://youtu.be/FMgixG6Z0sk?t=485",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "recorded_date": "2025-03-18",
        "start_hhmmss": "00:08:05",
        "_score": 0.5387901663780212
      },
      {
        "text": "cosmological exploration? And how might someone structure them if they’re aimed at the other goals?\nChris Bache:\nI didn’t understand much of this at the time; I understood it only after going a long way down the road and looking back at how my choices affected the trajectory. The dose decision is significant. Working with high doses, you completely surrender to the process. It’s impossible to direct it. You can set all the good intentions you want, but the states that arise with high doses, amplified by carefully selected music and internalization in a kiva-like practice, set in motion processes so powerful you can’t control them. The strategy is to surrender—let consciousness take you wherever it wants, show you whatever it wants, no matter how inscrutable, painful, or absurd it seems at the time.",
        "ts_url": "https://youtu.be/FEQ8ony19sk?t=1178",
        "archival_title": "Psychedelics and Cosmological Exploration with Chris Bache – Reach Truth Podcast",
        "recorded_date": "2022-08-30",
        "start_hhmmss": "00:19:38",
        "_score": 0.5362042188644409
      },
      {
        "text": "he is challenging. You’ve also said it took you 10 years to digest what you experienced in the ’90s.\nChris Bache:\nWhen I stopped my work in ’99, I thought that, having been given so many gifts, I could simply withdraw and nourish myself by continuing to digest and assimilate them. That was true—but only half the truth. The other half was confronting the tremendous sense of loss I had from not being able to enter this deeply into communion with the universe. There was a real loss of communion because I couldn’t sustain it in my daily life. Some beings can—the great masters of meditation have always been my heroes—and they hold these experiences in an abiding way. That wasn’t the case for me. It took me about 10 years to get over my sense of loss and to recommit to being who I was, where I was, for the remainder of my life, and do as much as I could with that time.",
        "ts_url": "https://www.inbodiedlife.com/blog/chris-bache",
        "archival_title": "Learning to be Gods: Conversations about LSD and the Mind of the Universe with Chris Bache",
        "recorded_date": "2023-06-30",
        "start_hhmmss": "00:45:54",
        "_score": 0.535686194896698
      },
      {
        "text": "things, and the only way was to teach me how to stay conscious in these unusual temporal modalities.\nThe last of what I consider the great visions took place in the 70th session, after one of the most extreme strip-downs I went through. It moved me into the most radical deep time in all my sessions. After this vision, the universe essentially wrapped things up over the next three sessions. That dominant vision took me far into humanity’s evolutionary future.\n\nJef Baker: What insights did that window of deep time give you about our future direction?\n\nChris Bache: Starting around the 23rd session, and then in a punctuated way over the years, the universe kept giving me teachings about the human story—what you might call the master story. I don’t mean that arrogantly; it’s simply what kept coming. It emphasized we were approaching a crescendo—a true turning point, a before-and-after in our evolutionary journey. After thousands and hundreds of thousands of years of struggling—in a reincarnational framework, which I accept—the message was that humanity was coming to a decisive pivot in its larger story.",
        "ts_url": "https://youtu.be/B0BhUOEP1Mg?t=2879",
        "archival_title": "Bicycle Day Conversation with Jef Baker",
        "recorded_date": "2020-04-19",
        "start_hhmmss": "00:47:59",
        "_score": 0.5349046587944031
      },
      {
        "text": "m the usual “Who am I, what am I” type questions. These must have been working in you for some time.\nChris Bache:\nFor a time, yes. There were two people I met my first year of teaching. One was Ian Stevenson and his work on reincarnation research, which opened up a whole new world for me. I finished graduate school as an atheistically inclined agnostic. Ian Stevenson opened up reincarnation. Stan Grof opened up the opportunity to actually experience deeper dimensions of consciousness, and by entering those dimensions, to experience deeper dimensions of existence itself. That felt like the opportunity of a lifetime—what philosopher wouldn’t want to do that? The problem, of course, was that this was 1978, and the substances had been made illegal in the United States. The first generation of work was over, and we were forty years away from the renaissance of psychedelics that's taking place now. So I made a difficult choice—I decided to split my life. In my public life, I was a university professor: I taught, published, served on committees. In my private life, I began a private, twenty-year journey using Grof’s methods—high-dose LSD therapy, seventy-three sessions over twenty years. I worked for four years, stopped for six, and then worked very intensely for ten years. So overall, from 1979 to 1999, I did this work. But because it was illegal, if I had talked about it, I would have lost my job. I had to keep quiet about it, and it wasn't until after I retired, and after the statute of limitations had passed—because I don’t do this work now—that I was finally able to talk openly about what one can learn about consciousness and the universe by following this particular method of exploration.",
        "ts_url": "https://youtu.be/yewNM9smrqo?t=168",
        "archival_title": "Diamonds from Heaven – Interview with Iain McNay",
        "recorded_date": "2018-07-05",
        "start_hhmmss": "00:02:48",
        "_score": 0.5338587164878845
      },
      {
        "text": "but first, could you share the protocol you followed and what the path looked like as it went along?\nChris Bache:\nI was just out of graduate school in 1978 when I read Stan Grof’s first book, Realms of the Human Unconscious, published in 1976. I immediately recognized the significance of Stan’s work for my discipline, philosophy of religion. I’m not a psychologist or therapist and was never particularly interested in therapeutic applications as Stan was; I was drawn to the philosophical implications.\n\nRecognizing a call, I began work that lasted 20 years—four years of very intense work, a six-year hiatus, then another 10 years of intense work. I chose high doses of LSD—500 to 600 micrograms. I don’t recommend this today, and if I were doing it over, I’d be gentler: lower doses and a wider spectrum of psychedelics. I chose LSD because it was the substance Stan had done most of his research on, and I trusted that research. This was 1978—pre-Ayahuasca, before the broader appreciation of organic psychedelics used in shamanic traditions.",
        "ts_url": "https://youtu.be/cvhWP8xzwiY?t=192",
        "archival_title": "Exploring LSD and the Mind of the Universe",
        "recorded_date": "2023-01-05",
        "start_hhmmss": "00:03:12",
        "_score": 0.5286866426467896
      },
      {
        "text": "er body of data that can expand our understanding of our life in this universe. Thank you very much.\nChris Bache: Okay, that brings us back. Brings us back.\n\nDottie Koontz: Excellent.\n\nChris Bache: I had fun sharing this. It brings back a lot of memories. My thinking on reincarnation has evolved beyond where it was when I wrote Life Cycles. I opened a deeper level in Dark Net Early Dawn when I began bringing in the psychedelic experience, and then in LSD in the Mind of the Universe I offer my most expanded understanding, with the concept of the birth of the diamond soul in history. But it all begins with the question: do we have good, reliable evidence that any hard-nosed skeptic should endorse, whether or not they do? Dottie has a core bibliography she’ll send out—names, places, books I mentioned, plus more. The floor is open.",
        "ts_url": "https://youtu.be/iCKq7-de8Xg?t=2412",
        "archival_title": "The Evidence for Reincarnation",
        "recorded_date": "2024-11-16",
        "start_hhmmss": "00:40:12",
        "_score": 0.5282033085823059
      },
      {
        "text": "ls. You must have ways into that, if people wanted to. Is it just not worth their career to do that?\nChris Bache\nOne of the things I decided early on was not to try to address the reservations—abundantly clear to me—coming out of the traditional academic mindset. I decided that if I tried to justify the method and the experiences to my colleagues, it would hamper me. I decided to push deeply ahead and let the chips fall where they may. I understand how exotic, how strange my claims sound to people raised and educated in a traditional environment, and I've decided to let that go and let history sort things out. I'm acutely aware that I'm writing not for my present generation; I'm writing for future generations. Paradigm changes take place in an evolutionary context, so I'm just doing the work and letting other people sort out what they think it's worth.",
        "ts_url": "https://youtu.be/q-caGhIlKS8?t=1608",
        "archival_title": "The Phoenix Always Rises: Evolving into the Future Human",
        "recorded_date": "2025-01-08",
        "start_hhmmss": "00:26:48",
        "_score": 0.5262349843978882
      },
      {
        "text": "of this has karma embedded in it. Tell us what you learned about the essence of karma at that time.\nChris Bache:\nAs a professor of religious studies, I had an intellectual understanding of karma: cause and effect generated by choices. There are physical and psychological cause-effect processes. In karmic thought, every choice sets in motion events whose consequences we eventually receive. By receiving the effects, we learn and make new choices. Session 15 wasn’t theoretical; it was being shown the karma of my particular life. For a year—seven sessions—I experienced the entirety of my life, from beginning to end, as a complete totality. This was my first entry into what I call deep time. In that context, when I looked at relationships and professional issues, I saw how deeply embedded they were in karmic causal processes—that my position in history wasn’t accidental, the people around me weren’t accidental. It was a meaningful fabric. The question then became: how do you respond most effectively to the meaningful fabric your life is part of?",
        "ts_url": "https://youtu.be/S4XSaHn54P4?t=905",
        "archival_title": "73 Trips: Inside the Psychedelic Universe",
        "recorded_date": "2023-11-06",
        "start_hhmmss": "00:15:05",
        "_score": 0.5241649746894836
      },
      {
        "text": "ide down. This—time and space—is where the hard work is done. Spiritual reality is home; it’s light.\nRyan Kemp:\nHave you been tempted in these later years to go back? You’ll know Aldous Huxley, on his deathbed, had LSD and was read the Tibetan Book of the Dead. Have you been tempted to do a high-dose session all these years later? It’s been about twenty years, hasn’t it?\n\nChris Bache:\nActually, he was injected with two very low doses—Laura Huxley discusses this in her autobiography. I’ve done low-dose LSD sessions since I stopped, and I’ve had wonderful experiences, but generally it doesn’t work well with me now. I pushed my system so hard with high doses that it’s as if I’ve developed an allergy. If I took a massive dose today, I wouldn’t be able to get back to where I was journeying in the last years of my work.",
        "ts_url": "https://youtu.be/Dw7D7ih8vy0?t=5961",
        "archival_title": "EP.6 - Chris Bache | LSD AND THE MIND OF THE UNIVERSE",
        "recorded_date": "2020-05-13",
        "start_hhmmss": "01:39:21",
        "_score": 0.5229378938674927
      },
      {
        "text": ",” where I argue why these experiences are trustworthy, drawing on Ken Ring’s and Ken Wilber’s work.\nAll my work has come from this psychedelic journey: my first book on reincarnation, the second on trend in psychedelic theory, and The Living Classroom, which is coming out in a new edition now because they wanted psychedelics woven into the story. I had kept psychedelics out of The Living Classroom, but the truth is my students—who knew nothing about my psychedelic work—began to be impacted by it, and I had to learn a new way of teaching, developing what I call a quantum pedagogy. That’s the story, and I’ll stop here.\n\nTom Habib\nWe have a couple of questions before we go to breakout. One relates to your comments about the time period we’re in and the shift that’s occurring. It echoes Jean Gebser’s writing—and, in a different way, Nora Bateson’s questioning of stage models. Can you relate your experiences to Gebser’s view?\n\nChris Bache\nI’ll make it easy for you: Gebser is one of those thinkers I know I should read and I haven’t, so there’s zero direct influence. Others will have to make those correlations.",
        "ts_url": "https://youtu.be/Ucgt6vNpCDI?t=3755",
        "archival_title": "LSD and the Mind of the Universe: Diamonds from Heaven (SDI Meeting)",
        "recorded_date": "2024-02-10",
        "start_hhmmss": "01:02:35",
        "_score": 0.5200509428977966
      },
      {
        "text": "f these high-dose experiences, or did it emerge as you processed them afterward? That’s a big shift.\nChris Bache\nIt was a big shift, and it’s a little of both, but probably the most important part came after the sessions, as I processed and worked through them. It took years. I kept trying to fit it into Stan Grof’s paradigm and the other paradigms available at the time—which always focused on healing or enlightening the individual. I wrote Dark Night, Early Dawn largely to answer the question, \"Why did suffering get so large in my psychedelic sessions?\" Eventually, that led me beyond the person-centered model to a collective one. My thinking has evolved since then, but that’s where the jump happened. I started the work in ’79 and wrote the book in ’95–’96, about 15 years into the process. So it took more than ten years for me to really accept and understand that idea. Once I did, a lot of other things began to make sense—how, at the collective level, after going through that “ocean of suffering”—which lasted two years—and experiencing the associated death and rebirth that led me into deeper archetypal reality, I had many experiences showing me how the species mind is alive within all our individual, fractally embedded minds; how each individual mind feeds into the collective, as Rupert Sheldrake describes, and the collective feeds back into the individual. It's a constant feedback system. Intellectually, it was integrating Rupert's morphic field theory with Stan Grof's paradigm that gave me the permission to make this radical reinterpretation...",
        "ts_url": "https://youtu.be/SIjZypJKSFM?t=4674",
        "archival_title": "Michael Pollan and Chris Bache – Buddha at the Gas Pump Interview",
        "recorded_date": "2019-05-15",
        "start_hhmmss": "01:17:54",
        "_score": 0.5178648233413696
      },
      {
        "text": "that path for this deep dive? And what sage advice would you offer anyone hearing what you’ve done?\nChris Bache:\nTo start at the end, my advice is: please don’t do it the way I did. I was young and foolish. I understand much more now, and I’d advise a different protocol.\n\nHow I got into this is straightforward. I came out of graduate school an atheistically inclined agnostic in philosophy of religion, with a lifelong passion to ask the big questions—why life is filled with suffering, whether there’s an intelligence expressing itself in the universe. Right after grad school I encountered Stan Grof’s work. Realms of the Human Unconscious changed my life, followed quickly by his 1980 manual, LSD Psychotherapy. I knew I wanted—needed—to do this work. I don’t like breaking the law, but I did. I went underground as part of the transitional underground generation and started high-dose work.",
        "ts_url": "https://youtu.be/9jsKPUwwqfQ?t=2609",
        "archival_title": "Philosophical Implications of Non-Ordinary States (live)",
        "recorded_date": "2024-09-24",
        "start_hhmmss": "00:43:29",
        "_score": 0.517273485660553
      },
      {
        "text": "this story? Maybe we can start with psychedelics—how did psychedelics come on your radar initially?\nChris Bache\nI had just finished graduate school, was publishing a few articles out of my dissertation, and looking for where to take my research. I was a brand-new university professor when I met the work of Stanislav Grof, and that snapped my head to attention. I did not have a psychedelic history. I finished graduate school in religious studies as a pretty deeply convinced, atheistically inclined agnostic. But I read Stan’s work and a light bulb went off. I said, this is important—not just to psychology, but to philosophy of religion, which was my training. I wanted to get involved, but it had been made illegal. So I split my life. In my day job, I functioned as a professor of religious studies, teaching conventional or semi-conventional courses. And I began what eventually became a 20-year journey working with LSD, following Stan’s paradigm and then pushing the limits of that paradigm much farther than I appreciated at the time. Trained in philosophy of religion, I kept careful records and notes, trying to make the engagement as clean and productive as possible. I knew there would come a time to share the insights with a broader audience. After I retired from the university, that time finally came.",
        "ts_url": "https://youtu.be/CbgJkCoee3w?t=471",
        "archival_title": "LSD and the Mind of the Universe: Diamonds from Heaven",
        "recorded_date": "2020-01-07",
        "start_hhmmss": "00:07:51",
        "_score": 0.5166574716567993
      }
    ]
  },
  "meta": {
    "date": "2025-10-22"
  }
}