{
  "meta": {
    "qid": "feminine-divine-cosmic-birth",
    "title": "The Feminine Divine and Cosmic Birth",
    "date": "2025-10-22",
    "version": "v1",
    "source_policy": "Book-first. Public transcripts as color with timestamped links."
  },
  "book": {
    "chunks": [
      {
        "text": "ently traveled.\n\nJef Baker: It’s interesting that you also note perceiving the universe as feminine.\nChris Bache: For two reasons I discuss in the book. First, the tremendous love the universe awakened in me—the deep heart-opening and passionate love that took me in—had a feminine quality. Second, a specific cosmology emerged in my sessions that surprised me; it wasn’t one I’d internalized from my reading. I was taken back to the beginning of creation—before the Big Bang—and experienced the universe emerging out of a primal oneness which becomes two, yin and yang. Out of that primal two, one consciousness remained outside time and space, intact, while the other entered time and space and manifested everything that has evolved since the Big Bang. The consciousness that stayed outside felt more “masculine,” and the consciousness that created felt more “feminine.” It was congruent with my repeated experience of the universe as more feminine than masculine. The Great Mother lineage is very strong in me; I’ve always felt deeply connected to it.\n\nJef Baker: As in many cultures around the world, the Earth is the Great Mother.",
        "citation": "Bache · 2020-04-19 · Australian Psychedelic Society · Bicycle Day Conversation with Jef Baker",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Bicycle Day Conversation with Jef Baker",
        "_score": 0.6383877992630005
      },
      {
        "text": "t putting a chemical into my body; I’m opening myself to the field of humanity’s experience with it.\nLSD is comparatively new—only a few decades old. The ’60s and ’70s are nothing compared to the millennia human beings have worked with ayahuasca. I’ve always experienced LSD as a very clean substance in that sense, without a lot of cultural baggage, at least used the way I did. It repeatedly shattered me—dissolving my consciousness again and again into deeper levels—and took me into territory that felt fresh from an evolutionary perspective. There were places that didn’t feel like many human footprints had landed. I don’t have that experience with psilocybin or ayahuasca; those territories feel more frequently traveled.\n\nJef Baker: It’s interesting that you also note perceiving the universe as feminine.",
        "citation": "Bache · 2020-04-19 · Australian Psychedelic Society · Bicycle Day Conversation with Jef Baker",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Bicycle Day Conversation with Jef Baker",
        "_score": 0.6176769733428955
      },
      {
        "text": "on, deep meditation, or psychedelic journeying. Feel free to share some of your experiences in that.\nChris Bache: Well, I’ve done that as carefully as I can in my book, LSD in the Mind of the Universe. The invitation is to appreciate that we only became conscious of the Mother Universe about 5,000 years ago—when we developed sufficient discipline to drop beneath the conditioning of our individual egoic mind and tap into the stream of consciousness we share with all life. We’ve been walking upright for 5.8 million years, operating with our larger brain for about 200,000 years. Writing came in about 5,000 years ago; the Upanishadic breakthroughs, three to four thousand years ago. But these are nothing compared to the billions of years ahead. We’re just waking up to who we are, so naturally we get confused given the enormity of what we’re growing into.",
        "citation": "Bache · 2021-03-16 · Gene Keys · Contemplating Reincarnation – Part 2",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Contemplating Reincarnation – Part 2",
        "_score": 0.6134809255599976
      },
      {
        "text": "of the cosmic process integrating and interpenetrating, liberating each other from their loneliness.\nChris Bache:\nI want to be careful and remind us that a finite mind does its best to give cognitive structure to transcendent experiences. What I’m about to describe is a heuristic: a splitting of the divine principle into two halves—a “male” half that stays outside time and space in a transcendent position, and a “female” half that manifests time and space and the physical cosmos. I don’t literally think in male/female terms, but this is the best my mind could do. The principle is what matters: not all creative intelligence manifests as physical reality. Some holds position outside physical reality. There is a spiritual reality that gives birth to physical reality.",
        "citation": "Bache · 2023-01-27 · Portals of Perception · The Mind of the Universe: Diamonds from Heaven",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "The Mind of the Universe: Diamonds from Heaven",
        "_score": 0.60487961769104
      },
      {
        "text": "s (the One); and Diamond Luminosity. That’s the structure I used to tell the travelogue in the book.\nAt the personal mind level—Chapter 2, “Crossing the Boundary of Birth and Death”—this was classic perinatal death‑rebirth. I felt like a poster boy for Stan Grof’s description: intense convulsions, confrontations with the meaninglessness and limits of life. Over two years and ten sessions, the universe snapped me like a twig by forcing me to become the exact opposite of everything I knew myself to be. I entered as a white male academic, passionately interested in the meaning of life. I became the exact opposite—hundreds of women, women of color, women with no interest in philosophical inquiry. It was terrifying. When I finally surrendered, I was flipped into the positive side of women’s experiences and taken on an extraordinary journey under the arm of the Great Mother.",
        "citation": "Bache · 2021-06-03 · Portland Psychedelic Society · LSD and the Mind of the Universe – Christopher Bache, Ph.D.",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD and the Mind of the Universe – Christopher Bache, Ph.D.",
        "_score": 0.6037919521331787
      },
      {
        "text": "eally look forward to sharing the experiences I report in my book, LSD and the Mind of the Universe.\nDavid has framed our conversation as the question of whether we can all access the cosmic mind using psychedelics. I believe that we all can, but whether we all should is another matter entirely. In contrast to the early idea that psychedelics represent a shortcut to mystical experience, my concern is that the psychedelic journey into the cosmic mind is extremely demanding and must be approached with great care and caution.\n\nIn LSD and the Mind of the Universe, I describe experiences that opened in 73 high-dose LSD sessions conducted over 20 years when I was a young man between 30 and 50 years old, from 1979 to 1999. I then spent another 20 years thinking about these experiences, digesting them, mapping them, and pondering their implications. I hope the visions I brought back will be useful not only to other psychonauts but also to those who would never take a psychedelic themselves. What’s important is the vision of the cosmos they contain, and a vision of where humanity is in its long evolutionary journey and the turning point we’re coming to.",
        "citation": "Bache · 2022-12-07 · Scientific & Medical Network · LSD & the Mind of the Universe (SMN webinar)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD & the Mind of the Universe (SMN webinar)",
        "_score": 0.593608558177948
      },
      {
        "text": "osophy of religion, not just for psychology, and I knew I wanted to get involved in doing this work.\nSo even though LSD had been made illegal in 1970, I chose to conscientiously break the law and begin a series of rigorously structured sessions following Stan’s protocol. After three medium-dose sessions, I chose to work at high doses. This is a protocol I don’t recommend today. I would be much gentler on myself if I were doing it over again, but at the time this is what I was doing to accelerate my own spiritual development. Quickly it evolved into engaging the deep structures of human evolution and trying to support humanity’s spiritual development, and then exploring this marvelous universe that we are part of.\n\nTami Simon\nYou write toward the beginning of the book, “In the end, what’s important is not the method of exploration used, but what this method shows us about the extraordinary universe we live in.” That’s what I want to focus on—really the discoveries that you made. Let’s start with the title: LSD and the Mind of the Universe. I’m not sure everyone can track with you there—the universe has a mind? Tell us what you discovered.",
        "citation": "Bache · 2023-07-12 · Sounds True · Diamonds from Heaven: Exploring the Mind of the Universe",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Diamonds from Heaven: Exploring the Mind of the Universe",
        "_score": 0.5927061438560486
      },
      {
        "text": "the LSD work—but LSD and the Mind of the Universe focuses on what happened in the high-dose journey.\nThe circumstances were unusually stable, concentrated, and focused: the same sitter for years, same set and setting, intention, location (Northeast Ohio), substance, dose level, and the same recording process—always recording each session as completely as possible within 24 hours. When you stabilize your work—eliminate variables, use the same methodology consistently—it stabilizes the conversation between you and the creative intelligence of the universe. It stabilizes the communion so that one session leads to the next in a coherent, intelligent manner. You may not understand the continuity as it unfolds, but over time you see patterns and feel you’re engaging a single creative intelligence. I say that carefully—there are many layers and forms of intelligence—but across sessions the continuity is unmistakable.",
        "citation": "Bache · 2021-03-29 · Spirit Plant Medicine · Chris Bache – LSD and the Mind of the Universe – SPMC 2019",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Chris Bache – LSD and the Mind of the Universe – SPMC 2019",
        "_score": 0.5885568857192993
      },
      {
        "text": "y fear—fear of dying, fear of loss. If you lose that fear of dying, you live from a different place.\nLSD and the Mind of the Universe is a psychedelic memoir—a whole life’s work. I like the title Diamonds from Heaven better because it’s a story of a journey of deepening intimacy. After sessions, even a grocery store can feel like Disneyland—strange and surreal. That’s our work: go into deeper intimacy with whatever drives the universe, then come back and live our lives as best we can. Reincarnation does this—pulling us out into spiritual reality, plunging us back in, over and over. A psychedelic session reenacts that on a smaller orbit: it shatters the earthly life, opens us to what it’s like to die into the great surrounding world, then we come back into time and space. Do that enough times—incarnate enough times—and you cease to relate to the world as before.",
        "citation": "Bache · 2021-04-21 · Adventures Through the Mind · Global Collapse, Spirituality & The Birth of the Future Human (ATTMind #142)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Global Collapse, Spirituality & The Birth of the Future Human (ATTMind #142)",
        "_score": 0.5875393152236938
      },
      {
        "text": "incredible LSD and the Mind of the Universe: Diamonds from Heaven, which many people have read now.\nJust to add a little more about how I understand what happened in that 20-year journey—mind you, it would take all day to do it justice—the very short version is: in each one of those 73 journeys, the first two hours were, as you described in the book, sometimes exquisitely painful as you went through the difficult process of ego dissolution and beyond—letting go of any kind of identity, even as a human. And then what happened, as I recall, is that you broke out into what you have called the vast intelligences of the universe. Believe me, folks, this is no exaggeration—the kind of material that Chris brought back is absolutely stunning and absolutely relevant to what’s going on on the planet.",
        "citation": "Bache · 2024-09-24 · Spirit Plant Medicine · Philosophical Implications of Non-Ordinary States (live)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Philosophical Implications of Non-Ordinary States (live)",
        "_score": 0.5875027775764465
      },
      {
        "text": "edited by Harold Abram Evans. Many of the speakers presenting here today are included in this work.\nSo, let’s jump into it: Why does death become as large as it sometimes does in LSD psychotherapy? I wrote Dark Night, Early Dawn, in part, to answer this question, so I’ll give you a little background. My first two years of psychedelic work were focused on the perinatal level of consciousness—filled with the usual perinatal symptomatology, extreme existential confrontations, convulsive seizures, and various forms of fetal experiences. Eventually, this culminated in a death-rebirth experience that turned my life inside out and snapped my identity like a twig. I began the day as a white, middle-class, fresh-out-of-the-Ivy-League philosopher obsessed with the meaning of life, and was forced to become women—hundreds of women of color, women with no educational background or philosophical horizons. It was frightening. The inversion of my values, and particularly the loss of my sexual identity, was shattering. It was the perfect hell for a male academic. When I lost the distinctions that had defined my life, I died—and was reborn into a new world, the extraordinarily beautiful world of the feminine, explored under the arm of the Great Mother.",
        "citation": "Bache · 2015-03-16 · Archetypal View · Exploring the Boundaries of Death and Rebirth in LSD Psychotherapy",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Exploring the Boundaries of Death and Rebirth in LSD Psychotherapy",
        "_score": 0.5847007036209106
      },
      {
        "text": "ing deeper requires yet another cycle of complete surrender to enter the initiation available there.\nWorking with high doses of LSD has been compared to a nuclear bomb. The bomb and LSD were both created in the same decade. A long, sustained series of psychedelic experiences, focused therapeutically, triggers a sustained “nuclear explosion”—not only de‑structuring reality as you’ve known it, but exposing deeper levels that were always there but invisible until this explosion brought them into awareness. We’re not talking about bombs, of course; we’re talking about this beautiful universe: 100 billion galaxies, billions of stars in the Milky Way. I’ll use that as backdrop to touch on turning points in my journey and levels of reality I entered.\n\nLooking back, I identified five core levels or cycles of death and rebirth: personal mind; collective mind (species mind); archetypal mind; causal oneness (the One); and Diamond Luminosity. That’s the structure I used to tell the travelogue in the book.",
        "citation": "Bache · 2021-06-03 · Portland Psychedelic Society · LSD and the Mind of the Universe – Christopher Bache, Ph.D.",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD and the Mind of the Universe – Christopher Bache, Ph.D.",
        "_score": 0.5811862349510193
      }
    ]
  },
  "talks": {
    "queries": [
      "divine feminine",
      "cosmic birth",
      "mother universe",
      "shakti",
      "birthing humanity"
    ],
    "chunks": [
      {
        "text": "ently traveled.\n\nJef Baker: It’s interesting that you also note perceiving the universe as feminine.\nChris Bache: For two reasons I discuss in the book. First, the tremendous love the universe awakened in me—the deep heart-opening and passionate love that took me in—had a feminine quality. Second, a specific cosmology emerged in my sessions that surprised me; it wasn’t one I’d internalized from my reading. I was taken back to the beginning of creation—before the Big Bang—and experienced the universe emerging out of a primal oneness which becomes two, yin and yang. Out of that primal two, one consciousness remained outside time and space, intact, while the other entered time and space and manifested everything that has evolved since the Big Bang. The consciousness that stayed outside felt more “masculine,” and the consciousness that created felt more “feminine.” It was congruent with my repeated experience of the universe as more feminine than masculine. The Great Mother lineage is very strong in me; I’ve always felt deeply connected to it.\n\nJef Baker: As in many cultures around the world, the Earth is the Great Mother.",
        "ts_url": "https://youtu.be/B0BhUOEP1Mg?t=2474",
        "archival_title": "Bicycle Day Conversation with Jef Baker",
        "recorded_date": "2020-04-19",
        "_score": 0.7412445545196533,
        "start_hhmmss": "00:41:14"
      },
      {
        "text": "of the cosmic process integrating and interpenetrating, liberating each other from their loneliness.\nChris Bache:\nI want to be careful and remind us that a finite mind does its best to give cognitive structure to transcendent experiences. What I’m about to describe is a heuristic: a splitting of the divine principle into two halves—a “male” half that stays outside time and space in a transcendent position, and a “female” half that manifests time and space and the physical cosmos. I don’t literally think in male/female terms, but this is the best my mind could do. The principle is what matters: not all creative intelligence manifests as physical reality. Some holds position outside physical reality. There is a spiritual reality that gives birth to physical reality.",
        "ts_url": "https://youtu.be/ec0elBHJXAc?t=3022",
        "archival_title": "The Mind of the Universe: Diamonds from Heaven",
        "recorded_date": "2023-01-27",
        "_score": 0.6856350898742676,
        "start_hhmmss": "00:50:22"
      },
      {
        "text": "side of women’s experiences and taken on an extraordinary journey under the arm of the Great Mother.\nI believe in reincarnation—we’ve had lives as men and women—but this wasn’t simply encountering former lives. The message was: where you are going, gender does not exist. Let go. When I let go of my identity as Chris Bache, I entered the beginnings of a deep conversation, a deep communion with the universe. I thought after such a deep ego death my suffering was over and I would be introduced to a banquet of cosmological insights. That’s not what happened at the collective mind level.",
        "ts_url": "https://youtu.be/icBasHgjzsY?t=1091",
        "archival_title": "LSD and the Mind of the Universe – Christopher Bache, Ph.D.",
        "recorded_date": "2021-06-03",
        "_score": 0.6536616086959839,
        "start_hhmmss": "00:18:11"
      },
      {
        "text": "ted in that kind of slightly self-denial philosophy, isn’t it? That also is many thousands of years…\nChris Bache: I think basically all the axial religions got two things fundamentally wrong. They got nature wrong—they don’t really have an adequate theology or understanding of nature—and they got women wrong. The two are connected, because women are so closely connected to nature, and those traditions were patriarchally and escapist oriented. As a historian, I understand it. Four or five thousand years ago, through various psychotechnologies—yoga, meditation, or psychedelic substances—we began to have deeper experiences of the Mother Universe, the universe that surrounds the physical universe. Once you have experiential contact with that universe, it is so blissful, so ecstatic, and you recognize that’s where we’re from. You can’t help believing that’s where we belong. This is not where we belong; that is where we belong. So a theology of return developed: the savior comes to take us home, the enlightened being liberates us back into our home. But that still leaves the question: what is the purpose of creation?",
        "ts_url": "https://youtu.be/jVDndxA6aZo?t=2045",
        "archival_title": "Contemplating Reincarnation (Part 1)",
        "recorded_date": "2021-04-01",
        "_score": 0.6430984139442444,
        "start_hhmmss": "00:34:05"
      },
      {
        "text": "g about the Divine, the collective mind, manifesting in matter within the universe. Is that correct?\nChris Bache\nYes. Think of a mother universe and a daughter universe. The mother universe is spiritual reality, continually infusing, orchestrating, shaping, and receiving physical reality. At the subatomic level there’s a dance, a continual infusion of energy into time and space from the quantum or sub-quantum realm. Ninety-six percent of the universe is dark energy and dark matter—physical existence is just the surface.",
        "ts_url": "https://youtu.be/Dw7D7ih8vy0?t=3646",
        "archival_title": "EP.6 - Chris Bache | LSD AND THE MIND OF THE UNIVERSE",
        "recorded_date": "2020-05-13",
        "_score": 0.6429489850997925,
        "start_hhmmss": "01:00:46"
      },
      {
        "text": "ly connected to it.\n\nJef Baker: As in many cultures around the world, the Earth is the Great Mother.\nChris Bache: I consider my work always in service of the Great Mother.\n\nJef Baker: As I noted earlier, I’m just up to the point of deep time in your book. Perhaps you could give us a little insight into the nature of deep time.\n\nChris Bache: Early on, after the ocean of suffering in the cleansing phase—really intense collective cleansing—when I came through each session, I’d be spun into a reality so foreign that, after my 11th session, I couldn’t remember it. It took months to begin to fully recall it. I had entered what I later called “deep time.” For a year and a total of seven sessions, I experienced my life as a completed whole—start to finish—with all the days of my life simultaneously present. Holding the totality of my life in a single now was hard for a mind trained to operate linearly. It literally took a year to learn to stabilize consciousness at that condition. I kept going back to the same state; the universe was teaching me how to be conscious there.",
        "ts_url": "https://youtu.be/B0BhUOEP1Mg?t=2639",
        "archival_title": "Bicycle Day Conversation with Jef Baker",
        "recorded_date": "2020-04-19",
        "_score": 0.6427447199821472,
        "start_hhmmss": "00:43:59"
      },
      {
        "text": "ife as many different women in turn. What do you think was the purpose, and how did they impact you?\nChris Bache: That was my ego death experience. Around my ninth or tenth session, the universe broke me like a twig. I began the day as a white, Ivy League–educated philosopher, passionately concerned with the meaning of existence. The universe forced me to become its exact opposite. I became women. I became women of color. I became women who weren’t interested in the meaning of life, who weren’t educated at all. I was myself, but in all these other roles. It terrified me. I fought it. Eventually, when I surrendered and allowed myself to become all these women, everything shifted. I was taken under the arm of the Great Mother and initiated into the lives of hundreds of women—the more positive side of female experience—conceiving, giving birth, loving husbands, loving children.",
        "ts_url": "https://youtu.be/2Trb-vC8zc0?t=834",
        "archival_title": "LSD & the Mind of the Universe (What Is Going OM)",
        "recorded_date": "2023-08-17",
        "_score": 0.626430332660675,
        "start_hhmmss": "00:13:54"
      },
      {
        "text": "the illumination and its effects mirrors what’s recognized and highly valued in certain traditions.\nChris Bache\nThere is nothing unique in my journey. I’m rediscovering what many people in many traditions have already discovered. The technology may differ, but the core understandings—the truths and insights—have been with us a long time, embodied by great beings and passed on. There’s nothing unique in my work.\n\nRoger Walsh\nAnd you opened to experiences others have opened to, yet you brought your own unique constellation—your gifts as a philosopher and theologian. So it’s the “yes, and.”\n\nChris Bache\nAt the end, when I wasn’t sure what to do with all of this, the Mother—my naming of the Absolute tends to run feminine—spoke. I see myself as a servant of the Great Mother, with physical existence as her embodiment and the transcendent divine as more male, the embodied divine more female. She said, “Let them see me as you have seen me. That’s all. They’ll know what to do with it. It will serve them in ways you can’t anticipate. Just let them see me.”",
        "ts_url": "https://youtu.be/-2NMOMvRkYE?t=7825",
        "archival_title": "Evolution of Collective Consciousness (Deep Transformation Podcast – Part 1)",
        "recorded_date": "2022-01-20",
        "_score": 0.62497878074646,
        "start_hhmmss": "02:10:25"
      },
      {
        "text": "ly, what did that do to you when you suddenly connected with the female experience after being male?\nChris Bache:\nAbout two and a half years into my journey—around sessions 10 or 11—the universe put me into a situation where I could experience nothing except from within a feminine identity. It was a womanly form that was the exact opposite of my male, academic, intellectually oriented form. It was totally terrifying to experience being me but not being me within a framework I’d never known. It snapped me. When I let go and yielded, I became hundreds—potentially thousands—of women and was given a journey into the world of women under the arm of the Great Mother. It was ecstatic. When it opened, I thought, Why was I afraid of this? This is marvelous. The universe was teaching me that where I was going, gender does not exist. All gender, all roles based on gender, and any aspect of my historical personality had to be surrendered if I was going to experience more intimately what is there.\n\nRegina Meredith:\nOn behalf of the men and women watching this: what was the most terrifying or difficult part initially of being confronted with a woman’s reality?",
        "ts_url": "https://youtu.be/S4XSaHn54P4?t=267",
        "archival_title": "73 Trips: Inside the Psychedelic Universe",
        "recorded_date": "2023-11-06",
        "_score": 0.6178218722343445,
        "start_hhmmss": "00:04:27"
      },
      {
        "text": ", you talked about the birth of the future human. Can you shed a little light on what that is about?\nChris Bache:\nThere’s a chapter in the book called “The Birth of the Future Human.” I think it may be the most important chapter, and it completely surprised me. I thought my work was a personal journey—healing, awakening. Then it broadened into an individual’s insight into the deep structure of our lives. But starting around 1990 through 1995, I began receiving a series of internally consistent visions about humanity’s evolutionary destiny: where we were in our journey, that we were coming to a turning point, a crescendo that would catalyze a tremendous transformation inside humanity—a true before-and-after moment in time. A profound spiritual transformation was coming to a head. This kept repeating itself in my work in different ways, but I didn’t know how the universe was going to pull it off.",
        "ts_url": "https://youtu.be/FMgixG6Z0sk?t=4792",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "recorded_date": "2025-03-18",
        "_score": 0.6162552833557129,
        "start_hhmmss": "01:19:52"
      },
      {
        "text": "ard with the universe, and it will happen. The old has to die for this magnificent being to be born.\nThis is a species of Buddhas, Christs, Prophets. This is when the feminine is fully healed and reconciled with the masculine, giving unprecedented access to the blessings of cosmic intelligence—absolutely embodied. No more ‘up and out’ cosmology, no escapist theologies, no Bardo. The Bardo is in the process of emptying itself—it’s a temporary condition in the evolutionary saga, and as we become more integrated, we no longer need that buffer. This is, admittedly, one person’s limited view, but I think we all feel some part of it. It’s much bigger than any one person can see.\n\nThank you.",
        "ts_url": "https://youtu.be/OJipHXvczW0?t=7012",
        "archival_title": "Chris Bache, Waking Up in the Classroom – Lessons from 30 Years of Teaching",
        "recorded_date": "2014-11-10",
        "_score": 0.6007542610168457,
        "start_hhmmss": "01:56:52"
      },
      {
        "text": "ownward. This is a cosmic dance—a meeting between deep levels of the Divine, God communing with God.\nChris Bache:\nSo what dies and is reborn at these deeper cycles of death and rebirth—beyond the ego, beyond the species ego, beyond a series of shamanic personas? I think what dies and is reborn is something of truly cosmic proportions. Some dimension God is calling, some dimension that is extraordinarily vast, surrenders, and in that surrendering awakens more completely to itself. Much to our surprise, the divine appears to genuinely appreciate our help in facilitating this communion. Stan, thank you from the bottom of my heart—thank you.",
        "ts_url": "https://youtu.be/cEsoN2IaGc4?t=1810",
        "archival_title": "Exploring the Boundaries of Death and Rebirth in LSD Psychotherapy",
        "recorded_date": "2015-03-16",
        "_score": 0.5973256230354309,
        "start_hhmmss": "00:30:10"
      }
    ]
  }
}