{
  "book": {
    "chunks": [
      {
        "text": "This is the first time that the theme of humanity’s future entered my sessions, but it would not be the last. From this point on, the story of our collective evolution became a recurring theme in my work. Though I describe this story as a “master plan,” I do not mean this in a heavy handed, dictated-destiny sense of the phrase. I am simply trying to give voice to an encounter with the deep intentionality expressing itself in the unfolding complexity of our universe. In time this story became the metaframework of my entire psychedelic journey and my entire life. I will say more about this in chapter 9, “The Birth of the Future Human,” but the story I will tell there began here, inside these two sessions.",
        "citation": "LSDMU ch.6 §0 ¶103",
        "chapter_code": "6",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.5577505826950073
      },
      {
        "text": "*LSD and the Mind of the Universe is primarily a* cosmological narrative, not a therapeutic narrative. In a therapeutic narrative, the personal details are important; in a cosmological narrative, they are less so. Of course, this entire journey was deeply personal and I own it as such, but my personal story is not the important story here, nor is it essential to the story I want to convey. It is when one moves beyond the shoals of the personal psyche and enters the ocean of the deep psyche that the larger and more philosophically interesting story begins to emerge.",
        "citation": "LSDMU ch.1 §8 ¶7",
        "chapter_code": "1",
        "section_code": "8",
        "archival_title": "",
        "_score": 0.547187089920044
      },
      {
        "text": "In the final analysis, I think that whether we remain inside the physical universe after waking up spiritually or leave it behind are not mutually exclusive options but simultaneous possibilities. If we were to achieve enlightenment and leave spacetime for one hundred thousand years and then return, we would find the universe continuing to patiently grow her children through the steady and relentless accumulation of experience in rebirth. If we leave again, this time for a million years, upon our return we would find the same thing—Nature growing humanity into ever richer forms. In such a universe, how could life not eventually produce fully awakened Souls on Earth? Not just a few here and there, but everyone everywhere. An entire species that through its hard labor has given birth to its next self-expression—a fully conscious Soul, green to its roots, feet firmly planted on the Earth but now transparent to the Creative Intelligence that everywhere presses in upon it. This is the vision of history I now turn to explore.",
        "citation": "LSDMU ch.8 §1 ¶49",
        "chapter_code": "8",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.5346225500106812
      },
      {
        "text": "If history or nature or the Creative Intelligence of the universe is giving birth to a new form of human consciousness on this planet, the next question becomes, What form will this Future Human take? What will our evolutionary future self look like? To address this question, I want to connect the vision of the Great Awakening presented here with the vision of the birth of the Diamond Soul presented in the previous chapter. There is such a striking convergence of themes in these two visions that the longer I have held them both in my awareness, the more I have come to see them as deeply intertwined. I offer the following thoughts as a brief explanation for why I believe the form that the Future Human will take will be the Diamond Soul.",
        "citation": "LSDMU ch.9 §4 ¶1",
        "chapter_code": "9",
        "section_code": "4",
        "archival_title": "",
        "_score": 0.5330728888511658
      },
      {
        "text": "The time frame within which all this was taking place was staggering. In a final and deeply moving portion of the session, I entered humanity's deep future again and spent time with the FORM of the being we are becoming—the Future Human. What a splendid creature! What grace and nobility! It was such a privilege to experience this being and so helpful as we enter the difficult years ahead. The people need a vision of what we are becoming—of the extraordinary beauty that is emerging from our tangled past.",
        "citation": "LSDMU ch.11 §0 ¶37",
        "chapter_code": "11",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.513594388961792
      },
      {
        "text": "LSD generates a powerful but temporary increase in the mind’s sensitivity. Our habitual conditioning is interrupted and our field of awareness is dramatically expanded, but after a number of hours our consciousness returns to its familiar patterns. If we don’t take steps to accurately record our experiences as soon as we return, our memory of them tends to fade. What was overwhelmingly powerful one day becomes slightly dimmer the next and dimmer still a month later. Preserving the memory of our experiences as carefully as possible completes the circle of learning and lays a stronger foundation for our next session.",
        "citation": "LSDMU ch.1 §7 ¶2",
        "chapter_code": "1",
        "section_code": "7",
        "archival_title": "",
        "_score": 0.5087858438491821
      },
      {
        "text": "Session 39 Future of Humanity",
        "citation": "LSDMU ch.9 §1 ¶8",
        "chapter_code": "9",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.5060910582542419
      },
      {
        "text": "In this context, I will mention that this may be one advantage of the long LSD time window compared with short-acting psychedelics like 5-MeO-DMT. LSD does not blast you through the many layers of the cosmos as quickly as 5-MeO-DMT does, but the eight-hour LSD interface invites/propels/forces a polishing of the consciousness doing the exploring as it is impacted/ instructed/healed by the consciousness being explored. An LSD session grinds slow but it grinds fine. It gives us time to be engaged and changed by the realities we are encountering. I think this polishing influences both the eventual clarity of our perception in these states and what we are able to bring back from them, both in terms of healing and understanding.",
        "citation": "LSDMU ch.1 §9 ¶4",
        "chapter_code": "1",
        "section_code": "9",
        "archival_title": "",
        "_score": 0.4967767000198364
      },
      {
        "text": "As the inherent wholeness of existence becomes a living experience for more and more persons, individuals will find themselves empowered by new orders of creativity that could not have been anticipated as long as we were trapped within the narrow confines of an atomistic, self-referential mode of consciousness. As the encompassing fields of mind become stronger, synergy and synchronicity will increase. The Sacred Mind will spring alive inside the human family in ways that seem impossible from our current fragmented condition. However difficult the journey, who could not feel uplifted by the privilege of being part of such an undertaking? The pain of this labor should not be feared but used creatively. We are building a new world for our grandchildren, indeed, a new species. (Bache 2000, 254-56)",
        "citation": "LSDMU ch.9 §3 ¶13",
        "chapter_code": "9",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.4913543462753296
      },
      {
        "text": "I know it sounds arrogant to speak on such a scale, but I must if lam to describe the visions that repeatedly came through my sessions. Ego-death destroys the existential isolation and constant self-referencing that organizes our ordinary experience of the world. When the partitions of personal consciousness are surrendered, our experience spontaneously opens to the larger rhythms of life that we are part of. One portion of these rhythms is the collective psyche of our species. At the subtle level of consciousness, we can dissolve into the human species-mind so deeply that the beginnings and endings of our personal life become insignificant. When the “small-self” opens to the “species-self” this completely, it is only natural that insights into humanity’s larger developmental trajectory sometimes emerge in our awareness. We would be surprised if this did not happen.",
        "citation": "LSDMU ch.9 §0 ¶9",
        "chapter_code": "9",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.48865389823913574
      },
      {
        "text": "LSD unleashes such dramatically different states of awareness from anything we experience in our everyday life that we have to learn how to work with it. Like an athlete undertaking a strenuous sport, we have to train for the event. Not only do our minds have to adjust to the expanded capacities LSD awakens, so do our bodies. Our subtle energy system has to be conditioned and strengthened to sustain the enormous flows of energy evoked by the LSD state. As I look back on these early sessions, they seem to have functioned as an intensive training camp, preparing me physically and psychologically for the long journey that was beginning. They also broke me down existentially, taking me into my first death and rebirth.",
        "citation": "LSDMU ch.2 §0 ¶5",
        "chapter_code": "2",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.48804613947868347
      },
      {
        "text": "If the ultimate goal of spiritual practice is the permanent transformation of our consciousness, then the soft underbelly of psychedelics is their temporary nature. LSD plunges us into intense spiritual exercises, holds us there for a while, and then brings us back. Clearly, we cannot stay where we have gone; it is a mistaken strategy to try to do so. We must accept these limitations and work with them. But how can we work with these temporary states in a way that will advance our permanent transformation?",
        "citation": "LSDMU ch.1 §3 ¶4",
        "chapter_code": "1",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.48753517866134644
      },
      {
        "text": "At one point, I was given a brief experience of the Future Human we are becoming. It was as though I had been carried into the distant future and allowed to try on for size what will be the abiding state of humanity at that time. What a magnificent being! Just touching it filled me with rapture, calm, and sheer delight. It felt clear, warm, and whole. There was an abiding sense of Oneness that went deeper than just the feeling of being interconnected. It was a feeling of being truly One underneath the diversity of life. Such expansiveness, such breadth of being! It was fully embodied spiritual realization, the tantric awakening of our entire species, Spirit and Matter in perfect balance. This penetrating glimpse transfixed me. Its beauty, grandeur, and simplicity pierced my heart. This awakening poured a delicious and healing nectar into me, a balm for all my kind.",
        "citation": "LSDMU ch.9 §1 ¶34",
        "chapter_code": "9",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.4866564869880676
      },
      {
        "text": "And finally, one last point. When we come through this collective labor, we will discover that 95 percent of the work of creating this Future Human was already accomplished before our labor began. The birth of the Future Human is the culmination of a gestational process that has been underway for hundreds of thousands of years. Through the systematic expansion and integration of our human capacity lifetime after lifetime, we have been growing toward this historic breakthrough. Gestation is long and slow, but birth is sudden and quick. Our planet is going into labor and will soon give us no choice but to deliver our deeper self into history. The form of our future is implicit in our past. The Future Human *is* the Diamond Soul.",
        "citation": "LSDMU ch.9 §4 ¶9",
        "chapter_code": "9",
        "section_code": "4",
        "archival_title": "",
        "_score": 0.4818722605705261
      },
      {
        "text": "As I have been working on LSD and the Mind of the Universe, my absorption of my psychedelic experiences has deepened in unexpected ways. They are beginning to live in me differently than before and I in them. It feels like my session memories have come together to form a greater living whole and that the inside and outside of my life are moving toward a new synthesis. There is a saying from the Navajo: “When you put a thing in order, and give it aname, and you are all in accord, it becomes.” By telling my story, by giving it aname and owning my experience, something new has been set in motion. A new peace has settled over me. At first this peace eased my existential loneliness and made the loss of communion more bearable, but then it deepened further. As I was finishing the book and beginning to speak about it publicly, a new spiritual transparency began to open in my life. It sometimes feels as though the Beloved is not waiting for me to die but is coming for me here. Where this will lead, I don’t know. It is still unfolding, taking me to new places, but surely this is the work of integration—to own, internalize, and manifest your experiences as deeply as you can. To let them flow through you and shape your presence on this Earth.",
        "citation": "LSDMU ch.12 §3 ¶5",
        "chapter_code": "12",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.4799170196056366
      },
      {
        "text": "The core vision of our future that has emerged in my sessions is that humanity is coming into a time of Great Awakening, a profound shift in the fundamental condition of the human psyche. But for there to be a Great Awakening, there must first take place a Great Death. We must be emptied of the old before the new can emerge. I have come to believe that the twentyfirst century will be such a time. It will begin the *dark night of our collective soul*, a time of emptying, of intense anguish, of loss of control and breakdown. A global purification unto death that will last generations. But through this hard labor, we will give birth to something extraordinary. More than just a new civilization, what is emerging is nothing less than a new order of human being. I believe that through the global systems crisis, our planet is giving birth to the Future Human.",
        "citation": "LSDMU ch.9 §0 ¶8",
        "chapter_code": "9",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.4763096868991852
      },
      {
        "text": "From an historical perspective, therapeutically structured LSD sessions are a modern variation of an ancient spiritual path that has been well documented by scholars. From the Eleusinian mystery rites of ancient Greece to the peyote ceremonies of Native Americans and the ayahuasca churches of present-day Brazil, human beings have been ingesting consciousness-amplifying substances for thousands of years and have all come to the same conclusion: these substances are sacraments that help us reconnect with the universe. Seen in this context, therapeutically structured LSD sessions are not an end run around spiritual practice, as some early scholars thought, but a particularly intense form of spiritual practice, with its own distinctive characteristics and challenges.",
        "citation": "LSDMU ch.1 §3 ¶2",
        "chapter_code": "1",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.4756907820701599
      },
      {
        "text": "The claim that it is possible to experience one’s future in psychedelic states of consciousness represents such a challenge to our thinking that I thought it might be helpful to look briefly at two other circumstances in which people appear to get glimpses into their future. The first is when people come close to dying (near-death experiences), and the second is past-life hypnotherapy. Though each of these may be controversial in their own right, they are a source of fascinating observations that, when combined with psychedelic experience, reinforce a sense of the possible that deserves our attention. They will also deepen the story of reincarnation begun here.",
        "citation": "LSDMU ch.5 §7 ¶1",
        "chapter_code": "5",
        "section_code": "7",
        "archival_title": "",
        "_score": 0.47431737184524536
      }
    ]
  },
  "talks": {
    "chunks": [
      {
        "text": "ts for the natural human being, the birth of the future human. What does the future human look like?\nChris Bache:\nI think our spiritual traditions have been giving us insights into what’s emerging. All of the great saints and sages who seeded the religions of the Axial Age drew humanity to them because we could feel a deep resonance. They were archetypal prototypes of what we were becoming, and they invited us to become what they had become. In the Buddhas, the prophets, the Christ, and the great saints of the deepest spiritual traditions, we can see prototypes of what’s coming.",
        "ts_url": "https://youtu.be/9jsKPUwwqfQ?t=1928",
        "archival_title": "Philosophical Implications of Non-Ordinary States (live)",
        "recorded_date": "2024-09-24",
        "start_hhmmss": "00:32:08",
        "_score": 0.7158013582229614
      },
      {
        "text": ":\nI recall in your book that you were shown the universe goes on and on, essentially. Is that right?\nChris Bache:\nThere are two different models: one is that it’ll keep expanding forever; the other is that it reaches a maximum expansion and then contracts—a pulsating universe expanding and contracting, then re-expanding. I don’t have an answer to that question. Clearly, the universe is on a tear, going on for billions and billions of years. That’s a deflating insight if you think a human being is simply a 100-year-old being; then we’re sand on the beach beside the ocean—we don’t get to participate in that deep future. But if reincarnation is true—and I think there’s plenty of factual evidence that it is—and if our essence is indestructible, and we roll over what we’ve learned into continued learning over thousands and millions of years, then we actually get to participate in this divine unfolding. It’s our future. We are co-participants—eternal participants—in this eternal process.\n\nEmmy Vadnais:\nIn your experiences, you talked about the birth of the future human. Can you shed a little light on what that is about?",
        "ts_url": "https://youtu.be/FMgixG6Z0sk?t=4706",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "recorded_date": "2025-03-18",
        "start_hhmmss": "01:18:26",
        "_score": 0.693972647190094
      },
      {
        "text": ", you talked about the birth of the future human. Can you shed a little light on what that is about?\nChris Bache:\nThere’s a chapter in the book called “The Birth of the Future Human.” I think it may be the most important chapter, and it completely surprised me. I thought my work was a personal journey—healing, awakening. Then it broadened into an individual’s insight into the deep structure of our lives. But starting around 1990 through 1995, I began receiving a series of internally consistent visions about humanity’s evolutionary destiny: where we were in our journey, that we were coming to a turning point, a crescendo that would catalyze a tremendous transformation inside humanity—a true before-and-after moment in time. A profound spiritual transformation was coming to a head. This kept repeating itself in my work in different ways, but I didn’t know how the universe was going to pull it off.",
        "ts_url": "https://youtu.be/FMgixG6Z0sk?t=4792",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "recorded_date": "2025-03-18",
        "start_hhmmss": "01:19:52",
        "_score": 0.6936410665512085
      },
      {
        "text": "---\narchivaltitle: 2023-10-10 – Experience of the Human Being of the Future (short)\n\nchannel: Buddha at the Gas Pump\n\nrecorded: 2023-10-10\n\npublished: 2023-10-10\n\nyoutubeid: 3tVAlUzqz7M\nTranscriber: Otter.ai (diarized, speaker-attributed) + GPT-5 normalization\n\ntranscriptiondate: 2025-07-31\n\nlicense: CC0 1.0 Universal\nspeakers: [\"Chris Bache\"]\n---\n\n---\nChris Bache:\nOne of the last great visions the universe gave me in one of my sessions took me deep into deep time—into the future—and gave me my last experience of the future human. It was as if it allowed me to try on, for size, the fundamental blueprint of the human psyche at that point in the future. This was the most extraordinary being. I can't quickly describe to you what an extraordinary being this is.\n\nPicture the highest, finest qualities we've imagined—the highest spiritual capacities we can imagine: a mind completely open to the universe, a heart completely open to each other; an extraordinarily magnificent being. That's what's at stake here. That's what we're trying to become.",
        "ts_url": "https://youtu.be/3tVAlUzqz7M?t=0",
        "archival_title": "Experience of the Human Being of the Future (short)",
        "recorded_date": "2023-10-10",
        "start_hhmmss": "00:00:00",
        "_score": 0.6850156188011169
      },
      {
        "text": "ng to become one being internally, integrating all our former lives as we try to transcend our past.\nChris Bache: We're trying to unify engineering, ecological, industrial practices; taking responsibility for planetary health geopolitically and geophysically. That effort is mirrored by the intrapsychic process where we strive to grow up and come to terms with who and what we are. This is what I call the birth of the future human. The crisis we are entering, which will likely dominate the 21st and extend into the 22nd century, is not simply economic or industrial—it's a crisis of consciousness, an evolutionary crisis giving birth to a future human.\n\nLate in my sessions—at the very end—one of the last great visions took me deep into the future and let me \"try on\" the fundamental blueprint of the human psyche at that point. This being was the most extraordinary being—imagine the highest, finest qualities, the greatest spiritual capacities: a mind and heart completely open to the universe and to each other, a truly magnificent being. That's what's at stake; that's what we're trying to become.",
        "ts_url": "https://youtu.be/SIjZypJKSFM?t=7806",
        "archival_title": "Michael Pollan and Chris Bache – Buddha at the Gas Pump Interview",
        "recorded_date": "2019-05-15",
        "start_hhmmss": "02:10:06",
        "_score": 0.6653516292572021
      },
      {
        "text": "ng been through what you’ve been through, how do you see these times laid into what you experienced?\nChris Bache:\nJumping many years ahead, I summarized my experiences of our time in a chapter called “The Birth of the Future Human.” Over many years, I was given visions of humanity coming to a turning point, a spiritual breakthrough—an evolutionary shift in the plate tectonics of the collective psyche. In 1995, I dissolved into the species mind, into what I call deep time, taken into the future where I experienced a death-and-rebirth of the human family—not as individuals, but humanity as a whole. It was a global systems crisis precipitated by escalating ecological crises. I wasn’t given details, dates, nothing about artificial intelligence or a third world war—just the experience of a prolonged loss of control and a collapse of everything considered normal and necessary. Since then, I’ve lived with this awareness. For me, it’s not a projected fantasy; it’s an experience, so I don’t question its truth. I see this period as one of increasing destabilization: conflicts between races, religions, sexes, classes—tremendous things we’ve done to each other for thousands of years. We have to grow spiritually into the next form emerging in the human. I think this process will continue to deepen for decades. What’s unfolding now is the overture, bringing to the surface age-old hatreds that we must transform. I don’t offer political solutions; my perspective isn’t ground-level. It’s from far above the Earth, looking at the long evolutionary trajectory.",
        "ts_url": "https://youtu.be/S4XSaHn54P4?t=655",
        "archival_title": "73 Trips: Inside the Psychedelic Universe",
        "recorded_date": "2023-11-06",
        "start_hhmmss": "00:10:55",
        "_score": 0.6602507829666138
      },
      {
        "text": "vehicle—the human being—is designed for rapid transformation. Please expand on that before we close.\nChris Bache:\nIn the 70th vision, I was given what I consider the last great vision of my journey; after that, it was wrapping up. I was taken into deep time and shown three core experiences. One was an insight into how humanity is designed for accelerated evolution. On the surface, we reincarnate: we learn, grow, change, make decisions, and return different. But beneath the incarnating self is a deeper structure that holds all our incarnational memories—a fundamental blueprint from which we act. Humanity grows and changes individually, while a very specific structure in the collective psyche accumulates and stores that information. Periodically, that deeper structure pivots—what I call a shift in the plate tectonics of the collective psyche. It’s the genius of creation: we learn individually, it collects at a deeper level, and when that deeper level shifts, all subsequent individual experience unfolds from that changed fundamental psyche. After the birth of the future human, all future incarnations of human beings will operate out of this transformed collective psyche—and the process continues. Individuals learn and grow; it’s collected at depth; that level learns and grows—like Rupert Sheldrake talks about morphogenic fields—an ongoing, continuously evolving process.",
        "ts_url": "https://youtu.be/S4XSaHn54P4?t=2434",
        "archival_title": "73 Trips: Inside the Psychedelic Universe",
        "recorded_date": "2023-11-06",
        "start_hhmmss": "00:40:34",
        "_score": 0.6595504283905029
      },
      {
        "text": "gleman:\nCan you say more about the visions you had for humanity’s future and the time that we’re in?\nChris Bache:\nThis was one of the great surprises for me, because I never expected anything like this to emerge in my work. I thought it was about personal transformation, even personal enlightenment. I never imagined that the evolution of the species would become such a dominant theme. Going back to about halfway through the work in the early ’90s, starting in 1991, I began to have a series of visions—just dropped into my sessions—that humanity was coming to a turning point, a true before-and-after point in history. We were entering a time of intense purification, essentially purifying the human psyche of the sins of our fathers—lifting the conditioning of the past to make us more receptive to, and capable of internalizing, the spiritual infusion, insights, and power becoming available at this time in history. There was a tremendous sense of rebirth coming.",
        "ts_url": "https://youtu.be/FEQ8ony19sk?t=4255",
        "archival_title": "Psychedelics and Cosmological Exploration with Chris Bache – Reach Truth Podcast",
        "recorded_date": "2022-08-30",
        "start_hhmmss": "01:10:55",
        "_score": 0.6578853726387024
      },
      {
        "text": "ss? What is happening in our historical circumstances? What is the immediate future for our species?\nChris Bache:\nI know I’m sharing my own visionary experiences. What may be powerful and true for one person won’t necessarily be powerful or true for another. I can only share what my experience has been. Early on—starting around my 23rd session, so for the last 50 or so—one of the recurring themes was where humanity is going. The vision was repeated again and again: we are coming into a turning point in history, a decisive before-and-after point, poised on the edge of a magnificent transition into a higher level of functioning. There is a greatness emerging within humanity.",
        "ts_url": "https://youtu.be/Kh5aqAuDBIM?t=6115",
        "archival_title": "LSD and the Mind of the Universe – S2S Podcast",
        "recorded_date": "2023-01-06",
        "start_hhmmss": "01:41:55",
        "_score": 0.6566421389579773
      },
      {
        "text": "ness within a collective psyche different from how we experienced it in the 19th and 20th centuries.\nManda Scott:\nNow—or for a long time before that, within our time before that.\n\nChris Bache:\nThere’s another theme that gave me some details of what the future human is. In other sessions, I was taken far into the future and experienced this new archetype. I believe in reincarnation—my first book was on reincarnation—and from a philosopher’s perspective, I think the empirical evidence is overwhelming. It’s always been part of my thinking, based on the evidence, not religious belief. I experienced reincarnation dynamics many times in my sessions—not only my personal reincarnational history, but reincarnation as a dynamic process for the entire planet. The entire species is pulsing in the rhythm of reincarnation. If reincarnation is a basic fact of life, then we have been building the future human for hundreds of thousands of years, growing bit by bit. We remember our former lives usually when we die and return to the domain of the soul, but I think we are coming into a point where the soul is becoming conscious inside our historical existence.",
        "ts_url": "https://youtu.be/q-caGhIlKS8?t=2683",
        "archival_title": "The Phoenix Always Rises: Evolving into the Future Human",
        "recorded_date": "2025-01-08",
        "start_hhmmss": "00:44:43",
        "_score": 0.6402126550674438
      },
      {
        "text": "lly conscious souls; that species would create a different life on this planet than we’ve ever seen.\nLater in my work, over about four years, I began receiving a series of visions about human evolution. The message was always the same: we’re coming to a turning point, a profound spiritual awakening—a before-and-after in human history. It involves tremendous collective purification, emptying out the pains of history to lay a new foundation for an infusion of divine energy rising within us. I was given glimpses of the transformed humanity that would emerge, but not how nature would pull it off.\n\nSeveral years later, in 1995, when I had transitioned to the Diamond Luminosity phase of my work, I expected to be taken back into that state. Instead, I was dissolved into the species—Chris Bache dissolved into the human family. As the human family, I was taken into the future—into deep time—and experienced what I came to understand as a death-and-rebirth process impacting the entire human family. Just as an individual can undergo an intense death–rebirth process in spiritual or psychedelic practice, history was putting the entire human family through such a process.",
        "ts_url": "https://youtu.be/2Trb-vC8zc0?t=2415",
        "archival_title": "LSD & the Mind of the Universe (What Is Going OM)",
        "recorded_date": "2023-08-17",
        "start_hhmmss": "00:40:15",
        "_score": 0.6348718404769897
      },
      {
        "text": "e case: a painful birth to transition into a more functional, balanced species. Could you elaborate?\nChris Bache: I explore this in a chapter called “The Birth of the Future Human,” and earlier in “The Great Awakening” in Dark Night, Early Dawn (2000). I was uncomfortable entering this territory at first—I’m not drawn to historical speculation. I began this work for individual healing and enlightenment, and that premise was blown away within a few years. The purification, the access to information and knowledge—everything seemed to be in service of the species as a whole. It’s not that our species is special in the universe, but the Divine’s focus here, now, seems species-wide.\n\nThis emphasis repeated so often and strongly that the gist of my 20-year journey became the collective story of death and rebirth. I have deep convictions that we’ve entered the dark night of our collective soul—a period of purification, confronting the sins of our fathers and mothers, which are our own through reincarnation. We’re facing our past choices and their consequences, purifying the toxins they left, to open into new dimensions of our being.",
        "ts_url": "https://youtu.be/B0BhUOEP1Mg?t=3521",
        "archival_title": "Bicycle Day Conversation with Jef Baker",
        "recorded_date": "2020-04-19",
        "start_hhmmss": "00:58:41",
        "_score": 0.6340640187263489
      },
      {
        "text": "erent world than the one we’re building now.\n\nSandy Sedgbeer:\nSo such a being has no need to evolve.\nChris Bache:\nI think this is simply the next step in our evolutionary saga. I don’t know how long this transition will take—at least generations. Whether it’s 100 years or several hundred, I don’t know. If it took 1,000 years, that’s probably stretching it, because I think we’ll be dead if we don’t make this transition sooner. We’re either going to go extinct or we’re going to transition into this new form. Extinction—or near extinction—is a tremendous accelerator of evolution. However long it takes, whatever we become, evolution isn’t going to stop. We’ve been at this for billions of years; we’ll be at this for billions more. There’s no telling where we might go next, and next after that. So I don’t see an end point—just the next point. And the next point is to wake up to what’s really going on, to who we really are, to the depth and breadth of our relationships with life itself, other people, and other species—and then we continue.\n\nSandy Sedgbeer:\nIt’s been 24 years since you stopped. Do you feel you have fully integrated all of those experiences?",
        "ts_url": "https://youtu.be/2Trb-vC8zc0?t=2815",
        "archival_title": "LSD & the Mind of the Universe (What Is Going OM)",
        "recorded_date": "2023-08-17",
        "start_hhmmss": "00:46:55",
        "_score": 0.631279468536377
      },
      {
        "text": "fferences fuse into an individuality that holds everything as an integrated, harmonious singularity.\nWhen I was given the grace of experiencing this new archetype toward the end of my journeys—this future human—it moved me to tears. It was so beautiful. Picture a humanity completely healed of the wounds and divisions of history, with an open, expansive, compassionate heart like the best of the saints, consciousness in deep communion with the creative intelligence of the universe, with fewer interfering Bardo echoes, and a profound commitment to being in the body—not trying to get out of time and space, but living an increasingly strong, focused, intentional integration of spirit and matter in physical existence. That’s what’s been coming into me. That’s what I have to offer.\n\nStephen Gray:\nThat was absolutely beautiful, Chris. I think I’m going to play this back to myself with headphones on before bedtime, for a beautiful bedtime story.\n\nChris Bache:\nWe really are. Ordinary, hard times ahead—but deep beauty.",
        "ts_url": "https://youtu.be/9jsKPUwwqfQ?t=2369",
        "archival_title": "Philosophical Implications of Non-Ordinary States (live)",
        "recorded_date": "2024-09-24",
        "start_hhmmss": "00:39:29",
        "_score": 0.6289742588996887
      },
      {
        "text": "things, and the only way was to teach me how to stay conscious in these unusual temporal modalities.\nThe last of what I consider the great visions took place in the 70th session, after one of the most extreme strip-downs I went through. It moved me into the most radical deep time in all my sessions. After this vision, the universe essentially wrapped things up over the next three sessions. That dominant vision took me far into humanity’s evolutionary future.\n\nJef Baker: What insights did that window of deep time give you about our future direction?\n\nChris Bache: Starting around the 23rd session, and then in a punctuated way over the years, the universe kept giving me teachings about the human story—what you might call the master story. I don’t mean that arrogantly; it’s simply what kept coming. It emphasized we were approaching a crescendo—a true turning point, a before-and-after in our evolutionary journey. After thousands and hundreds of thousands of years of struggling—in a reincarnational framework, which I accept—the message was that humanity was coming to a decisive pivot in its larger story.",
        "ts_url": "https://youtu.be/B0BhUOEP1Mg?t=2879",
        "archival_title": "Bicycle Day Conversation with Jef Baker",
        "recorded_date": "2020-04-19",
        "start_hhmmss": "00:47:59",
        "_score": 0.6238871812820435
      },
      {
        "text": "d change. Our very constitution—the form of our species—is a stage in a longer evolutionary journey.\nSixth: the future human. At one point, I was given a brief experience of the future human we are becoming. I was carried deep into the distant future and allowed to experience what will be the abiding state of humanity at that time. What a magnificent being. Just touching it filled me with rapture, calm, and sheer delight. It felt clear, warm, and whole. There was an abiding sense of oneness that went deeper than the feeling of being interconnected; it was a feeling of being truly one underneath the diversity of life. Such expansiveness, such breadth of being—fully embodied spiritual realization, the tantric awakening of our entire species, spirit and matter in perfect balance. This penetrating glimpse transfixed me. Its beauty, grandeur, and simplicity pierced my heart.",
        "ts_url": "https://youtu.be/-xbx5HnOFmA?t=1912",
        "archival_title": "A Visionary Experience of the Birth of the Future Human",
        "recorded_date": "2020-10-04",
        "start_hhmmss": "00:31:52",
        "_score": 0.6227526664733887
      },
      {
        "text": "back for that one. It’s really good to bear these things in mind as we move through intense periods.\nChris Bache: Let’s allow ourselves to look deep into the future of this future human. Whatever transformation we’re going through—and we agree it’s acute, giving birth to a new order of human capacity—however long it takes, the human story isn’t stopping. The evolutionary drama isn’t ending. This is a new platform within which the story will continue to develop. We’ve been evolving by learning from suffering, our great teacher in much of the past, but we’re getting past that—just as we’re growing out of our fear of death. If there were one thing I wish I could give people from my sessions, it would be to lose the fear of death. If you’re afraid of death, your cosmology is upside down. You don’t understand what’s going on. Death is graduation. Death is the great respite, the great reward.",
        "ts_url": "https://youtu.be/5Lus4MLlzbA?t=2863",
        "archival_title": "Contemplating Reincarnation – Part 3",
        "recorded_date": "2021-03-27",
        "start_hhmmss": "00:47:43",
        "_score": 0.6204432845115662
      },
      {
        "text": "ness. So bless you, brother, and thank you for your life of contribution and service to that future.\nChris Bache\nAnd you too, brother. As we transition into questions and answers, I want to share a view I think we both hold: this century is a century of labor. We have been gestating the future human for tens of thousands, hundreds of thousands of years through reincarnation—over and over, deeper and deeper. But now we’ve come into labor. Gestation is long; labor is short. Gestation can be gentle while life goes on at the surface; labor is intense. It requires a complete interruption of ordinary life and a deep turning within. We are in the process of collectively giving birth to what I call the future human. Many have seen and felt it—Homo spiritualis, Homo noeticus, different names—but the fundamental idea is the same: we are giving birth to a more evolved form of humanity.",
        "ts_url": "https://youtu.be/TeifW7GZ9xI?t=5541",
        "archival_title": "Wisdom Keepers conversation with Duane Elgin",
        "recorded_date": "2023-01-30",
        "start_hhmmss": "01:32:21",
        "_score": 0.6174153089523315
      },
      {
        "text": "rth of the human species. You said, “Nothing is predestined. It’s up to us.” That’s a big statement.\nChris Bache:\nIf everything were predestined, there’d be no point to incarnating. If everything had to be the way it’s got to be, we wouldn’t be learning, and there would be no adventure here. It’s open-ended. We could lose the planet. We could lose this opportunity. It’s going to require our very, very best and deepest efforts to come through this changed and built better.\n\nRoger Walsh:\nSo your vision may not be, “This is the way it’s going to be,” but rather, “Here is the possibility to which we can open ourselves.”\n\nChris Bache:\nYes, and I have to acknowledge that. Sometimes people who nearly die have, as part of their life review, a life preview. Sometimes what they see of the future comes true, and sometimes they see a future they can change. I talk about this in Ken Ring’s work, Heading Toward Omega. If they’re seeing a future they can change, they’re seeing a conditional future, not an absolute preset future. So what I’m seeing is a possible future—maybe even a probable future—but still a future we have to enact.",
        "ts_url": "https://youtu.be/-2NMOMvRkYE?t=5004",
        "archival_title": "Evolution of Collective Consciousness (Deep Transformation Podcast – Part 1)",
        "recorded_date": "2022-01-20",
        "start_hhmmss": "01:23:24",
        "_score": 0.6156095266342163
      },
      {
        "text": "y deep Breathwork experiences that were, in many respects, comparable to my psychedelic experiences.\nTeresa Marie\nThank you. You also talk about the future human and the suffering involved in transformation—which is a shame, but it propels us. Can you share more about your visions? Have some of what you saw in the ’90s come to pass, or are you still waiting?\n\nChris Bache\nThe consistent theme in my sessions was positive: humanity is coming to a turning point in history—a collective spiritual explosion—driven from underneath, as if decided at a cosmological level, rising up through us and surfacing in our individual lives. It’s larger than the sum of our individual efforts.",
        "ts_url": "https://youtu.be/icBasHgjzsY?t=3193",
        "archival_title": "LSD and the Mind of the Universe – Christopher Bache, Ph.D.",
        "recorded_date": "2021-06-03",
        "start_hhmmss": "00:53:13",
        "_score": 0.6044822335243225
      }
    ]
  },
  "meta": {
    "date": "2025-10-22"
  }
}