{
  "meta": {
    "qid": "atman-brahman",
    "title": "Atman = Brahman (The Identity of Self and Source)",
    "date": "2025-10-22",
    "version": "v1",
    "source_policy": "Book-first. Public transcripts as color with timestamped links."
  },
  "book": {
    "chunks": [
      {
        "text": "s like you found that Atman is Brahman—that we are part of the Divine, and the Divine is part of us.\nChris Bache:\nYes—and there’s very little that’s new in the experiences I lay out. The vision of reality, the cosmology that emerges out of psychedelic work, is fundamentally the same as what emerges out of the deepest, most refined levels of the world’s mystical traditions. We’re not bringing something radically new to the table. What we have is a different protocol, a different strategy for accessing these very deep levels of reality, which yield deep insights into the structure of existence. But you’ll find the same fundamental cosmology in the great spiritual traditions.\n\nEmmy Vadnais:\nSince you brought up the Hubble telescope, and we’ve been talking about consciousness, what did you discover about our universe—the physical universe, space, outer space? Did you traverse that aspect in your sessions?",
        "citation": "Bache · 2025-03-18 · New Thinking Allowed · Psychedelics and the Cosmic Mind",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "_score": 0.5972399711608887
      },
      {
        "text": "osophy of religion, not just for psychology, and I knew I wanted to get involved in doing this work.\nSo even though LSD had been made illegal in 1970, I chose to conscientiously break the law and begin a series of rigorously structured sessions following Stan’s protocol. After three medium-dose sessions, I chose to work at high doses. This is a protocol I don’t recommend today. I would be much gentler on myself if I were doing it over again, but at the time this is what I was doing to accelerate my own spiritual development. Quickly it evolved into engaging the deep structures of human evolution and trying to support humanity’s spiritual development, and then exploring this marvelous universe that we are part of.\n\nTami Simon\nYou write toward the beginning of the book, “In the end, what’s important is not the method of exploration used, but what this method shows us about the extraordinary universe we live in.” That’s what I want to focus on—really the discoveries that you made. Let’s start with the title: LSD and the Mind of the Universe. I’m not sure everyone can track with you there—the universe has a mind? Tell us what you discovered.",
        "citation": "Bache · 2023-07-12 · Sounds True · Diamonds from Heaven: Exploring the Mind of the Universe",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Diamonds from Heaven: Exploring the Mind of the Universe",
        "_score": 0.5910250544548035
      },
      {
        "text": "on, deep meditation, or psychedelic journeying. Feel free to share some of your experiences in that.\nChris Bache: Well, I’ve done that as carefully as I can in my book, LSD in the Mind of the Universe. The invitation is to appreciate that we only became conscious of the Mother Universe about 5,000 years ago—when we developed sufficient discipline to drop beneath the conditioning of our individual egoic mind and tap into the stream of consciousness we share with all life. We’ve been walking upright for 5.8 million years, operating with our larger brain for about 200,000 years. Writing came in about 5,000 years ago; the Upanishadic breakthroughs, three to four thousand years ago. But these are nothing compared to the billions of years ahead. We’re just waking up to who we are, so naturally we get confused given the enormity of what we’re growing into.",
        "citation": "Bache · 2021-03-16 · Gene Keys · Contemplating Reincarnation – Part 2",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Contemplating Reincarnation – Part 2",
        "_score": 0.5734643340110779
      },
      {
        "text": "a journey. The publisher wanted a more marketable title, and that’s LSD in the Mind of the Universe.\nThe beginning of this book goes back over 40 years. In 1978, when I began graduate school, I encountered Stanislav Grof’s work. His book Realms of the Human Unconscious turned my life around, followed quickly by LSD Psychotherapy. He gave me the method and the confidence to explore my consciousness and, through that exploration, to come to know the deep psyche—the deep universe—better. I want to emphasize I did this work as a philosopher. I was not a therapist. I wasn’t primarily seeking healing—though healing did come—but seeking to understand our universe as deeply as I could by exploring my consciousness as deeply as I could.",
        "citation": "Bache · 2019-11-13 · Trust Psyche · LSD & the Mind of the Universe: Diamonds from Heaven",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD & the Mind of the Universe: Diamonds from Heaven",
        "_score": 0.5722051858901978
      },
      {
        "text": "eally look forward to sharing the experiences I report in my book, LSD and the Mind of the Universe.\nDavid has framed our conversation as the question of whether we can all access the cosmic mind using psychedelics. I believe that we all can, but whether we all should is another matter entirely. In contrast to the early idea that psychedelics represent a shortcut to mystical experience, my concern is that the psychedelic journey into the cosmic mind is extremely demanding and must be approached with great care and caution.\n\nIn LSD and the Mind of the Universe, I describe experiences that opened in 73 high-dose LSD sessions conducted over 20 years when I was a young man between 30 and 50 years old, from 1979 to 1999. I then spent another 20 years thinking about these experiences, digesting them, mapping them, and pondering their implications. I hope the visions I brought back will be useful not only to other psychonauts but also to those who would never take a psychedelic themselves. What’s important is the vision of the cosmos they contain, and a vision of where humanity is in its long evolutionary journey and the turning point we’re coming to.",
        "citation": "Bache · 2022-12-07 · Scientific & Medical Network · LSD & the Mind of the Universe (SMN webinar)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD & the Mind of the Universe (SMN webinar)",
        "_score": 0.5714929699897766
      },
      {
        "text": "the LSD work—but LSD and the Mind of the Universe focuses on what happened in the high-dose journey.\nThe circumstances were unusually stable, concentrated, and focused: the same sitter for years, same set and setting, intention, location (Northeast Ohio), substance, dose level, and the same recording process—always recording each session as completely as possible within 24 hours. When you stabilize your work—eliminate variables, use the same methodology consistently—it stabilizes the conversation between you and the creative intelligence of the universe. It stabilizes the communion so that one session leads to the next in a coherent, intelligent manner. You may not understand the continuity as it unfolds, but over time you see patterns and feel you’re engaging a single creative intelligence. I say that carefully—there are many layers and forms of intelligence—but across sessions the continuity is unmistakable.",
        "citation": "Bache · 2021-03-29 · Spirit Plant Medicine · Chris Bache – LSD and the Mind of the Universe – SPMC 2019",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Chris Bache – LSD and the Mind of the Universe – SPMC 2019",
        "_score": 0.5703820586204529
      },
      {
        "text": "on: from the personal to the collective, into subtler and causal levels of reality, and Non-duality.\nA reporter once asked me that question and I made a list of highlights; I included it in the last chapter of the book. I can’t remember them all now, so I’ll approximate. I discovered that underlying all existence is a singular intelligence of unbelievable magnitude—a creative genius—and that the physical universe is the manifest body of this intelligence. The world we’re living in is the physical body of the Divine. None of this is new. The cosmology that emerges in psychedelics essentially matches the cosmology of the great mystical traditions of classical contemplative cultures. It’s a different technique—a different trigger protocol—for accessing these dimensions, but the teachings are familiar.",
        "citation": "Bache · 2025-05-18 · New Thinking Allowed · Diamond Luminosity (live stream)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Diamond Luminosity (live stream)",
        "_score": 0.5648922920227051
      },
      {
        "text": "e Mind of the Universe—which is a strange book for a professor of religious studies to have written.\nRight at the beginning of my academic career, in 1978, I had just finished graduate work at Brown in philosophy of religion, and I met the work of Stan Grof. I immediately recognized that his research in LSD and psychedelics in general was extraordinarily important—not just for clinical psychology and therapy, but for philosophy, which was what interested me most. Even though it was illegal, I began a quiet, private psychedelic practice that continued for 20 years. I worked for four years, then stopped for six years for reasons I describe in the book, then worked for another 10 years. This was from ’79 to ’99, when I was 30 to 50. I then spent the next 20 years digesting those experiences—trying to absorb them, extrapolate, and clarify the cosmological implications—and then I published LSD in the Mind of the Universe. That’s the brief sketch of what brings me here.",
        "citation": "Bache · 2023-12-05 · Numinus Network · What 73 High-Dose LSD Sessions Taught Christopher Bache",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "What 73 High-Dose LSD Sessions Taught Christopher Bache",
        "_score": 0.5616669058799744
      },
      {
        "text": "n as we know it? If you have, you’re in luck, because that’s exactly what we’re going to talk about.\nWe’re speaking with Christopher Bache, author of LSD and the Mind of the Universe. Christopher M. Bache is a Professor Emeritus in the Department of Philosophy and Religious Studies at Youngstown State University, where he taught for 33 years; a Fellow at the Institute of Noetic Sciences; adjunct faculty at the California Institute of Integral Studies; and on the advisory board for Grof Transpersonal Training and the Grof Foundation. He’s an award-winning teacher and international speaker, the author of three books, and he’s been on the show previously—Episode 89, Mapping Consciousness with High Dose LSD—where we talked about his 73 high-dose LSD journeys over 20 years and what he learned about the nature of reality and the universe.",
        "citation": "Bache · 2021-04-21 · Adventures Through the Mind · Global Collapse, Spirituality & The Birth of the Future Human (ATTMind #142)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Global Collapse, Spirituality & The Birth of the Future Human (ATTMind #142)",
        "_score": 0.5587643384933472
      },
      {
        "text": "Mind of the Universe, which is a strange book for a professor of religious studies to have written.\nRight at the beginning of my academic career, 1978, I had just finished my graduate work at Brown in philosophy of religion, and I met the work of Stan Grof. I immediately recognized that his research in LSD—psychedelics in general—was extraordinarily important, not just for clinical psychology and therapy, but for philosophy, which was what interested me the most. And so I began, even though it was illegal, a quiet, private psychedelic practice, which ended up continuing for 20 years. I worked for four years, stopped for six years for reasons I describe in the book, and then I worked for another 10 years, and then I spent another 10 years digesting the work. This was from ’79 to ’99, when I was 30 to 50, and then I spent the next 20 years trying to absorb those experiences and clarify their cosmological implications. Then I published LSD and the Mind of the Universe. That's a brief sketch of what brings me here.",
        "citation": "Bache · 2024-09-24 · Numinus Network · What 73 high dose LSD sessions taught Christopher Bache PhD about the nature of reality (Rebroadcast)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "What 73 high dose LSD sessions taught Christopher Bache PhD about the nature of reality (Rebroadcast)",
        "_score": 0.5565263628959656
      },
      {
        "text": "h my beloved, did I realize the true cost of overextending myself so deeply into the transcendental.\nSandy Sedgbeer: Before we go to a break, one question. You said the universe is the body of God. What are we?\n\nChris Bache: We are part of the universe, so we are part of the body of God too—part of the manifestation of the universe’s intention to create. Our body is rooted in quantum and atomic reality; the evolutionary story is built into our nerves, vascular systems, and organs. Likewise, our minds are part of the creative intelligence manifesting existence. When we go deep into mind and drop beneath the depths of the personal mind, there’s no floor—we fall into the mind of the species, then into the mind of the universe. Then the Hindu teaching Atman is Brahman—the essence of the individual is the essence of the totality—becomes the most natural core truth. Another core truth is oneness: Brahman is one, and we are a fractal manifestation of that oneness. Once known, even when you return to paying bills and the tasks of the physical world, all you have to do is step back to re-appreciate these deeper truths—the deeper pulsing of life.",
        "citation": "Bache · 2023-08-17 · OMTimesTV / Sandie Sedgbeer · LSD & the Mind of the Universe (What Is Going OM)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD & the Mind of the Universe (What Is Going OM)",
        "_score": 0.5558169484138489
      },
      {
        "text": "springs. So: personal mind, collective mind, archetypal mind, the One Mind, and Diamond Luminosity.\nTasshin Fogleman:\nI'd like to return to that. One of the themes in your work is giving a really persuasive case for reincarnation. I already sort of believed in reincarnation from my own explorations, but you make a really solid case for it. You wrote a book, Life Cycles, about it, and then later on, in your most recent book, LSD and the Mind of the Universe, you said there were things you didn’t quite get to in that book. Could you describe your current understanding of reincarnation?\n\nChris Bache:\nAs a philosopher, I think reincarnation is a fundamental concept to examine, because philosophical traditions diverge: if you believe there is no reincarnation versus if you believe there is, you end up with two different understandings of reality. Early in my academic career, I looked seriously at whether there is empirical evidence for reincarnation. Fifty years ago, this evidence did not exist, but today it does. I think we have ample empirical evidence that reincarnation is a simple fact of life.",
        "citation": "Bache · 2022-08-30 · Tasshin Fogleman · Psychedelics and Cosmological Exploration with Chris Bache – Reach Truth Podcast",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Psychedelics and Cosmological Exploration with Chris Bache – Reach Truth Podcast",
        "_score": 0.5556855201721191
      },
      {
        "text": "LSD and the Mind of the Universe is the memoir of a psychedelic explorer. It is the story of one person’s journey into the mind of the cosmos. I’ve tried to tell this story as concisely as I can, focusing on the journey itself and keeping theoretical discussion to a minimum. I will rely on other authors to give the reader the history and science of psychedelics, their psychopharmacology, and their clinical applications. I share my psychedelic experiences here not because I think they are special or unique, for they are not, but because, all things considered, they are the most valuable gift I have to offer the psychedelic conversation.",
        "citation": "LSDMU",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "",
        "_score": 0.6329189538955688
      },
      {
        "text": "And last, this book has two titles, what Tibetans would call an outer title and an inner title. LSD and the Mind of the Universe is its outer title, describing what the book is about—exploring the mind of the universe through carefully conducted LSD sessions. Diamonds from Heaven is its inner title, describing its innermost essence, for at the center of the mind of the universe, one enters the infinite clear light of Diamond Luminosity.",
        "citation": "LSDMU",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "",
        "_score": 0.6160548329353333
      },
      {
        "text": "*LSD and the Mind of the Universe is primarily a* cosmological narrative, not a therapeutic narrative. In a therapeutic narrative, the personal details are important; in a cosmological narrative, they are less so. Of course, this entire journey was deeply personal and I own it as such, but my personal story is not the important story here, nor is it essential to the story I want to convey. It is when one moves beyond the shoals of the personal psyche and enters the ocean of the deep psyche that the larger and more philosophically interesting story begins to emerge.",
        "citation": "LSDMU ch.1 §8 ¶7",
        "chapter_code": "1",
        "section_code": "8",
        "archival_title": "",
        "_score": 0.5494024753570557
      },
      {
        "text": "Oneness is a good place to stop one’s journey if one chooses to do so, for here the fragmentation of life is healed and we rest in the “true condition.” Here we learn that the essence of the individual is the essence of the Totality, that Atman is Brahman. Here we learn that all beings are empty of self-existence, that we all rise and fall together in the infinite field of the Creative Intelligence. But if we press on, if we seek to know Brahman even more intimately, we will undergo more periodic meltdowns as we are drawn even deeper into the infinite beauty and grandeur of the cosmos.",
        "citation": "LSDMU ch.8 §1 ¶17",
        "chapter_code": "8",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.5208369493484497
      },
      {
        "text": "Our mystical traditions tell us that we are made of the stuff of God, that Atman is Brahman, and my sessions affirm this truth. But something special happens to this Atman-essence inside the incubator of the physical universe beyond just waking up to itself. In repeatedly entering and leaving physical reality, in the firing and cooling of awareness, in the constant folding and refolding of human experience, something new is being forged—not simply adding new layers one by one but eventually *fusing all these layers into a new form of life*. Our Essential Nature not changed but actualized into a higher expression.",
        "citation": "LSDMU ch.8 §1 ¶37",
        "chapter_code": "8",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.5160631537437439
      },
      {
        "text": "As I have been working on LSD and the Mind of the Universe, my absorption of my psychedelic experiences has deepened in unexpected ways. They are beginning to live in me differently than before and I in them. It feels like my session memories have come together to form a greater living whole and that the inside and outside of my life are moving toward a new synthesis. There is a saying from the Navajo: “When you put a thing in order, and give it aname, and you are all in accord, it becomes.” By telling my story, by giving it aname and owning my experience, something new has been set in motion. A new peace has settled over me. At first this peace eased my existential loneliness and made the loss of communion more bearable, but then it deepened further. As I was finishing the book and beginning to speak about it publicly, a new spiritual transparency began to open in my life. It sometimes feels as though the Beloved is not waiting for me to die but is coming for me here. Where this will lead, I don’t know. It is still unfolding, taking me to new places, but surely this is the work of integration—to own, internalize, and manifest your experiences as deeply as you can. To let them flow through you and shape your presence on this Earth.",
        "citation": "LSDMU ch.12 §3 ¶5",
        "chapter_code": "12",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.4996868073940277
      },
      {
        "text": "Assume for the moment that through the fiery exercises of psychedelic exploration we have managed to stabilize experience at the high subtle level of consciousness. In order to reach this level, what “we” are has changed. We are no longer our private selves but have temporarily become some aspect of subtle level reality. Inside our sessions, we live as a life-form that breathes this rarified air. When through further exercises a doorway opens to still deeper levels of consciousness at the causal level, my experience has been that it allows a *cosmic communion* to take place between the causal and subtle realms. Deep communes with deep. Bringing different levels of spiritual reality into conscious communion with each other, even if for only a few hours, seems to nourish and bring joy to the weave of existence as the “below” remembers the “above” and the blessings of “above” pour more freely into the “below.” What is taking place is a cosmic dance between deep levels of the divine fabric. It is God communing with God, nourishing Its self-manifesting, self-emergent being in ways we may glimpse but perhaps never fully comprehend.",
        "citation": "LSDMU Appendix I §1 ¶22",
        "chapter_code": "",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.4987839162349701
      },
      {
        "text": "When the shell of the private mind dissolves in psychedelic practice, experience opens to a landscape so vast it’s hard to find the right words to describe it—the Mind of the Universe, the Cosmic Mind, the Great Expanse. One falls into it, explodes into it, melts into it, sometimes cataclysmically, sometimes so gently it feels like the most natural thing in the world. We are not in control of these expeditions. We show up, do the work, and make our requests, but in this collaboration a larger intelligence sets the course. What we experience seems to be a combination of what the universe wants us to know and what we are capable of knowing. If we drop into this ocean too quickly, we will lose our bearings and won't be able to bring back much of value. But if we use these hours conscientiously, this intelligence will take us in and teach us. Here all instruction is by initiation. We learn by becoming. The lessons are repeated again and again until our grasp of the material is secure, then new layers are added until the fuller picture emerges.",
        "citation": "LSDMU ch.9 §0 ¶3",
        "chapter_code": "9",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.4881681799888611
      },
      {
        "text": "Experiencing human existence as a completely unified field made everything much easier to understand. The latticework of Mind that saturates and coordinates our individual lives has a logic to it that subsumes our individual perspectives. Today, physical reality was dissolving into its underlying matrix, and with it the reality of individual psyches disappeared. What I had previously conceptualized in atomistic terms as individual people choosing to reincarnate in order to clear their personal karmic patterns, I was now experiencing as a centralized decision to incarnate entire generations to cleanse the human mind-field of its collective karmic legacy. I saw no sustainable distinctions between individuals, only the web of life operating in an integrated, unified manner.",
        "citation": "LSDMU ch.7 §7 ¶9",
        "chapter_code": "7",
        "section_code": "7",
        "archival_title": "",
        "_score": 0.48805153369903564
      },
      {
        "text": "Buddhism teaches that there are no separate things in existence, that all conditioned reality is characterized by *śūnyatā*, “emptiness” or “transparency.” As the Dalai Lama explains in *The Universe in a Single Atom*, “Things and events are ‘empty’ in that they can never possess any immutable essence, intrinsic reality or absolute ‘being’ that affords independence” (2005). Nothing holds its existence by itself but is always transparent to the underlying matrix of cause and effect. When one experiences emptiness, one experiences the complete absence of an independent self, not only in one’s own person but in all reality. In this session, I experienced emptiness and Oneness as two sides of the same coin. When we experience the universe as One, it is clear that independent, separate things do not exist. Conversely, when the separate self dissolves completely, the Oneness of life spontaneously rises in our awareness.",
        "citation": "LSDMU ch.8 §0 ¶17",
        "chapter_code": "8",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.4875509738922119
      },
      {
        "text": "That the universe is the manifest body of a Divine Being of unimaginable intelligence, compassion, clarity, and power, that we are all aspects of this Being, never separated from it for a moment, that we are growing ever more aware of this connection, that physical reality emerges out of Light and returns to Light continuously, that Light is our essential nature and our destiny, that all life moves as One, that reincarnation is true, that there is a deep logic and significance to the circumstances of our lives, that everything we do contributes to the evolution of the whole, that our awareness continues in an ocean of time and a sea of bliss when we die, that we are loved beyond measure and that humanity is driving towards an evolutionary breakthrough that will change us and life on this planet at the deepest level. (Bache 2017)",
        "citation": "LSDMU ch.12 §3 ¶3",
        "chapter_code": "12",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.4821791648864746
      },
      {
        "text": "If the ultimate goal of spiritual practice is the permanent transformation of our consciousness, then the soft underbelly of psychedelics is their temporary nature. LSD plunges us into intense spiritual exercises, holds us there for a while, and then brings us back. Clearly, we cannot stay where we have gone; it is a mistaken strategy to try to do so. We must accept these limitations and work with them. But how can we work with these temporary states in a way that will advance our permanent transformation?",
        "citation": "LSDMU ch.1 §3 ¶4",
        "chapter_code": "1",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.48155492544174194
      },
      {
        "text": "LSD and the Mind of the Universe is the memoir of a psychedelic explorer. It is the story of one person’s journey into the mind of the cosmos. I’ve tried to tell this story as concisely as I can, focusing on the journey itself and keeping theoretical discussion to a minimum. I will rely on other authors to give the reader the history and science of psychedelics, their psychopharmacology, and their clinical applications. I share my psychedelic experiences here not because I think they are special or unique, for they are not, but because, all things considered, they are the most valuable gift I have to offer the psychedelic conversation.",
        "citation": "LSD and the Mind of the Universe",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "",
        "_score": 0.6329189538955688
      },
      {
        "text": "And last, this book has two titles, what Tibetans would call an outer title and an inner title. LSD and the Mind of the Universe is its outer title, describing what the book is about—exploring the mind of the universe through carefully conducted LSD sessions. Diamonds from Heaven is its inner title, describing its innermost essence, for at the center of the mind of the universe, one enters the infinite clear light of Diamond Luminosity.",
        "citation": "LSD and the Mind of the Universe",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "",
        "_score": 0.6160548329353333
      },
      {
        "text": "Let me draw upon Sri Aurobindo’s involutionary/evolutionary cosmology here because it resonates strongly with the cosmology that emerges in psychedelic work, as Stan Grof has demonstrated in his beautiful book *The Cosmic Game*. According to Sri Aurobindo, in the cascading involution of the Divine, many levels of existence are manifested. While these levels may be porous from “above,” they are less porous from “below.” Like looking through a series of one-way mirrors, the Divine looking “down” sees everything It has become, but looking “up” from lower levels, the Divine sees less. When we who are below manage either by hard labor or by grace to access some of these higher levels, a special magic sometimes takes place.",
        "citation": "LSDMU Appendix I §1 ¶21",
        "chapter_code": "",
        "section_code": "1",
        "archival_title": "",
        "_score": 0.4796413779258728
      },
      {
        "text": "I understand the debate among Buddhist practitioners over psychedelics and the reservations some teachers have about them as agents of spiritual transformation. And yet, personally, I never felt a contradiction between my Buddhist practice and my psychedelic practice. A difference in emphasis, method, and even goals, perhaps, but no contradiction in core values. I do not believe that the Buddhist prohibition against “taking drugs that cloud the mind” applies to psychedelic substances *when they are used therapeutically*, because in these circumstances they do not cloud the mind. Just the opposite, they hypersensitize the mind, and by skillfully focusing this hypersensitivity, we can bring the poisons and toxins of our mind to the surface and remove them. I think Chögyam Trungpa was correct when he described LSD as a kind of “super-samsara.” LSD amplifies the samsaric tendencies of our mind and invites a confrontation with these tendencies that, if handled well, supports the liberation of the mind. Though my psychedelic journey became a cosmological exploration that reached beyond liberation, it always felt congruent with liberation.",
        "citation": "LSDMU ch.10 §3 ¶13",
        "chapter_code": "10",
        "section_code": "3",
        "archival_title": "",
        "_score": 0.4775017499923706
      },
      {
        "text": "In deep psychedelic work, *one learns by becoming*. This is especially true when working with high doses of a powerful psychedelic like LSD. We cannot transport the egoic self into these depths where it can then “have an experience” of how the world works there. In order to know the universe at these levels, we must *become* a citizen of these levels. We must *become* the levels themselves. To do this, our smaller sense of self must cease to be the container of our experience. It must die. Giving up everything is simply the price of inheriting everything else.",
        "citation": "LSDMU ch.1 §12 ¶6",
        "chapter_code": "1",
        "section_code": "12",
        "archival_title": "",
        "_score": 0.4679522216320038
      },
      {
        "text": "In the Cosmic Tour, I had explored the universe as a reality outside myself; in this session, I explored the universe as a dimension of my own being. This shift reflects the broader transition that takes place as one moves from the subtle level of consciousness, with dualism intact, into nondual causal consciousness. The peace of returning to the Oneness that swallows all partitions awakened a seed of remembering that changed me deeply, not instantaneously, but slowly over many years.",
        "citation": "LSDMU ch.6 §0 ¶101",
        "chapter_code": "6",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.46689558029174805
      },
      {
        "text": "In this context, I will mention that this may be one advantage of the long LSD time window compared with short-acting psychedelics like 5-MeO-DMT. LSD does not blast you through the many layers of the cosmos as quickly as 5-MeO-DMT does, but the eight-hour LSD interface invites/propels/forces a polishing of the consciousness doing the exploring as it is impacted/ instructed/healed by the consciousness being explored. An LSD session grinds slow but it grinds fine. It gives us time to be engaged and changed by the realities we are encountering. I think this polishing influences both the eventual clarity of our perception in these states and what we are able to bring back from them, both in terms of healing and understanding.",
        "citation": "LSDMU ch.1 §9 ¶4",
        "chapter_code": "1",
        "section_code": "9",
        "archival_title": "",
        "_score": 0.46247628331184387
      },
      {
        "text": "As the negative perinatal experiences continued to build over the next several sessions, so did the positive experiences that emerged during the ecstatic portion of the sessions. In one session, I experienced life as a living fabric of interwoven intelligences—atomic, molecular, cellular, human, societal, and planetary. This early taste of the weave of Oneness was just a metaphysical appetizer for the deeper experiences of Oneness that would follow later, so I will not spend time on it. I would, however, like to share one experience from this period because it speaks to the rationale for this book as a whole. This session helped me let go of my conventional academic training and embrace psychedelics as anew method of philosophical inquiry.",
        "citation": "LSDMU ch.2 §2 ¶13",
        "chapter_code": "2",
        "section_code": "2",
        "archival_title": "",
        "_score": 0.46127623319625854
      },
      {
        "text": "At the *causal level* of consciousness, the world of separate parts begins to yield to an experience of the universe moving as a single entity. There are many ways of experiencing this vast domain, but for me the signature of causal consciousness is Oneness. Intimations of Oneness show up in lower levels of consciousness as well, for it is a primary truth with many variations, but there is something distinctive about the experience of Oneness at the causal level, where it ripens into a vivid experience of ontological transparency and all-encompassing wholeness. There is no reference point outside this Oneness from which to get a perspective on it, as it is the whole of existence. Here, as Plotinus succinctly put it, “Everything breathes together.” Or as Sri Aurobindo described it, “In this vision of things the universe will reveal itself in its unity and totality as a manifestation of a single Being, Nature as its power of manifestation, evolution as its process of gradual self-revelation in matter.”",
        "citation": "LSDMU ch.1 §10 ¶9",
        "chapter_code": "1",
        "section_code": "10",
        "archival_title": "",
        "_score": 0.4608982801437378
      },
      {
        "text": "LSD unleashes such dramatically different states of awareness from anything we experience in our everyday life that we have to learn how to work with it. Like an athlete undertaking a strenuous sport, we have to train for the event. Not only do our minds have to adjust to the expanded capacities LSD awakens, so do our bodies. Our subtle energy system has to be conditioned and strengthened to sustain the enormous flows of energy evoked by the LSD state. As I look back on these early sessions, they seem to have functioned as an intensive training camp, preparing me physically and psychologically for the long journey that was beginning. They also broke me down existentially, taking me into my first death and rebirth.",
        "citation": "LSDMU ch.2 §0 ¶5",
        "chapter_code": "2",
        "section_code": "0",
        "archival_title": "",
        "_score": 0.4587920904159546
      }
    ]
  },
  "talks": {
    "queries": [
      "atman brahman identity",
      "nonduality",
      "union with source",
      "identity with divine"
    ],
    "chunks": [
      {
        "text": "cy. You say the universe is interested in our experience of it. Why do you believe that is the case?\nChris Bache:\nPart of my experience reflects a classic teaching in some Eastern traditions: the essence of the individual is the same as the essence of the totality—Atman is Brahman. Our nature is the nature of the divine, which is the nature of reality itself. So it’s not completely accurate to frame this as a duality between me and It. At a deeper level, my being is a fractal manifestation of Its reality. Our relationship is deeply essential and mutually participating from the start. But functionally, in terms of Chris Bache, I am so small and It is so vast that there’s a relative duality involved. And between my small bit and the totality are layers upon layers. It’s a very complex, organic system of massive scale.",
        "ts_url": "https://youtu.be/ec0elBHJXAc?t=646",
        "archival_title": "The Mind of the Universe: Diamonds from Heaven",
        "recorded_date": "2023-01-27",
        "_score": 0.5994266867637634,
        "start_hhmmss": "00:10:46"
      },
      {
        "text": "hemselves? It's not just, \"Oh, I am in the universe.\" Is there a sense of being all of that as well?\nChris Bache\nYes, absolutely. At each deeper level, I experienced it less as entering a new reality and more as remembering a dimension of my own existence I'd forgotten. Becoming one with God—or what I prefer to call \"that fundamental reality\" to avoid the baggage of the word \"God\"—isn't about confronting some external deity and merging. It's about remembering the fundamental truth that this is what you are: a manifestation, a fractal embodiment of this divine impulse. As you become larger, you remember more. As you remember more, clarity grows. As clarity grows, you sink deeper into these oceanic currents—in essence, the whole experience is about waking up. It's not dying and being reborn, but realizing your true, natural state.",
        "ts_url": "https://youtu.be/L3D_fSr75u8?t=1848",
        "archival_title": "Mapping Consciousness with High-Dose LSD (ATTMind #83)",
        "recorded_date": "2018-10-12",
        "_score": 0.5913723707199097,
        "start_hhmmss": "00:30:48"
      },
      {
        "text": "sing: surrender completely, open, breathe, receive teachings, then bring it back in and consolidate.\nEmmy Vadnais: What are some of the teachings you received?\n\nChris Bache: That the universe is a manifestation of a single consciousness—a massive consciousness beyond anything we’ve grasped in Western religious and philosophical traditions. Creation is intentional. I hesitate to use “design,” but there is an intelligence manifesting in time and space. We are part of this intelligence; our nature is of the same nature as its nature—Atman is Brahman. Reincarnation is a fact of life. We won’t get far trying to understand existence unless we understand the pulse of life—that our current life is just the most recent in many cycles of life and death. There is an underlying logic to our circumstances—what Buddhists and Hindus call karma—an intentionality working itself out in our lives. Our evolution is not driven solely by blind chance and mechanical processes; there is a deeper intelligence manifesting in our circumstances and challenges, inviting us to become more by the end of life than we were at the beginning. Those are a few touch points.",
        "ts_url": "https://youtu.be/FMgixG6Z0sk?t=1882",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "recorded_date": "2025-03-18",
        "_score": 0.588554859161377,
        "start_hhmmss": "00:31:22"
      },
      {
        "text": "s like you found that Atman is Brahman—that we are part of the Divine, and the Divine is part of us.\nChris Bache:\nYes—and there’s very little that’s new in the experiences I lay out. The vision of reality, the cosmology that emerges out of psychedelic work, is fundamentally the same as what emerges out of the deepest, most refined levels of the world’s mystical traditions. We’re not bringing something radically new to the table. What we have is a different protocol, a different strategy for accessing these very deep levels of reality, which yield deep insights into the structure of existence. But you’ll find the same fundamental cosmology in the great spiritual traditions.\n\nEmmy Vadnais:\nSince you brought up the Hubble telescope, and we’ve been talking about consciousness, what did you discover about our universe—the physical universe, space, outer space? Did you traverse that aspect in your sessions?",
        "ts_url": "https://youtu.be/FMgixG6Z0sk?t=4514",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "recorded_date": "2025-03-18",
        "_score": 0.5838828086853027,
        "start_hhmmss": "01:15:14"
      },
      {
        "text": "creator principle, a God, a divine transhuman intelligence that is holding, guiding, nurturing you?\nChris Bache\nIt’s really not difficult when you move into it. Let’s focus on the Buddhist teaching of anatta—no self—and shunyata—emptiness, which can also be translated as transparency. I endorse Buddhism’s radical agnosticism. It’s an anti-theism in the sense that it critiques every theism proposed as structurally flawed. In its place, Buddhism proposes a pure process understanding of reality: everything is dynamic, constantly changing, fluid, in process. There is no thing that holds existence by itself; you only exist in the interplay of the whole ocean of causality—karmic forces, cosmic down to species down to individual. It’s all an open system. When you wake up to your essential nature, you don’t wake up to a separate thing; you wake up to a fluid process.",
        "ts_url": "https://youtu.be/eV86_iSTEbU?t=1673",
        "archival_title": "Exploring LSD as a Practice (Edge of Mind Podcast – Part 1)",
        "recorded_date": "2022-02-17",
        "_score": 0.5737508535385132,
        "start_hhmmss": "00:27:53"
      },
      {
        "text": "h my beloved, did I realize the true cost of overextending myself so deeply into the transcendental.\nSandy Sedgbeer: Before we go to a break, one question. You said the universe is the body of God. What are we?\n\nChris Bache: We are part of the universe, so we are part of the body of God too—part of the manifestation of the universe’s intention to create. Our body is rooted in quantum and atomic reality; the evolutionary story is built into our nerves, vascular systems, and organs. Likewise, our minds are part of the creative intelligence manifesting existence. When we go deep into mind and drop beneath the depths of the personal mind, there’s no floor—we fall into the mind of the species, then into the mind of the universe. Then the Hindu teaching Atman is Brahman—the essence of the individual is the essence of the totality—becomes the most natural core truth. Another core truth is oneness: Brahman is one, and we are a fractal manifestation of that oneness. Once known, even when you return to paying bills and the tasks of the physical world, all you have to do is step back to re-appreciate these deeper truths—the deeper pulsing of life.",
        "ts_url": "https://youtu.be/2Trb-vC8zc0?t=1922",
        "archival_title": "LSD & the Mind of the Universe (What Is Going OM)",
        "recorded_date": "2023-08-17",
        "_score": 0.5675411224365234,
        "start_hhmmss": "00:32:02"
      },
      {
        "text": "played out in your experience? Because when we die, we become nothing and simultaneously everything.\nChris Bache:\nThe experience was to become one with all of existence—to become one with God, with the universe, with the One. We can’t do that if we’re not one within ourselves—if we have unintegrated shadow, ego fragments, untouchable wounds. When you move into intimacy with life, life brings these unintegrated pieces to the surface so you can make peace with them, reabsorb them, and become whole and coherent within your own being. How could you become one with life if you’re not one with yourself? These things develop synergistically: the deeper your experience of oneness with life, the deeper your experience of oneness with yourself, until these divisions disappear inside. One of the wonderful qualities we appreciate about awakened beings is their integrity, their oneness, their deep relaxation within themselves, which grows out of their intimacy with life itself.",
        "ts_url": "https://youtu.be/-vebDk9FRYU?t=2816",
        "archival_title": "Part II of his Remarkable Twenty-Year Journey into the World of Psychedelics (Edge of Mind Podcast – Part 2)",
        "recorded_date": "2022-06-03",
        "_score": 0.5652457475662231,
        "start_hhmmss": "00:46:56"
      },
      {
        "text": "ding of what’s taking place here. We’ve tagged this for one of our topics for our second discussion.\nRichard Rudd: We plant the seed now. When you go into that kind of worldview, the perfection of the choreography you’re describing is mind-blowing—the interconnectivity of soul groups, fractals, patternings of humans. One of the great insights I got from your “unit mind of the universe” book was a paradox you describe: being an individual soul and yet being everything at the same time. How does that hold up? You described it beautifully—the soul as “open on all sides.” It’s part of the ocean and yet still a focalized drop of awareness.\n\nChris Bache: It seems commonsensical that you can’t be both a part and the whole at the same time—mutually exclusive categories. Even great spiritual teachers—say, the Vedanta tradition—have said the goal of life is to abandon individuality, dissolve it, and be absorbed into the totality, to know the bliss of absorption. In that view, all the individual capacity we’ve developed over incarnations ends in extinction. I think that’s inadequate.",
        "ts_url": "https://youtu.be/jVDndxA6aZo?t=3347",
        "archival_title": "Contemplating Reincarnation (Part 1)",
        "recorded_date": "2021-04-01",
        "_score": 0.5634684562683105,
        "start_hhmmss": "00:55:47"
      },
      {
        "text": "art, but to continue evolving. Do you feel your journey confirms Buddhism, and where does it differ?\nChris Bache\nI’ve been deeply influenced by all the world’s religions. I began as a Christian and a Catholic—four years in seminary studying for the priesthood. I studied Hebrew and Greek for biblical work. I’ve learned so much from Hinduism, Buddhism, Taoism, and Native traditions. The two deepest, longest-lasting influences on me have been Christianity and Buddhism.\n\nI think my journey affirms the deepest truths of Christianity and of all the world’s religions—Judaism’s Kabbalah, Hinduism, Buddhism—while also, in important ways, eclipsing the religions of the last several thousand years. The universe I was initiated into demanded levels of understanding beyond anything I had learned in those traditions. I had to become operational within a deeper metaphysics.",
        "ts_url": "https://youtu.be/Qfet06ORfwY?t=4310",
        "archival_title": "MIND-BLOWING LSD Secrets Revealed – Rebel Spirit Radio",
        "recorded_date": "2021-07-08",
        "_score": 0.5524764060974121,
        "start_hhmmss": "01:11:50"
      },
      {
        "text": "x of cause and effect, continuously arising and passing away. There is no unchanging self over time.\nBut if you can let go of the small, separate ego-self and grow into a deeper individuality—one in continuous exchange with all living beings, continually expanding and developing—the maturation of that selfless kind of individuality is a great spiritual gift of our time-space experience. Two truths hold: the truth of wholeness—oneness, interconnectedness, interpenetration—and the truth of the learning system that experiences, learns, internalizes, and becomes more because of it.\n\nRyan Kemp\nOne thing I grappled with in your book: are we talking about one soul—what many call God—or many individual souls? Which is it, or is it both?\n\nChris Bache\nWe can use language however we like, as long as we’re clear. One can speak of God as the one soul of which we are drops in an ocean of soul—that’s fine. We can also use “soul” to refer to the accumulated experience of all my former lives integrated into a unique individual consciousness, as unique as a fingerprint, within larger matrices: the collective species mind, the planetary mind, the galactic mind. A true individuality emerges.",
        "ts_url": "https://youtu.be/Dw7D7ih8vy0?t=3104",
        "archival_title": "EP.6 - Chris Bache | LSD AND THE MIND OF THE UNIVERSE",
        "recorded_date": "2020-05-13",
        "_score": 0.549514889717102,
        "start_hhmmss": "00:51:44"
      },
      {
        "text": "t worldview and set of assumptions about the nature of self and reality. Would you like to say more?\nChris Bache:\nMy first concern was that it sounded like ego gone amok—ego inflation. I had to sit with that a long time, because my experiences told me that’s not what was happening. As you said, it’s a very different worldview. In the classic individual patient model, the individual is having experiences. The individual has transpersonal experiences, and the individual is always at the center. In this model, my individual existence was completely secondary. It becomes not a matter of my being central. I got the system started, but I dissolved completely into preexisting fields of consciousness. Those fields are the dynamic force having the experiences.\n\nThat manifested not only in the ocean of suffering, but later in archetypal reality and causal oneness. In many experiences, Chris Bache was a bit player. In the book I have an appendix: what dies and is reborn? After so many deaths and rebirths, it becomes a cognitive question. What is actually dying? It feels personal. Is it just ego dying over and over?",
        "ts_url": "https://youtu.be/-2NMOMvRkYE?t=1848",
        "archival_title": "Evolution of Collective Consciousness (Deep Transformation Podcast – Part 1)",
        "recorded_date": "2022-01-20",
        "_score": 0.5492855906486511,
        "start_hhmmss": "00:30:48"
      },
      {
        "text": "of the cosmic process integrating and interpenetrating, liberating each other from their loneliness.\nChris Bache:\nI want to be careful and remind us that a finite mind does its best to give cognitive structure to transcendent experiences. What I’m about to describe is a heuristic: a splitting of the divine principle into two halves—a “male” half that stays outside time and space in a transcendent position, and a “female” half that manifests time and space and the physical cosmos. I don’t literally think in male/female terms, but this is the best my mind could do. The principle is what matters: not all creative intelligence manifests as physical reality. Some holds position outside physical reality. There is a spiritual reality that gives birth to physical reality.",
        "ts_url": "https://youtu.be/ec0elBHJXAc?t=3022",
        "archival_title": "The Mind of the Universe: Diamonds from Heaven",
        "recorded_date": "2023-01-27",
        "_score": 0.5431375503540039,
        "start_hhmmss": "00:50:22"
      },
      {
        "text": "ce and you only miss two or three words. Enjoy. I find him very mind-blowing—but see what you think.\nChris Bache:\n…shared in the animistic community is the belief that nature is infused with consciousness—infused with mind and soul. And, of course, now we know how vast the physical universe is, and the question becomes: how large is the mind of the universe? How deep is it?\n\nI was just out of graduate school in 1978, finishing in philosophy of religion, when I met the work of Stanislav Grof—one of the foremost thinkers in transpersonal psychology and the psychedelic community. I read his book Realms of the Human Unconscious, and my life pivoted. I immediately saw that his research was relevant not only to clinical psychology but also to philosophy. He was offering a method to safely and systematically explore the deepest levels of consciousness where the answers to the philosophical questions I was carrying lay, coming out of training in religious studies.",
        "ts_url": "https://youtu.be/3QxDjWvqKzA?t=722",
        "archival_title": "The Mind of the Universe – Conversation with Prof. Chris Bache",
        "recorded_date": "2022-02-19",
        "_score": 0.5410728454589844,
        "start_hhmmss": "00:12:02"
      },
      {
        "text": "ciousness, the moment we discover that we want to dissolve and disappear altogether? Makes no sense.\nWhat I learned—what I was taught in my sessions—is that the universe wants to support individuality. Not individuality imprisoned in solitary egoic awareness, but a robust individuality of what we might call the soul: open, porous, in constant exchange with the larger rhythms of life. This is the both/and position: when one awakens spiritually, one becomes more—more of an individual than before awakening. When we go deep we discover the oneness—and that oneness is the essence of our individual being. Classic Atman is Brahman: the essence of the individual is the essence of the totality. And Brahman delights in manifesting Atman, in growing Atman, and in Atman waking up to its true nature. That waking up is a stage in a larger evolutionary process of empowerment, learning to become more and more a conscious synthesis of individuality and spiritual totality.",
        "ts_url": "https://youtu.be/eV86_iSTEbU?t=1450",
        "archival_title": "Exploring LSD as a Practice (Edge of Mind Podcast – Part 1)",
        "recorded_date": "2022-02-17",
        "_score": 0.54024338722229,
        "start_hhmmss": "00:24:10"
      },
      {
        "text": "find answers to your question. So, yes, we don’t know—but I think in time we’ll gain more knowledge.\nSimeon Mihaylov:\nHopefully. The other question concerns the soul. In meditation, one of the key insights is non-self—Non-duality, the co-arising of everything. How does that square with a soul reincarnating? What is reincarnating? Is it the doer—the one making choices—or is it the witness, the one that’s conscious of all these things?\n\nChris Bache:\nI’ve had experiences of Non-duality and what Buddhism calls emptiness—Shunyata—emptiness of self, where there is such intimacy that there is no self inside you and no self anywhere in the world. Everything is open, porous, and magnificent. I think it depends on how you conceive the soul. By habit and custom we’ve tended to think of the soul atomistically—as a fundamentally isolated unit that doesn’t change and is separate from other souls. That notion contradicts Non-duality and Shunyata.",
        "ts_url": "https://youtu.be/Kh5aqAuDBIM?t=4394",
        "archival_title": "LSD and the Mind of the Universe – S2S Podcast",
        "recorded_date": "2023-01-06",
        "_score": 0.5368421077728271,
        "start_hhmmss": "01:13:14"
      },
      {
        "text": "cosmological dualism when you say individual versus cosmic, or is it a monism, as you often suggest?\nChris Bache\nI don’t see any dualism in it. If there is a dualism, it’s not of my making; it’s of the universe’s making. The universe begins as one in some fundamental core—pre-Big Bang, instant Big Bang—it begins as one and manifests diversity. I didn’t choose that. You didn’t choose this. The universe chose to manifest diversity. We are part of that diversity. In its process of self-emergence, it chose to empower life to become self-aware and self-empowering. The soul grows and grows—the consciousness that holds the awareness and experience of our multiple lifetimes. We’re expanding. We didn’t choose that; we are discovering a world designed billions of years before we showed up.",
        "ts_url": "https://youtu.be/-vebDk9FRYU?t=5507",
        "archival_title": "Part II of his Remarkable Twenty-Year Journey into the World of Psychedelics (Edge of Mind Podcast – Part 2)",
        "recorded_date": "2022-06-03",
        "_score": 0.5359379649162292,
        "start_hhmmss": "01:31:47"
      },
      {
        "text": "nsciousness. Ultimately, all physical reality is sourced in an ocean of light, an ocean of radiance.\nYou can't take your ego into that reality and have an experience of it. You can only enter those realities by surrendering what you were in the lower realities. It's not that the lower realities are inferior or bad; they are more specific, progressively individualized manifestations of a larger reality. To enter higher levels, you reverse the process: you decouple, let go at deeper levels, so that you literally become, for hours at a time, a citizen of that level of reality. You stop being Chris Bache. You stop being a human being. You stop being a time-space being at all. You literally live and breathe the nature of that existence. There is always a profound sense of homecoming and return. All existence comes from this reality, so there’s a tremendous sense of stillness, calm, reunion—being restored to your primal wholeness. One senses that these levels constantly infuse and inform this reality.",
        "ts_url": "https://youtu.be/wp5V5_Y5rJ8?t=235",
        "archival_title": "LSD and the Mind of the Universe – Full Interview (In Reality)",
        "recorded_date": "2024-06-30",
        "_score": 0.5328065156936646,
        "start_hhmmss": "00:03:55"
      },
      {
        "text": "s we make flowing back into the collective—very similar to Rupert Sheldrake’s morphic fields theory.\nRegina Meredith:\nWe tend to incarnate during different periods of history to purify a previous period of history. But we’re doing it together—as a species—and as soul and tribal, geographic groups.\n\nRegina Meredith:\nWe’re going to get to the Diamond Soul in just a moment. First, one big question, because it’s a common assumption: many believe that reaching oneness is the end of the journey. You once held that belief. What did you discover when you finally experienced oneness?\n\nChris Bache:\nOneness is a profound truth—absolutely foundational across the world’s spiritual traditions. It brings us in touch with our essential nature beneath the variability of our surface nature and generates deep compassion. When you’ve experienced oneness, you naturally become gentle with everyone around you, including yourself. It’s a profound step in our spiritual journey, but I don’t think it’s the final step. Sometimes the end is described as dissolving into the primal void that precedes even the physical universe, but in my experience, even that is not the end.",
        "ts_url": "https://youtu.be/S4XSaHn54P4?t=1985",
        "archival_title": "73 Trips: Inside the Psychedelic Universe",
        "recorded_date": "2023-11-06",
        "_score": 0.5326288938522339,
        "start_hhmmss": "00:33:05"
      },
      {
        "text": "ime, which I recall you relating to bhakti—loving devotion, alleviating the suffering of all beings?\nChris Bache: Yin and yang is an attempt by a particular culture to articulate some of the deep structure of the universe and to point to this primal duality, which then divides into the 10,000 things—the complexity of the evolving of life. But I think we have to be careful not to hang too much on the primary polarity—good/bad, male/female, things like this. Bhakti is a different issue, and this was a surprise to me. In Hinduism there are four systems of spiritual work—four yogas: jnana yoga, the yoga of meditation; karma yoga, the yoga of action; and bhakti, the yoga of emotion. It’s loving God—it’s becoming awakened through love. I had always been attracted to the mental forms of spiritual practice. Of all the yogas in Hinduism, I was least attracted to bhakti—the cultivation of an emotional relationship with the divine—yet I found in the psychedelic work that bhakti was activated, very powerfully activated. I had not only a mental relationship with the universe and a cognitive experience of the universe, but an overwhelmingly powerful emotional connection and experience so that it became a love relationship. Everybody has to develop their own vocabulary for ultimate reality, but my vocabulary for ultimate reality—I call the Absolute “my Beloved,” “the Beloved,” because that’s the bhakti quality.",
        "ts_url": "https://youtu.be/B0BhUOEP1Mg?t=4404",
        "archival_title": "Bicycle Day Conversation with Jef Baker",
        "recorded_date": "2020-04-19",
        "_score": 0.5302958488464355,
        "start_hhmmss": "01:13:24"
      },
      {
        "text": "ividual, but realizing you are inner, you are inter, and you are the wholeness of it all: the intra.\nChris Bache:\nBeautiful again. This has been the ancient message of the spiritual traditions, and now the scientific voice is joining that chorus with its own epistemology. The core message is that the finite self is a limited, functional, contextual self—not an ultimate self. As the Buddha saw in his night of awakening, he saw no self anywhere—not in him, not in anyone else, not in anything else. When one enters deeply into transparency, intraconnected is still too small for it. It’s a wholeness of life where the beginning and ending of my life dissolves completely in the beginning and ending of all other lives, and one dissolves into the communion of life in its totality—functioning in its beautiful individuality and yet in incredibly complex, balanced harmony in community.",
        "ts_url": "https://youtu.be/pYw8ZqCqx18?t=3383",
        "archival_title": "Ego to Oneness, Confronting the Climate Crisis (EP 278)",
        "recorded_date": "2023-10-29",
        "_score": 0.5301716327667236,
        "start_hhmmss": "00:56:23"
      }
    ]
  }
}