{
  "meta": {
    "qid": "atman-brahman",
    "title": "Atman = Brahman (The Identity of Self and Source)",
    "date": "2025-10-22",
    "version": "v1",
    "source_policy": "Book-first. Public transcripts as color with timestamped links."
  },
  "book": {
    "chunks": [
      {
        "text": "s like you found that Atman is Brahman—that we are part of the Divine, and the Divine is part of us.\nChris Bache:\nYes—and there’s very little that’s new in the experiences I lay out. The vision of reality, the cosmology that emerges out of psychedelic work, is fundamentally the same as what emerges out of the deepest, most refined levels of the world’s mystical traditions. We’re not bringing something radically new to the table. What we have is a different protocol, a different strategy for accessing these very deep levels of reality, which yield deep insights into the structure of existence. But you’ll find the same fundamental cosmology in the great spiritual traditions.\n\nEmmy Vadnais:\nSince you brought up the Hubble telescope, and we’ve been talking about consciousness, what did you discover about our universe—the physical universe, space, outer space? Did you traverse that aspect in your sessions?",
        "citation": "Bache · 2025-03-18 · New Thinking Allowed · Psychedelics and the Cosmic Mind",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "_score": 0.5972399711608887
      },
      {
        "text": "osophy of religion, not just for psychology, and I knew I wanted to get involved in doing this work.\nSo even though LSD had been made illegal in 1970, I chose to conscientiously break the law and begin a series of rigorously structured sessions following Stan’s protocol. After three medium-dose sessions, I chose to work at high doses. This is a protocol I don’t recommend today. I would be much gentler on myself if I were doing it over again, but at the time this is what I was doing to accelerate my own spiritual development. Quickly it evolved into engaging the deep structures of human evolution and trying to support humanity’s spiritual development, and then exploring this marvelous universe that we are part of.\n\nTami Simon\nYou write toward the beginning of the book, “In the end, what’s important is not the method of exploration used, but what this method shows us about the extraordinary universe we live in.” That’s what I want to focus on—really the discoveries that you made. Let’s start with the title: LSD and the Mind of the Universe. I’m not sure everyone can track with you there—the universe has a mind? Tell us what you discovered.",
        "citation": "Bache · 2023-07-12 · Sounds True · Diamonds from Heaven: Exploring the Mind of the Universe",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Diamonds from Heaven: Exploring the Mind of the Universe",
        "_score": 0.5910250544548035
      },
      {
        "text": "on, deep meditation, or psychedelic journeying. Feel free to share some of your experiences in that.\nChris Bache: Well, I’ve done that as carefully as I can in my book, LSD in the Mind of the Universe. The invitation is to appreciate that we only became conscious of the Mother Universe about 5,000 years ago—when we developed sufficient discipline to drop beneath the conditioning of our individual egoic mind and tap into the stream of consciousness we share with all life. We’ve been walking upright for 5.8 million years, operating with our larger brain for about 200,000 years. Writing came in about 5,000 years ago; the Upanishadic breakthroughs, three to four thousand years ago. But these are nothing compared to the billions of years ahead. We’re just waking up to who we are, so naturally we get confused given the enormity of what we’re growing into.",
        "citation": "Bache · 2021-03-16 · Gene Keys · Contemplating Reincarnation – Part 2",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Contemplating Reincarnation – Part 2",
        "_score": 0.5734643340110779
      },
      {
        "text": "a journey. The publisher wanted a more marketable title, and that’s LSD in the Mind of the Universe.\nThe beginning of this book goes back over 40 years. In 1978, when I began graduate school, I encountered Stanislav Grof’s work. His book Realms of the Human Unconscious turned my life around, followed quickly by LSD Psychotherapy. He gave me the method and the confidence to explore my consciousness and, through that exploration, to come to know the deep psyche—the deep universe—better. I want to emphasize I did this work as a philosopher. I was not a therapist. I wasn’t primarily seeking healing—though healing did come—but seeking to understand our universe as deeply as I could by exploring my consciousness as deeply as I could.",
        "citation": "Bache · 2019-11-13 · Trust Psyche · LSD & the Mind of the Universe: Diamonds from Heaven",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD & the Mind of the Universe: Diamonds from Heaven",
        "_score": 0.5722051858901978
      },
      {
        "text": "eally look forward to sharing the experiences I report in my book, LSD and the Mind of the Universe.\nDavid has framed our conversation as the question of whether we can all access the cosmic mind using psychedelics. I believe that we all can, but whether we all should is another matter entirely. In contrast to the early idea that psychedelics represent a shortcut to mystical experience, my concern is that the psychedelic journey into the cosmic mind is extremely demanding and must be approached with great care and caution.\n\nIn LSD and the Mind of the Universe, I describe experiences that opened in 73 high-dose LSD sessions conducted over 20 years when I was a young man between 30 and 50 years old, from 1979 to 1999. I then spent another 20 years thinking about these experiences, digesting them, mapping them, and pondering their implications. I hope the visions I brought back will be useful not only to other psychonauts but also to those who would never take a psychedelic themselves. What’s important is the vision of the cosmos they contain, and a vision of where humanity is in its long evolutionary journey and the turning point we’re coming to.",
        "citation": "Bache · 2022-12-07 · Scientific & Medical Network · LSD & the Mind of the Universe (SMN webinar)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD & the Mind of the Universe (SMN webinar)",
        "_score": 0.5714929699897766
      },
      {
        "text": "the LSD work—but LSD and the Mind of the Universe focuses on what happened in the high-dose journey.\nThe circumstances were unusually stable, concentrated, and focused: the same sitter for years, same set and setting, intention, location (Northeast Ohio), substance, dose level, and the same recording process—always recording each session as completely as possible within 24 hours. When you stabilize your work—eliminate variables, use the same methodology consistently—it stabilizes the conversation between you and the creative intelligence of the universe. It stabilizes the communion so that one session leads to the next in a coherent, intelligent manner. You may not understand the continuity as it unfolds, but over time you see patterns and feel you’re engaging a single creative intelligence. I say that carefully—there are many layers and forms of intelligence—but across sessions the continuity is unmistakable.",
        "citation": "Bache · 2021-03-29 · Spirit Plant Medicine · Chris Bache – LSD and the Mind of the Universe – SPMC 2019",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Chris Bache – LSD and the Mind of the Universe – SPMC 2019",
        "_score": 0.5703820586204529
      },
      {
        "text": "on: from the personal to the collective, into subtler and causal levels of reality, and Non-duality.\nA reporter once asked me that question and I made a list of highlights; I included it in the last chapter of the book. I can’t remember them all now, so I’ll approximate. I discovered that underlying all existence is a singular intelligence of unbelievable magnitude—a creative genius—and that the physical universe is the manifest body of this intelligence. The world we’re living in is the physical body of the Divine. None of this is new. The cosmology that emerges in psychedelics essentially matches the cosmology of the great mystical traditions of classical contemplative cultures. It’s a different technique—a different trigger protocol—for accessing these dimensions, but the teachings are familiar.",
        "citation": "Bache · 2025-05-18 · New Thinking Allowed · Diamond Luminosity (live stream)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Diamond Luminosity (live stream)",
        "_score": 0.5648922920227051
      },
      {
        "text": "e Mind of the Universe—which is a strange book for a professor of religious studies to have written.\nRight at the beginning of my academic career, in 1978, I had just finished graduate work at Brown in philosophy of religion, and I met the work of Stan Grof. I immediately recognized that his research in LSD and psychedelics in general was extraordinarily important—not just for clinical psychology and therapy, but for philosophy, which was what interested me most. Even though it was illegal, I began a quiet, private psychedelic practice that continued for 20 years. I worked for four years, then stopped for six years for reasons I describe in the book, then worked for another 10 years. This was from ’79 to ’99, when I was 30 to 50. I then spent the next 20 years digesting those experiences—trying to absorb them, extrapolate, and clarify the cosmological implications—and then I published LSD in the Mind of the Universe. That’s the brief sketch of what brings me here.",
        "citation": "Bache · 2023-12-05 · Numinus Network · What 73 High-Dose LSD Sessions Taught Christopher Bache",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "What 73 High-Dose LSD Sessions Taught Christopher Bache",
        "_score": 0.5616669058799744
      },
      {
        "text": "n as we know it? If you have, you’re in luck, because that’s exactly what we’re going to talk about.\nWe’re speaking with Christopher Bache, author of LSD and the Mind of the Universe. Christopher M. Bache is a Professor Emeritus in the Department of Philosophy and Religious Studies at Youngstown State University, where he taught for 33 years; a Fellow at the Institute of Noetic Sciences; adjunct faculty at the California Institute of Integral Studies; and on the advisory board for Grof Transpersonal Training and the Grof Foundation. He’s an award-winning teacher and international speaker, the author of three books, and he’s been on the show previously—Episode 89, Mapping Consciousness with High Dose LSD—where we talked about his 73 high-dose LSD journeys over 20 years and what he learned about the nature of reality and the universe.",
        "citation": "Bache · 2021-04-21 · Adventures Through the Mind · Global Collapse, Spirituality & The Birth of the Future Human (ATTMind #142)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Global Collapse, Spirituality & The Birth of the Future Human (ATTMind #142)",
        "_score": 0.5587643384933472
      },
      {
        "text": "Mind of the Universe, which is a strange book for a professor of religious studies to have written.\nRight at the beginning of my academic career, 1978, I had just finished my graduate work at Brown in philosophy of religion, and I met the work of Stan Grof. I immediately recognized that his research in LSD—psychedelics in general—was extraordinarily important, not just for clinical psychology and therapy, but for philosophy, which was what interested me the most. And so I began, even though it was illegal, a quiet, private psychedelic practice, which ended up continuing for 20 years. I worked for four years, stopped for six years for reasons I describe in the book, and then I worked for another 10 years, and then I spent another 10 years digesting the work. This was from ’79 to ’99, when I was 30 to 50, and then I spent the next 20 years trying to absorb those experiences and clarify their cosmological implications. Then I published LSD and the Mind of the Universe. That's a brief sketch of what brings me here.",
        "citation": "Bache · 2024-09-24 · Numinus Network · What 73 high dose LSD sessions taught Christopher Bache PhD about the nature of reality (Rebroadcast)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "What 73 high dose LSD sessions taught Christopher Bache PhD about the nature of reality (Rebroadcast)",
        "_score": 0.5565263628959656
      },
      {
        "text": "h my beloved, did I realize the true cost of overextending myself so deeply into the transcendental.\nSandy Sedgbeer: Before we go to a break, one question. You said the universe is the body of God. What are we?\n\nChris Bache: We are part of the universe, so we are part of the body of God too—part of the manifestation of the universe’s intention to create. Our body is rooted in quantum and atomic reality; the evolutionary story is built into our nerves, vascular systems, and organs. Likewise, our minds are part of the creative intelligence manifesting existence. When we go deep into mind and drop beneath the depths of the personal mind, there’s no floor—we fall into the mind of the species, then into the mind of the universe. Then the Hindu teaching Atman is Brahman—the essence of the individual is the essence of the totality—becomes the most natural core truth. Another core truth is oneness: Brahman is one, and we are a fractal manifestation of that oneness. Once known, even when you return to paying bills and the tasks of the physical world, all you have to do is step back to re-appreciate these deeper truths—the deeper pulsing of life.",
        "citation": "Bache · 2023-08-17 · OMTimesTV / Sandie Sedgbeer · LSD & the Mind of the Universe (What Is Going OM)",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "LSD & the Mind of the Universe (What Is Going OM)",
        "_score": 0.5558169484138489
      },
      {
        "text": "springs. So: personal mind, collective mind, archetypal mind, the One Mind, and Diamond Luminosity.\nTasshin Fogleman:\nI'd like to return to that. One of the themes in your work is giving a really persuasive case for reincarnation. I already sort of believed in reincarnation from my own explorations, but you make a really solid case for it. You wrote a book, Life Cycles, about it, and then later on, in your most recent book, LSD and the Mind of the Universe, you said there were things you didn’t quite get to in that book. Could you describe your current understanding of reincarnation?\n\nChris Bache:\nAs a philosopher, I think reincarnation is a fundamental concept to examine, because philosophical traditions diverge: if you believe there is no reincarnation versus if you believe there is, you end up with two different understandings of reality. Early in my academic career, I looked seriously at whether there is empirical evidence for reincarnation. Fifty years ago, this evidence did not exist, but today it does. I think we have ample empirical evidence that reincarnation is a simple fact of life.",
        "citation": "Bache · 2022-08-30 · Tasshin Fogleman · Psychedelics and Cosmological Exploration with Chris Bache – Reach Truth Podcast",
        "chapter_code": "",
        "section_code": "",
        "archival_title": "Psychedelics and Cosmological Exploration with Chris Bache – Reach Truth Podcast",
        "_score": 0.5556855201721191
      }
    ]
  },
  "talks": {
    "queries": [
      "atman brahman identity",
      "nonduality",
      "union with source",
      "identity with divine"
    ],
    "chunks": [
      {
        "text": "cy. You say the universe is interested in our experience of it. Why do you believe that is the case?\nChris Bache:\nPart of my experience reflects a classic teaching in some Eastern traditions: the essence of the individual is the same as the essence of the totality—Atman is Brahman. Our nature is the nature of the divine, which is the nature of reality itself. So it’s not completely accurate to frame this as a duality between me and It. At a deeper level, my being is a fractal manifestation of Its reality. Our relationship is deeply essential and mutually participating from the start. But functionally, in terms of Chris Bache, I am so small and It is so vast that there’s a relative duality involved. And between my small bit and the totality are layers upon layers. It’s a very complex, organic system of massive scale.",
        "ts_url": "https://youtu.be/ec0elBHJXAc?t=646",
        "archival_title": "The Mind of the Universe: Diamonds from Heaven",
        "recorded_date": "2023-01-27",
        "_score": 0.5994266867637634,
        "start_hhmmss": "00:10:46"
      },
      {
        "text": "hemselves? It's not just, \"Oh, I am in the universe.\" Is there a sense of being all of that as well?\nChris Bache\nYes, absolutely. At each deeper level, I experienced it less as entering a new reality and more as remembering a dimension of my own existence I'd forgotten. Becoming one with God—or what I prefer to call \"that fundamental reality\" to avoid the baggage of the word \"God\"—isn't about confronting some external deity and merging. It's about remembering the fundamental truth that this is what you are: a manifestation, a fractal embodiment of this divine impulse. As you become larger, you remember more. As you remember more, clarity grows. As clarity grows, you sink deeper into these oceanic currents—in essence, the whole experience is about waking up. It's not dying and being reborn, but realizing your true, natural state.",
        "ts_url": "https://youtu.be/L3D_fSr75u8?t=1848",
        "archival_title": "Mapping Consciousness with High-Dose LSD (ATTMind #83)",
        "recorded_date": "2018-10-12",
        "_score": 0.5913723707199097,
        "start_hhmmss": "00:30:48"
      },
      {
        "text": "sing: surrender completely, open, breathe, receive teachings, then bring it back in and consolidate.\nEmmy Vadnais: What are some of the teachings you received?\n\nChris Bache: That the universe is a manifestation of a single consciousness—a massive consciousness beyond anything we’ve grasped in Western religious and philosophical traditions. Creation is intentional. I hesitate to use “design,” but there is an intelligence manifesting in time and space. We are part of this intelligence; our nature is of the same nature as its nature—Atman is Brahman. Reincarnation is a fact of life. We won’t get far trying to understand existence unless we understand the pulse of life—that our current life is just the most recent in many cycles of life and death. There is an underlying logic to our circumstances—what Buddhists and Hindus call karma—an intentionality working itself out in our lives. Our evolution is not driven solely by blind chance and mechanical processes; there is a deeper intelligence manifesting in our circumstances and challenges, inviting us to become more by the end of life than we were at the beginning. Those are a few touch points.",
        "ts_url": "https://youtu.be/FMgixG6Z0sk?t=1882",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "recorded_date": "2025-03-18",
        "_score": 0.588554859161377,
        "start_hhmmss": "00:31:22"
      },
      {
        "text": "s like you found that Atman is Brahman—that we are part of the Divine, and the Divine is part of us.\nChris Bache:\nYes—and there’s very little that’s new in the experiences I lay out. The vision of reality, the cosmology that emerges out of psychedelic work, is fundamentally the same as what emerges out of the deepest, most refined levels of the world’s mystical traditions. We’re not bringing something radically new to the table. What we have is a different protocol, a different strategy for accessing these very deep levels of reality, which yield deep insights into the structure of existence. But you’ll find the same fundamental cosmology in the great spiritual traditions.\n\nEmmy Vadnais:\nSince you brought up the Hubble telescope, and we’ve been talking about consciousness, what did you discover about our universe—the physical universe, space, outer space? Did you traverse that aspect in your sessions?",
        "ts_url": "https://youtu.be/FMgixG6Z0sk?t=4514",
        "archival_title": "Psychedelics and the Cosmic Mind",
        "recorded_date": "2025-03-18",
        "_score": 0.5838828086853027,
        "start_hhmmss": "01:15:14"
      },
      {
        "text": "creator principle, a God, a divine transhuman intelligence that is holding, guiding, nurturing you?\nChris Bache\nIt’s really not difficult when you move into it. Let’s focus on the Buddhist teaching of anatta—no self—and shunyata—emptiness, which can also be translated as transparency. I endorse Buddhism’s radical agnosticism. It’s an anti-theism in the sense that it critiques every theism proposed as structurally flawed. In its place, Buddhism proposes a pure process understanding of reality: everything is dynamic, constantly changing, fluid, in process. There is no thing that holds existence by itself; you only exist in the interplay of the whole ocean of causality—karmic forces, cosmic down to species down to individual. It’s all an open system. When you wake up to your essential nature, you don’t wake up to a separate thing; you wake up to a fluid process.",
        "ts_url": "https://youtu.be/eV86_iSTEbU?t=1673",
        "archival_title": "Exploring LSD as a Practice (Edge of Mind Podcast – Part 1)",
        "recorded_date": "2022-02-17",
        "_score": 0.5737508535385132,
        "start_hhmmss": "00:27:53"
      },
      {
        "text": "h my beloved, did I realize the true cost of overextending myself so deeply into the transcendental.\nSandy Sedgbeer: Before we go to a break, one question. You said the universe is the body of God. What are we?\n\nChris Bache: We are part of the universe, so we are part of the body of God too—part of the manifestation of the universe’s intention to create. Our body is rooted in quantum and atomic reality; the evolutionary story is built into our nerves, vascular systems, and organs. Likewise, our minds are part of the creative intelligence manifesting existence. When we go deep into mind and drop beneath the depths of the personal mind, there’s no floor—we fall into the mind of the species, then into the mind of the universe. Then the Hindu teaching Atman is Brahman—the essence of the individual is the essence of the totality—becomes the most natural core truth. Another core truth is oneness: Brahman is one, and we are a fractal manifestation of that oneness. Once known, even when you return to paying bills and the tasks of the physical world, all you have to do is step back to re-appreciate these deeper truths—the deeper pulsing of life.",
        "ts_url": "https://youtu.be/2Trb-vC8zc0?t=1922",
        "archival_title": "LSD & the Mind of the Universe (What Is Going OM)",
        "recorded_date": "2023-08-17",
        "_score": 0.5675411224365234,
        "start_hhmmss": "00:32:02"
      },
      {
        "text": "played out in your experience? Because when we die, we become nothing and simultaneously everything.\nChris Bache:\nThe experience was to become one with all of existence—to become one with God, with the universe, with the One. We can’t do that if we’re not one within ourselves—if we have unintegrated shadow, ego fragments, untouchable wounds. When you move into intimacy with life, life brings these unintegrated pieces to the surface so you can make peace with them, reabsorb them, and become whole and coherent within your own being. How could you become one with life if you’re not one with yourself? These things develop synergistically: the deeper your experience of oneness with life, the deeper your experience of oneness with yourself, until these divisions disappear inside. One of the wonderful qualities we appreciate about awakened beings is their integrity, their oneness, their deep relaxation within themselves, which grows out of their intimacy with life itself.",
        "ts_url": "https://youtu.be/-vebDk9FRYU?t=2816",
        "archival_title": "Part II of his Remarkable Twenty-Year Journey into the World of Psychedelics (Edge of Mind Podcast – Part 2)",
        "recorded_date": "2022-06-03",
        "_score": 0.5652457475662231,
        "start_hhmmss": "00:46:56"
      },
      {
        "text": "ding of what’s taking place here. We’ve tagged this for one of our topics for our second discussion.\nRichard Rudd: We plant the seed now. When you go into that kind of worldview, the perfection of the choreography you’re describing is mind-blowing—the interconnectivity of soul groups, fractals, patternings of humans. One of the great insights I got from your “unit mind of the universe” book was a paradox you describe: being an individual soul and yet being everything at the same time. How does that hold up? You described it beautifully—the soul as “open on all sides.” It’s part of the ocean and yet still a focalized drop of awareness.\n\nChris Bache: It seems commonsensical that you can’t be both a part and the whole at the same time—mutually exclusive categories. Even great spiritual teachers—say, the Vedanta tradition—have said the goal of life is to abandon individuality, dissolve it, and be absorbed into the totality, to know the bliss of absorption. In that view, all the individual capacity we’ve developed over incarnations ends in extinction. I think that’s inadequate.",
        "ts_url": "https://youtu.be/jVDndxA6aZo?t=3347",
        "archival_title": "Contemplating Reincarnation (Part 1)",
        "recorded_date": "2021-04-01",
        "_score": 0.5634684562683105,
        "start_hhmmss": "00:55:47"
      },
      {
        "text": "art, but to continue evolving. Do you feel your journey confirms Buddhism, and where does it differ?\nChris Bache\nI’ve been deeply influenced by all the world’s religions. I began as a Christian and a Catholic—four years in seminary studying for the priesthood. I studied Hebrew and Greek for biblical work. I’ve learned so much from Hinduism, Buddhism, Taoism, and Native traditions. The two deepest, longest-lasting influences on me have been Christianity and Buddhism.\n\nI think my journey affirms the deepest truths of Christianity and of all the world’s religions—Judaism’s Kabbalah, Hinduism, Buddhism—while also, in important ways, eclipsing the religions of the last several thousand years. The universe I was initiated into demanded levels of understanding beyond anything I had learned in those traditions. I had to become operational within a deeper metaphysics.",
        "ts_url": "https://youtu.be/Qfet06ORfwY?t=4310",
        "archival_title": "MIND-BLOWING LSD Secrets Revealed – Rebel Spirit Radio",
        "recorded_date": "2021-07-08",
        "_score": 0.5524764060974121,
        "start_hhmmss": "01:11:50"
      },
      {
        "text": "x of cause and effect, continuously arising and passing away. There is no unchanging self over time.\nBut if you can let go of the small, separate ego-self and grow into a deeper individuality—one in continuous exchange with all living beings, continually expanding and developing—the maturation of that selfless kind of individuality is a great spiritual gift of our time-space experience. Two truths hold: the truth of wholeness—oneness, interconnectedness, interpenetration—and the truth of the learning system that experiences, learns, internalizes, and becomes more because of it.\n\nRyan Kemp\nOne thing I grappled with in your book: are we talking about one soul—what many call God—or many individual souls? Which is it, or is it both?\n\nChris Bache\nWe can use language however we like, as long as we’re clear. One can speak of God as the one soul of which we are drops in an ocean of soul—that’s fine. We can also use “soul” to refer to the accumulated experience of all my former lives integrated into a unique individual consciousness, as unique as a fingerprint, within larger matrices: the collective species mind, the planetary mind, the galactic mind. A true individuality emerges.",
        "ts_url": "https://youtu.be/Dw7D7ih8vy0?t=3104",
        "archival_title": "EP.6 - Chris Bache | LSD AND THE MIND OF THE UNIVERSE",
        "recorded_date": "2020-05-13",
        "_score": 0.549514889717102,
        "start_hhmmss": "00:51:44"
      },
      {
        "text": "t worldview and set of assumptions about the nature of self and reality. Would you like to say more?\nChris Bache:\nMy first concern was that it sounded like ego gone amok—ego inflation. I had to sit with that a long time, because my experiences told me that’s not what was happening. As you said, it’s a very different worldview. In the classic individual patient model, the individual is having experiences. The individual has transpersonal experiences, and the individual is always at the center. In this model, my individual existence was completely secondary. It becomes not a matter of my being central. I got the system started, but I dissolved completely into preexisting fields of consciousness. Those fields are the dynamic force having the experiences.\n\nThat manifested not only in the ocean of suffering, but later in archetypal reality and causal oneness. In many experiences, Chris Bache was a bit player. In the book I have an appendix: what dies and is reborn? After so many deaths and rebirths, it becomes a cognitive question. What is actually dying? It feels personal. Is it just ego dying over and over?",
        "ts_url": "https://youtu.be/-2NMOMvRkYE?t=1848",
        "archival_title": "Evolution of Collective Consciousness (Deep Transformation Podcast – Part 1)",
        "recorded_date": "2022-01-20",
        "_score": 0.5492855906486511,
        "start_hhmmss": "00:30:48"
      },
      {
        "text": "of the cosmic process integrating and interpenetrating, liberating each other from their loneliness.\nChris Bache:\nI want to be careful and remind us that a finite mind does its best to give cognitive structure to transcendent experiences. What I’m about to describe is a heuristic: a splitting of the divine principle into two halves—a “male” half that stays outside time and space in a transcendent position, and a “female” half that manifests time and space and the physical cosmos. I don’t literally think in male/female terms, but this is the best my mind could do. The principle is what matters: not all creative intelligence manifests as physical reality. Some holds position outside physical reality. There is a spiritual reality that gives birth to physical reality.",
        "ts_url": "https://youtu.be/ec0elBHJXAc?t=3022",
        "archival_title": "The Mind of the Universe: Diamonds from Heaven",
        "recorded_date": "2023-01-27",
        "_score": 0.5431375503540039,
        "start_hhmmss": "00:50:22"
      }
    ]
  }
}